{
  "data": [
    {
      "id": 945947173,
      "lang": "en",
      "location_id": 15023581,
      "published_date": "2024-04-09T08:14:29Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297549-d15023581-r945947173-Reviews-Meraki_Resort_Adults_Only-Hurghada_Red_Sea_and_Sinai.html?m=66827#review945947173",
      "text": "The staff were very friendly, professional and discreet and were always attentive and not intrusive. We really noticed this as it was our 3rd stay in Egypt. The location is beautiful, the beach clean and generally everything was kept very clean and nice. There was plenty of (fresh/grilled) food, even midnight while you party! The daily parties during the day on the beach or in the evening outdoors or in the club were also very cool. A few programs were less interesting, but the atmosphere was always good and peaceful. I would love to go again and can recommend this resort to anyone who wants a paradise under palm trees.",
      "title": "Wonderful Paradies, professional and discreet staff",
      "trip_type": "Friends getaway",
      "travel_date": "2024-04-30",
      "user": {
        "username": "Lehangry",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e7/3d/default-avatar-2020-55.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e7/3d/default-avatar-2020-55.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e7/3d/default-avatar-2020-55.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e7/3d/default-avatar-2020-55.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e7/3d/default-avatar-2020-55.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Sleep Quality"
        }
      }
    },
    {
      "id": 945549352,
      "lang": "en",
      "location_id": 15023581,
      "published_date": "2024-04-06T06:44:36Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297549-d15023581-r945549352-Reviews-Meraki_Resort_Adults_Only-Hurghada_Red_Sea_and_Sinai.html?m=66827#review945549352",
      "text": "We had an amazing ten nights at Meraki resort, the staff were amazing, fantastic animation team who really work hard to involve you in all the activities and parties during the day and night!  The music was amazing with a great selection of music from the DJ and the bar staff and lifeguards were friendly and helpful, always with a smile.  The food was very tasty with a varied menu and well presented.  The beach area was extensive with crystal clear blue water and even swings in the sea.  Special mentions to all the staff including Mo and Sol animation, Mohammad at the pool bar and Hamada near the pool!  One love!  We will be back soon, thank you!",
      "title": "Perfect experience, beautiful hotel and great staff!",
      "trip_type": "Couples",
      "travel_date": "2024-03-31",
      "user": {
        "username": "David_Barbeary",
        "user_location": {
          "id": "191252",
          "name": "Ilfracombe, Devon, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e4/59/default-avatar-2020-49.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e4/59/default-avatar-2020-49.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e4/59/default-avatar-2020-49.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e4/59/default-avatar-2020-49.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e4/59/default-avatar-2020-49.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 945659177,
        "title": "Owner response",
        "text": "Dear Guest,\n\nThe Meraki Resort Team thanks you very much for these wonderful compliments. We are very pleased that we could meet your expectations and proud of your comments!\n\t\t\nWe wish you a lovely time back at home and are looking forward to welcome you at Meraki Resort soon again!\n\t\t\nBest regards, \nGuest Experience & Quality Team\n\t\t\n",
        "lang": "en",
        "author": "Guest Experience Team",
        "published_date": "2024-04-07T03:41:30Z"
      }
    },
    {
      "id": 945260685,
      "lang": "en",
      "location_id": 15023581,
      "published_date": "2024-04-03T17:17:21Z",
      "rating": 5,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297549-d15023581-r945260685-Reviews-Meraki_Resort_Adults_Only-Hurghada_Red_Sea_and_Sinai.html?m=66827#review945260685",
      "text": "Meraki, like a second home, excellent service, delicious food, great animation, cool parties, unforgettable impressions . The territory of the hotel is large, the animators constantly interact, it is not possible to be sad, a big plus is that the hotel serves seafood",
      "title": "Beautiful evenings, hospitality, fun, activity, the opportunity to have a good rest. Thanks to the hotel and the staff .",
      "trip_type": "Friends getaway",
      "travel_date": "2024-03-31",
      "user": {
        "username": "220lenaz",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ea/2e/default-avatar-2020-67.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ea/2e/default-avatar-2020-67.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ea/2e/default-avatar-2020-67.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ea/2e/default-avatar-2020-67.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ea/2e/default-avatar-2020-67.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 945290512,
        "title": "Owner response",
        "text": "\nDear Guest, \n\nWe want to thank you for taking the time to rate us. We hope to have the honor to welcome you again in our resort. \n\nBest regards, \nGuest Experience & Quality Team\n",
        "lang": "en",
        "author": "Guest Experience Team",
        "published_date": "2024-04-04T02:47:44Z"
      }
    },
    {
      "id": 944750437,
      "lang": "en",
      "location_id": 15023581,
      "published_date": "2024-04-01T04:24:29Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297549-d15023581-r944750437-Reviews-Meraki_Resort_Adults_Only-Hurghada_Red_Sea_and_Sinai.html?m=66827#review944750437",
      "text": "Had a great holiday at Meraki over last 2 weeks. I wasn’t feeling great having developed a condition just as flying out which had me staying out of sun and water! It did put a bit of a dampener on whole thing however I can’t say anything other than positives about the hotel and the staff. \n\nI’ll highlight the positives regarding my opinion of the hotel first however there are a few minor negatives not worth writing. The reception staff, on arrival were very good, John/Hisham and colleagues. Our room 6208 was ready really quickly however we went into the adjacent bar and Mohammed and Islam were there and were really cheerful and quick with the drinks.\n\nAfter we left the bar Mahmoud took our cases to our room and explained the layout of the hotel, he was great. \nThe room itself was across from the building that was being renovated so, albeit not ideal, it was clear that they made every effort to shield other guests from these works. I never experienced dust on balcony as other reviewers have mentioned and I heard the stihl saws working away during day or drills or whatever and the people are obviously working long hours to limit potential upheaval. Room was ok, yes it will no doubt be upgraded at some point which is fine as there’s been lots of remedial work done , I’m sure if we’d brought it up management would have moved us but, for us, it was a minor point. Also Wi-Fi is great throughout hotel, we brought a firestick and it worked fine. We’ve been in Egypt many times and this was definitely the best Wi-Fi so far.\n\nOur room was always immaculate as Ali did the cleaning and was always spotless with lovely towel designs on our return and even a bunch of flowers on one occasion. Also stocked up with free Coke/Sprite/Fanta (which are normally paid for after first lot) and plenty of water. Thanks again Ali!\n\nAs well as Mohammed and Islam in the lobby bar, they were joined by Mustafa and Kholod as well as, later on in our 2 weeks Said. We never lacked attention throughout both in the bar and at poolside. There are 2 pools however we stayed at the one beside main hotel so can’t comment on other one but believe it’s bit busier and the animation team reside there, I met a few of them and they were great, mention to JJ from London who’s great guy and we wish him the best in his journey.\nI believe that there was entertainment at main pool or near however I wasn’t up to it so can’t comment. There are also beach beds which looked great as well. There’s option to go diving too which I normally do as well as a spa for massage etc. which we also do but didn’t under circumstances but heard opinions that they were great.\n\nRegarding the pool, we had Hassan/Naser doing the pool but mostly Mohammed who was a lovely guy and was really attentive and helped us on every occasion if somebody, no elbows, was moving her bed all over place! Thanks Mohammed!\n\nThe main restaurant is fantastic as are the staff, Head Chef is Mahmoud who’s great and Assistant Head Chef is Shalash who was a true gentleman and nothing was too much trouble, he just made you feel, “important”. Others there to mention are Ibrahim/Ali/Mahmoud/Mohammed (yes there’s a few) and Amr who made fantastic omelettes and fried eggs and was always smiling. There was always a brilliant assortment of food available in this restaurant for all meals, as well as drinks. Another guy (can’t remember name) was the guy behind bar in restaurant, who was always on ball. There’s also a barbecue every day just outside and, again, was always something different.  I’m a big coffee drinker and wasn’t sold on it however I defaulted to aniseed tea with honey from big mason jars and it was amazing! First time I’ve tried it and have now bought some here. Special mention to Hosny as well who works constantly!\n\nOn the subject of coffee there’s a dedicated coffee shop just at bottom of stairs which, via the QR code, you can see the full selection. This is a great touch and Ahmed was always on call from 10am onwards. Served in disposable cups you could just take back to your lounger. That is good coffee!\n\nNext to the coffee shop was the Burger Bar (Happy Grillmore lol and the Noodle Bar. Lots of lovely guys in there, Anas (Anasay), Sharif, Timor being the ones that stuck out as well as Amr from the restaurant and Mohammed as well as Ahmed. Everybody was always in good spirits and they just made the experience so much better. The burgers and noodles are amazing and you order via on-screen menu as in McDonalds it’s great idea.  If you walk further on you’ll get to – eventually – the Pizza place, also amazing with sea view.\n\nFurther to these restaurants there’s other restaurants part of AI in Egyptian/Asian and Greek. The Greek, I believe was being moved as it was down near the beach and, when we ate there on one occasion it was seriously good. The Asian is also amazing us dining there twice, through booking in room near reception. We had chicken/crispy fish/rolls as starters followed by Kung Pao beef. For the Egyptian (same place on different nights) we had the recommendation of the Manager Mohammed (who also works in main restaurant), an absolute gem of a man and made us feel very welcome in both places. Also Ali as our waiter who, again, was welcoming and friendly.\n\nSome other minor positives are we opted to use the laundry service in the hotel, we crammed all the clothes that we’d worn throughout the holiday and got them washed and ironed for £12! What a service and I’m already packed for next trip! \n\nFor guests who venture out and want to shop a little, we never went to main towns this time however it’s great to mosey around. We did go to nearest mall with a Carrefour and there were lots of other shops like clothes shops for somebody! We got great deal from Esac in the cigarette counter, Word of warning don’t buy cigarettes or tobacco from mini mart outside at front of hotel as it’s fake! (NOTHING TO DO WITH HOTEL) I was told that it was real as I asked and was told, emphatically, that it was real! Now this could be what the chap was told however it was. I should’ve gone back but wasn’t really feeling up to it! \n\nThe onsite shop in the hotel sells real tobacco/cigarettes though and Roma will help you out there if you don’t want to venture as it's roughly same price.\n\nThe sunglasses shop, run by Tomas, also has some great bargains and are all real deal and Tomas was very helpful. They also do prescriptions so make sure that you have it and grab yourself a bargain.\n\nTaxi service is great and Mustafa is front man, much safer than using local hash dealers or even Uber which is available in Hurghada. \n\nThe unsung heroes, e.g. gardeners if you haven’t seen the painstaking process of weeding/feeding to make gardens look spectacular. Kitchen staff as your food doesn’t magically appear as well as everyone else who helps run the hotel thanks!\n\nThe management, every few days visited the poolsides en-masse, with fruit/mocktails, they were accompanied by relevant department heads/staff. I saw this as a very nice touch. It allowed guests to both comment/complain/praise. What puzzles me are the keyboard gangsters who find something to moan about when that was the time to rectify, i.e. every other day?  I met Sharif the General Manager a number of times and he was every bit the “General” yet very receptive to any and all comments. I did see someone complain and that complaint was dealt with both instantaneously and ongoing for our stay; I never saw it as a complaint however the hotel adapted to an individual as they had cause to raise it.\n\nI’ve been to Egypt ongoing for past 14 years and this is only hotel that I’d like to revisit to fully experience when firing on all cylinders. I hope that your read, in part, has convinced you to book your holiday? You’ll be glad that you did.  \n\nA quick mention to Mary in the attached Pharmacy who, in conjunction with the doctor, diagnosed me and provided correct medication at really low cost and, being back now, has me well on road to recovery so thanks for your help.",
      "title": "Egyptian Experience!",
      "trip_type": "Couples",
      "travel_date": "2024-04-30",
      "user": {
        "username": "sollyl2013",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ee/68/default-avatar-2020-9.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ee/68/default-avatar-2020-9.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ee/68/default-avatar-2020-9.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ee/68/default-avatar-2020-9.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ee/68/default-avatar-2020-9.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 944884748,
        "title": "Owner response",
        "text": "Dear Guest,\n\nThe Meraki Resort Team thanks you very much for these wonderful compliments and detailed review. We are very pleased that we could meet your expectations and proud of your comments!\n\t\t\nWe wish you a lovely time back at home and are looking forward to welcome you at Meraki Resort soon again!\n\t\t\nBest regards, \nGuest Experience & Quality Team\n",
        "lang": "en",
        "author": "Guest Experience Team",
        "published_date": "2024-04-02T01:57:02Z"
      }
    },
    {
      "id": 944544848,
      "lang": "en",
      "location_id": 15023581,
      "published_date": "2024-03-30T14:39:03Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297549-d15023581-r944544848-Reviews-Meraki_Resort_Adults_Only-Hurghada_Red_Sea_and_Sinai.html?m=66827#review944544848",
      "text": "The animators team is amazing, they kept us moving all day, with all kind of exciseizis. All team was great, but best expression was left by David and Soul, both most gentle and caring people, filled our trip with laught and exitment🥰. Thank you for great holiday, animator team and house keepers",
      "title": "Perfect",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "ugniusb2024",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/eb/6d/default-avatar-2020-19.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/eb/6d/default-avatar-2020-19.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/eb/6d/default-avatar-2020-19.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/eb/6d/default-avatar-2020-19.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/eb/6d/default-avatar-2020-19.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 944598034,
        "title": "Owner response",
        "text": "Dear Guest,\n\nThe Meraki Resort Team thanks you very much for these wonderful compliments. We are very pleased that we could meet your expectations and proud of your comments!\n\t\t\nWe wish you a lovely time back at home and are looking forward to welcome you at Meraki Resort soon again!\n\t\t\nBest regards, \nGuest Experience & Quality Team\n",
        "lang": "en",
        "author": "Guest Experience Team",
        "published_date": "2024-03-31T01:54:47Z"
      }
    }
  ]
}