{
  "data": [
    {
      "id": 920586106,
      "lang": "en",
      "location_id": 1741756,
      "published_date": "2023-10-09T21:13:50Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g951437-d1741756-r920586106-Reviews-Mio_Bianco_Resort-Akyarlar_Turgutreis_Bodrum_District_Mugla_Province_Turkish_Aegean_Co.html?m=66827#review920586106",
      "text": "Don't make the same mistake as I did, in thinking, 'ah there isn't that many bad reviews for the year' that is because there are very little foreign nationals in the bodrum area now, hence why I think not many reviews on these sites!! But I can tell you no one was happy and we witnessed many complaining and leaving the hotel to find another...YES its THAT bad!!! It was shut down the previous year!\n\nWhen the transfer dropped us off, our hearts sank immediately before we even stepped inside the reception. You could tell straight off how run down it was. Then when you go into reception, your doubts are confirmed, with holes in walls and chairs and floor all dirty. When getting the key, they asked someone to check the room was ok (surely this should have been done before our arrival)\nWe got taken to our room and before we even stepped in, there was all the previous occupants dishes, rubbish bag and dirty towels etc. (The dishes stayed there the whole 2 weeks we were there)\nWe then entered the room where the floor was really dirty. The bathroom taps/shower, toilet brush, bin and mirror were all rusted. There was a blue plastic bag filled with water over one of the drains, we didnt know why it was there so left it, though after hearing another families issues, they had actual excrement floating on there bathroom floor when they finally got moved into the room they were meant to be in, so we decided to leave the water filled bag there! It was sooo dark in the bathroom as there were only 2 spot lights and one of them barely worked. There were live wires in the bathroom sticking out above the mirror and a large gap between the plug/hairdryer unit and the wall (massive health and safety issue)\nOur bed sheets hadn't been changed as had hair all over it and was dirty! So had to sleep on our towels. 4days of no cleaner and going to reception to ask for new bedding. On the 4th day they just laid the pile of bedding on our beds for us to change!! one of the sheets was meant to be a double but all were singles!\nThe 3rd floor balcony rail was wobbly (you could see they tried to fix it with some wood which had since rotten, and some silicone)\nAircon in front room didn't work properly, didn't blow cold. Aircon in back room was good, that was until it started making a loud noise and then shot out Ice!! This happened twice and resulted in multiple trips to reception again, where they would fix that and the other was never touched!\nIf you want your room cleaned, you need to tip them, though careful as they have a thief amongst them, as one stole my perfume! ALWAYS keep your valuables in your possession!!\nThere are no channels on the TVs.\nNo WIFI in the rooms!\n\nThe guttering around the pool was rusted and not fitted properly. Inside the guttering it was blocked with dirt, leaves, bugs and food!!\nThe slides are only open 2hrs a day. The kids pool is turning green with dirt and litter. The toilet there was blocked with feeces and tissue. There was a junk room next to the slides that was open so dangerous for kids. There was a pipe going across the floor so was easily tripped on. There was a hole under the stairs, so kids again could fall in there!\n\nBelow the rooms, were what seemed to be underground rooms as they had windows and doors, but this area was flooded and there were visible wires!!\nThere is no proper drainage on the balconies!! there is a drain and a pipe but any dirty water that goes Into it (we were on 3rd floor) it would fall straight onto the ground floors balcony and then Into the pool, as there was no connecting pipes between the balconies and no drain on the ground floor swim up balcony. The pool is only cleaned every 3-4days.\nThere is barely any sunbeds!\nThe food was OK, though 2nd week it got boring and you have to get there early to get a table.\nKids evening entertainment was only 10mins long and every few nights. As was any other entertainment, in the 2 weeks we were there, we saw 3 shows!\nYou can often smell the sewage wherever you were in the hotel.\nThere is no market, spa or gym!\nOut of the 21 photos advertising the hotel, 10 of them are not even of this hotel!! and the 11 that are, half of them are really old and no longer accurate!!\nWe met with the rep, Bayram Inan, where we put in a complaint, we also spoke with LoveHoliday who said they would investigate and we never heard anything more!! We booked a boat trip with the rep for our boys 16th bday and that wasn't much better! The rep told us drinks would be about 2-3euros each, but were 8euros!! The stops were just to allow you to swim in the ocean, there was no camels, dolphins or even a beach to go on! Then to top that off, the stop where you eat lunch, is right infront of the hotels beach!!! We never saw the rep again and was told he had left. We then found out he often does that to wait for current unhappy tourists to leave and then comes back when new ones arrive.\nLove holiday are mis-selling this hotel!! They have never sent anyone out to check it and out of 18 families that had been out there from Feb to end of Aug, 16 of them have complained and its on their radar!!!! NOT GOOD ENOUGH LOVEHOLIDAY\nWe recieved feedback from the hotel about our complaint via LH, where the hotel are saying their market, gym, spa etc are all open!! and also they moved us to a swimup room. These are both lies and luckily we have lots of videos and photos to prove it all",
      "title": "WORST HOTEL EVER! BIG HEALTH & SAFETY ISSUES",
      "trip_type": "Family",
      "travel_date": "2023-08-31",
      "user": {
        "username": "OZKAND895",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e7/3d/default-avatar-2020-55.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e7/3d/default-avatar-2020-55.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e7/3d/default-avatar-2020-55.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e7/3d/default-avatar-2020-55.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e7/3d/default-avatar-2020-55.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 920084899,
      "lang": "en",
      "location_id": 1741756,
      "published_date": "2023-10-06T16:48:17Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g951437-d1741756-r920084899-Reviews-Mio_Bianco_Resort-Akyarlar_Turgutreis_Bodrum_District_Mugla_Province_Turkish_Aegean_Co.html?m=66827#review920084899",
      "text": "Obviously the worst experience we ever had.Ladonia chain don’t care about you,your holidays,your comfort,your feeling,your worries,your holidays,your time.Choose another hotel,cuz that hotel is one star",
      "title": "Horrible ",
      "trip_type": "Couples",
      "travel_date": "2023-09-30",
      "user": {
        "username": "bellabC5005GK",
        "user_location": {
          "id": "186460",
          "name": "Cardiff, South Wales, Wales"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e2/4a/default-avatar-2020-42.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e2/4a/default-avatar-2020-42.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e2/4a/default-avatar-2020-42.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e2/4a/default-avatar-2020-42.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e2/4a/default-avatar-2020-42.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 920001705,
      "lang": "en",
      "location_id": 1741756,
      "published_date": "2023-10-06T05:49:44Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g951437-d1741756-r920001705-Reviews-Mio_Bianco_Resort-Akyarlar_Turgutreis_Bodrum_District_Mugla_Province_Turkish_Aegean_Co.html?m=66827#review920001705",
      "text": "Please read this review if you are considering booking this hotel. It is honestly the most worst and despicable place we have ever ever stayed! To put it into perspective how truly awful this place is, we arrived at 11pm on the Monday evening, and had handed the room keys back and moved ourselves to another hotel by 10am the next morning. We booked this package holiday through loveholiday - please please let me also say DO NOT BOOK A HOLIDAY WITH THIS COMPANY!\nAt check in, the hotel staff were very unfriendly and could not speak very good English. The reception area was dirty, hot, with tatty, dirty seats, broken lights, and grubby walls. The main hallways were littered with dirty plates, cups and dirty bowls with cat food in them.\nWe had two rooms booked, a double and a twin. The key card would not work for the door to the twin room. Eventually we were let in by using a door key. Please let me state here that I use the term 'room' very loosely as a prison cell would look more appealing. \nWe were not shown how to work the Air Conditioning in either room. The Air Conditioner in the twin room did not work, was broken and hanging off the wall. It did work in the double room, if that’s what you call it as it barely gave out any cool air.\nThe shower fittings in both rooms were rusty and corroded, with the shower itself looking dirty, unhygienic, and disgusting.\nThe TV in the twin room was hanging off the wall, looking like it was about to fall.\nThe beds in the twin room were tiny and resembled that of a child’s bed. My oldest son was literally hanging off the end when he laid down. The bed linen was stained and disgusting quality.\nThe bathroom in the twin room had two bare wires wrapped in insultation tape poking out of the wall. This caused us extreme safety concerns and anxiety about our sons using the bathroom. Our concerns were that extreme that we told them they were not to use the bathroom and to come to ours instead. Had one of our sons been electrocuted, the hotel that loveholiday is currently advertising as 'Deal of the Week' would have some very serious questions to answer. \nThe temperature in the twin room was stifling as there was no air. We opened the doors to try to get some air into the room and immediately a stench of sewage swept in. The Juliet balcony was loose and dangerous, so again another serious safety issue we had with this room.\nWe were given tiny plastic cups of water in the room and a sign in reception said that we would be charged if we wanted any more. We had not had a drink for hours due to a very delayed and traumatic flight, and this was all that was offered to us. At this point it was around 12:30am so there was nowhere else to get a drink.\nWe asked the receptionist for my sons to be moved to a different room but was told that the hotel was fully booked and there would be no way this is possible until the morning. We then asked if someone could come and look at the Air Conditioning unit in the twin room as it wasn’t working and told that there was no engineer available until the next day. By this point we were all extremely tired and had to reside ourselves to the fact that there would be no resolution to this until the next day, and to try and get some sleep.\nWhilst I was walking from my sons room on the third floor to our room on the fourth there was a power cut just as I was mid-way on the stairs. I was thrown into complete darkness as no emergency lighting came on. There was no emergency exit lighting that came on, and I’m not sure there was even any emergency exits on either floors. There were no staff around to help or explain what was going on. I had to sit on the stairs panicking as to what to do. I was completely terrified. My husband and sons thankfully came and found me using the light on their phones. The lights remained out for at least 5 minutes. As we were deciding what was the best thing to do, eventually they did come back on. This is obviously a huge safety concern, and at this point we were extremely worried about leaving our sons on their own in their room incase this happened again. We were all on edge and knew none of us would be getting any sleep that night.\nThis hotel is dangerous! If a fire happened there is no emergency procedure, the hotel room doors did not have a fire exit procedure indicating how to exit the building in an emergency, no emergency lighting and no fire exit signs in the hallways. \nIn the morning after a horrendous night of attempting to sleep, we asked reception when my sons could move rooms as promised the night before. The receptionist was different to the one the night before and pretended to not understand a word I was saying, shaking his head, and speaking in Turkish to another hotel worker and laughing. We felt extremely uncomfortable and getting more and more frustrated.\nWe attempted to speak to a rep to get help - all he was interested in was selling us excursions - no help what so ever!\nWe had looked at the Trip Advisor reviews a couple of days before we travelled and were concerned, but honestly believed that the hotel could not be as bad as the reviews were saying. But it was that bad, and worse! The reviews stated that it took some people as much as four days to be moved, at this point we didn't really know what to do for the best. But decided to check out the restaurant to see what breakfast looked like!\nOMG - flies everywhere, cold 'hot' food, warm 'cold' food, disgusting dirty restaurant. Needless to say, none of us ate a single thing.\nloveholidays description of the hotel is a complete misrepresentation with photographs that are not even of this hotel. There is no gym, there are no Turkish bath, there is no market and there are not two restaurants you can eat at and certainly not an a la carte restaurant. The hotel is falsely advertised on this website and is tricking and lying to people who spend their hard-earned money to stay in what they believe is going to be a four-star hotel. This hotel is not even a one star!\nAfter spending a horrendous 11 hours at this hotel, we decided to take it upon ourselves to move to another hotel. My husband is self employed and taking time off work is difficult and expensive, so this would be our only holiday for god knows how long. So we didn't want to waste a single moment longer in this place. It cost us a further £1700 to move hotels, but we had no other choice as we were extremely concerned for our health and safety.\nSince being home we have put a complaint in to loveholidays about all our issues and concerns. We recently received a response, where basically they have called us liars about each point raised. We are now in the process of getting legal advice. \nPlease please, do not consider booking Mio Bianco Resort. I never write reviews, but feel so strongly about this. I would hate another family to suffer what we did. And the expense as well - thankfully we were able to pay to move to ourselves to another hotel. We cannot afford to do this, but had very little choice. I am sure there are some families that would not be in a situation where they could pay to move - so please listen to all the terrible things said about this hotel, because every word said is true. They are not exaggerated!!",
      "title": "HOTEL FROM HELL !!!!!!! PLEASE PLEASE READ THESE TERRIBLE REVIEWS AND BELIEVE EVERY SINGLE WORD.",
      "trip_type": "Family",
      "travel_date": "2023-09-30",
      "user": {
        "username": "mwhitaker7",
        "user_location": {
          "id": "186338",
          "name": "London, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ed/7b/default-avatar-2020-6.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ed/7b/default-avatar-2020-6.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ed/7b/default-avatar-2020-6.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ed/7b/default-avatar-2020-6.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ed/7b/default-avatar-2020-6.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 919482677,
      "lang": "en",
      "location_id": 1741756,
      "published_date": "2023-10-02T13:00:47Z",
      "rating": 2,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g951437-d1741756-r919482677-Reviews-Mio_Bianco_Resort-Akyarlar_Turgutreis_Bodrum_District_Mugla_Province_Turkish_Aegean_Co.html?m=66827#review919482677",
      "text": "We booked this hotel back in May 2023 before seeing any of these recent reviews, the photos looked nice and we liked the idea of having a private beach, We werent expecting a five star world beating hotel, just something nice and relaxing for our holiday, we got a good deal on the package through love holidays and we’re looking forward to our holiday as anyone rightly should do,  \nthis was until a few weeks before we were due to depart we were showing friends, the hotel with the possibility of them booking and coming with us and that’s when we saw all of the recent reviews people have written about their horror stories,  \nI will try and be fair and address other peoples concerns as well because I think some people have wildly over exaggerated certain things in there claims\n\nBefore we arrived at the hotel, we were petrified of what we might turn up to and what we had spent our hard earned money on, I had saved all emergency contact numbers for needing a new hotel and how we could go about doing this without causing to many issues but being fairly treated;   The transfer from the airport was great, this hotel though is about 75 minutes away from the airport and the last 20 minutes, although beautiful scenery are very rugged badly maintained roads which added to our concern about what we could’ve let ourselves in for, but we were pleasantly surprised with a beautiful exterior of the hotel when we arrived, when we walked up to the front desk, we were slightly dubious as there was five or six Turkish guys, just standing there, chatting away behind the desk, not bothering to serve or taking interest that we had turned up, when they did decide to take our name, thankfully, they had a reservation and told us we were in a newly refurbished room on the fourth floor, straightaway One of the guys came from behind the desk, and took our suitcase and offered to started to carry it to the room for us, he took us up to our room, but came in with this and waited around and was very hesitant to leave until he got a tip,  I would be slightly worried about this behaviour if I was a female traveller or on my own, because he spoke no English, just waited with hand on top of the suitcase,\n\nROOM:\nOur room, we were pleasantly surprised with, had a nice view of the beach, partially obscured by trees, but we had paid for a beach view and couldn’t complain really as the trees made the view nice as well, the room had clean sheets weren’t brand-new, but certainly weren’t stained and had been freshly laundered recently, my wife being a clean freak was happy with the room and the effort that the housekeeping team had put in, the room in general We were pleased with the bed was nice and comfortable, my only gripe is that they give you a tiny and I mean tiny top sheet to share for a double bed which throughout a weeks holiday was cleaned each day, but some days we got a sheet big enough for the two of us some days the sheet could be the size of a beach towel, we asked housekeeping and front desk for a second sheet but nothing every came of it;  the air conditioning in the room worked very well and you could feel any temperature adjustments within 10-15 minutes \nShower was nice and powerful \nRoom had a safe which looked like it had seen better days,\nWe left things out in our room and everything was always there when we came back so can’t say we were overly worried about things going missing\n\nFOOD:\nThe food area is very small, but the dishes are well presented and the ones I had were very well cooked and tasty, I will say the food is heavily heavily targeted towards Turkish and Russian audience, I would say the menu is a three day, rolling menu, because it was either fish, beef or chicken, and this rotated throughout our stay,\nThere is an outside cooking area behind the drinks machines which cooked a beautiful beef that we only had once unfortunately, and in the mornings they did sometimes pancakes and chips, but this was very hit and miss if this was open or not with no signs or notice from any staff to whether would be open or not,  a shame because the food was fantastic from here and always being cooked fresh\nThere is always lots of loaves of fresh bread, cheeses and desserts, but not much variety in other items\nLunch is basically leftovers of the day before but always well presented and cooked\n\nAll of the seating area is outside and very nice especially with the breeze\n\nThe hotel advertises that they have 2 à la cart restaurants that we could never get an answer from anyone about booking these, and when we found them they didn’t seem to be open or anyone willing to give us an answer about booking\n\nThe sister hotel across the road does snacks from 2 pm to 4 pm, chips, burgers, and sometimes fish, which was a nice touch and accessible to this hotel as well \n\nANIMALS:\nYes, there is maybe five or six cats that roam the courtyard/pool area, but I must say I never saw any of them go to the toilet or jump up at people, yes they sit in beg and look at you as you’re eating but they are all very friendly, both of us are massive animal lovers and I will admit we did feed them tip bits of the table and try and encourage them in for a fuss but still not once did they jump up or Cause any problems for us or any other guests\n\nOn the beach, there is dogs that occasionally roam through, but again they are not there to annoy the guest, they’re just looking for a shady area,\n\nThe only issue we had with animals our whole stay day was actually from hotel Guests who seemingly are allowed to have dogs in their rooms, the room next to us had two of the rattiest little ankle biting dogs that were scrapping at the doors and barking from 11pm- 2am most nights,   \n\nBEACH:\nThe beach area is literally a two minute walk from the hotel through the grounds of the sister hotel. The Beach is divided up into two parts, one for this hotel and the other part for the sister hotel, make sure you go on the correct side as we were rudely told off by a staff member from the sister hotel that we weren’t allowed on this part of the beach as it was reserved for the sister hotel only\n\nThis was not a problem as the part we were allowed on was still lovely lots of sunbeds, some with foam padding, and beautiful views over the ocean.\n\nThe pool at the Hotel is nice and has a bar in the middle island .  \nWater I would say is 1.2m Deep throughout but water was always clean and staff getting leaves out \n\nSome people have commented on a smell of sewage whilst on the beach, and in the hotel, we did encounter this some days, but it certainly isn’t as bad as people make out, \n\nnot taking away The smell is horrible, but we only really smelt it for 5- 10 minutes maximum each time and it did seem to be when the wind was blowing a certain way.\n\nSTAFF:\n\nI’ve left the worst till last unfortunately, the staff at the hotel may be able to speak English, but they make no effort to try unless it involves money for them,  I asked about local recommendations, booking taxis, booking the à la cart restaurant, getting spare towels, what time dinner was \n\nMy reason for saying they are only involved in Money is because when I tipped one of the bar staff who was always friendly and attempted to speak English to me and my wife all of a sudden one of the front desk team came over and said he had booked a taxi while staring down at my wallet,\nI will not pretend that I speak any Turkish but I tried and also tried to use google translate if I could, \nI am not a typical Brit who expects everyone to speak English but some of the staff here are not willing to help unless there is something in it for them\n\nThe reps at the hotel are nice enough, but they are desperate to sell you tours and excursions, I made it very clear to them straight away when they bought it up that I’m more than happy to chat with them, but I’m not looking for any excursions either from them or from any other company, so as they don’t have to waste their time \nAfter they managed to understand this, they do leave you alone",
      "title": "Please read before booking / reading other reviews",
      "trip_type": "Couples",
      "travel_date": "2023-09-30",
      "user": {
        "username": "687declanw",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/de/0a/default-avatar-2020-35.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/de/0a/default-avatar-2020-35.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/de/0a/default-avatar-2020-35.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/de/0a/default-avatar-2020-35.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/de/0a/default-avatar-2020-35.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 918866131,
      "lang": "en",
      "location_id": 1741756,
      "published_date": "2023-09-28T13:37:51Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g951437-d1741756-r918866131-Reviews-Mio_Bianco_Resort-Akyarlar_Turgutreis_Bodrum_District_Mugla_Province_Turkish_Aegean_Co.html?m=66827#review918866131",
      "text": "Don't you ever book this hotel, this is a total disaster, our vacation was ruined, the stuff, food, animation everything was TOTAL DISASTER !!!! On top of that I got robbed from my own room, I have left my bag with money in it in and when I got back from the beach half of my money were gone. I called police and when they checked the key log only the housekeeping staff were the ones entering my room, but the managment of the hotel was telling me how am I sure that i haven't lost the money somewhere. They robbed me 950$ which is a lot of money !!!! They didn't even said one sorry to me, WORST MANAGEMENT EVER !!!!  OUR VACATION WAS RUINED !!! After I left the hotel, after 2 weeks another family from my country got robbed 250 Euros from their room as well !!!!! DON'T BOOK THIS HOTEL !!!!!",
      "title": "DON'T BOOK THIS HOTEL - I GOT ROBBED !!!! IT'S TOTAL DISASTER !!!",
      "trip_type": "Couples",
      "travel_date": "2023-08-31",
      "user": {
        "username": "stefantP3568RU",
        "user_location": {
          "id": "295110",
          "name": "Skopje, Skopje Region"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f0/9f/default-avatar-2020-16.jpg"
        }
      },
      "subratings": {}
    }
  ]
}