{
  "data": [
    {
      "id": 945664575,
      "lang": "en",
      "location_id": 292642,
      "published_date": "2024-04-07T04:35:40Z",
      "rating": 5,
      "helpful_votes": 3,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635614-d292642-r945664575-Reviews-The_Ixian_Grand_All_Suites_Adults_Only_Hotel-Ialyssos_Rhodes_Dodecanese_South_Aegean.html?m=66827#review945664575",
      "text": "I came here with my partner April 2nd - 7th and it was pure paradise from start to finish. \n\nWeather\n\nThe weather was absolutely perfect ranging between 22 and 25 degrees with a lovely breeze. If we were to come again we would come at the same time purely for the weather being so perfect.\n\nRoom\n\nWe stayed in a premium swim up room which was absolute luxury. The bed was huge and super comfortable. The swim up pool was absolutely freezing as it didn’t get much sun but we didn’t mind this as it was a lovely way to wake up with a coffee (the coffee machine was a Nespresso machine with pods which was also a real treat). There were 2 really good size mirrors, perfect for doing makeup/seeing your outfit full length. There was shampoo and shower gel provided along with dental sets containing toothbrush and toothpaste. The hairdryer is ok but not great for thick hair - I would bring my own next time. The air conditioning is 10/10. We were also given clean towels every day both for the beach and bath towels. The pool was also cleaned daily. Wardrobe space was small but perfect for a week’s stay. Couldn’t fault the room at all.\n\nDrinks/Food/Dining \n\nThe all inclusive drinks are what they are - it’s what you’d expect for an all inclusive drinks package. There’s a large range to choose from (beer, wine, ready mixed cocktails) but by the end of the week we were nipping to the shop near by for some nicer lager/wines (which were super cheap - highly recommend).\n\nAs we had a premium swim up room we had access to all 4 restaurants (not just the buffet). I cannot recommend doing this enough. We ate at all 3 other restaurants throughout our stay (1 Greek restaurant with a fixed menu, 1 Japanese restaurant with a fixed menu and Alazonia Restaurant which changed its menu daily and was also open for breakfast - the best breakfast ever btw) and totalled up what it would’ve cost us for food had it not been part of our package and it was about what we paid for the room. If you can afford paying that bit extra for a premium room (for us this meant £150pp extra for 5 nights) it should be a no brainer. Eating at these restaurants made the holiday for us. The staff were AMAZING and the food was so so good for every meal. It’s important to make reservations at the Greek and Japanese restaurant at the start of your stay as they get reserved very quickly. You can do this through the hotel app or reception. \n\nI also have a severe nut allergy and the staff were beyond vigilant in making sure that my food was safe to eat in every restaurant we went to. \n\nEntertainment \n\nThere’s very little entertainment at this hotel which isn’t something we cared about at all but if you’re after an evening show it’s probably not for you. During our stay there was a violinist, a sax player and a couple of singers during the evening (around 8:30-10pm) every night. \n\nI read a review before coming describing the music around the hotel as ‘musical onslaught’ that they couldn’t get away from which I don’t think is very fair. There is music in every restaurant - some questionable tracks for the environment that you’re in but nothing to moan about. If anything it was just something to have a giggle at. The pool/beach is super peaceful and there’s no noise from the rooms at all.\n\nPool Area/Beach\n\nMost importantly there is no rush for beds. I’m not sure if this is because of the time of year we stayed here but we could come down at 12pm or 3pm and there would still be a good choice of beds to choose from. There are also beds on the beach which is a pebble beach - not something we’re hugely fond of so didn’t stay on these but again, plenty of availability. The beds themselves are cushioned and super comfy and you can order drinks from your bed. The pool itself is lovely - again quite cold but to be expected. \n\nThere is also a quiet pool which we went to once - it’s got 10 beds but is rarely full so a really nice place to go if you just want to read your book in peace for example.  \n\nTransfer from Airport \n \nAs we had a premium room the hotel offered to pick us up and take us back to the airport free of charge which was such a lovely touch. I did have to call the hotel on arriving as the car wasn’t there waiting but it only took 10 minutes for them to arrive (this could easily be sorted with an email to the hotel in the morning reminding them when you’re due to land). The staff member who picked us up was so accommodating offering us water/taking our bags etc and the car was also very luxury - starting the holiday off as it went on. If you don’t have a premium room I’ve heard that it’s about €16-18 for a taxi one way. \n\nWe will definitely be returning here again.",
      "title": "Best Holiday Ever!",
      "trip_type": "Couples",
      "travel_date": "2024-04-30",
      "user": {
        "username": "Z3525YVrobynm",
        "user_location": {
          "id": "186466",
          "name": "Swansea, Swansea County, South Wales, Wales"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/28/d2/bd/af/caption.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/28/d2/bd/af/caption.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/28/d2/bd/af/caption.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/28/d2/bd/af/caption.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-m/1280/28/d2/bd/af/caption.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 945137880,
      "lang": "en",
      "location_id": 292642,
      "published_date": "2024-04-03T07:46:32Z",
      "rating": 5,
      "helpful_votes": 3,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635614-d292642-r945137880-Reviews-The_Ixian_Grand_All_Suites_Adults_Only_Hotel-Ialyssos_Rhodes_Dodecanese_South_Aegean.html?m=66827#review945137880",
      "text": "The taxi from the airport to the hotel was about 15-18 minutes which was great and only cost about 16 euros.  When you walk into the hotel lobby it will instantly put a smile on your face with how beautiful it all looked. The staff omg they were totally awesome Anna, Tina, Soula, Vaggelis and Anestis they were constantly helpful with all our needs and always greeted us with a smile and conversation. The hotel facilities the spa, the pools indoor and out were 5*, the buffet style restaurant food selection was outstanding there was so much food to cater to everyone’s needs I believe. As I was only there for a short period of time they had hotel entertainment which I did watch for a bit and they were good. The only thing that I had a problem with was that they had a pebble beach but that was my only concern cause I had a bad ankle, however the whole ambience made up for that. By day and by night this hotel was just a beautiful relaxing environment and I will definitely go back again. I will end on the note of all the staff work hard and long hours everyday and I just want to thank them for making mine and my cousins stay one of the best ones.",
      "title": "All inclusive in paradise",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "Moshartay1",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ea/74/default-avatar-2020-68.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ea/74/default-avatar-2020-68.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ea/74/default-avatar-2020-68.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ea/74/default-avatar-2020-68.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ea/74/default-avatar-2020-68.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      }
    },
    {
      "id": 944384766,
      "lang": "en",
      "location_id": 292642,
      "published_date": "2024-03-29T10:45:31Z",
      "rating": 5,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635614-d292642-r944384766-Reviews-The_Ixian_Grand_All_Suites_Adults_Only_Hotel-Ialyssos_Rhodes_Dodecanese_South_Aegean.html?m=66827#review944384766",
      "text": "I don't have to wait till the end of my trip to say this place is fantastic.The staff is very friendly  and accommodating, every department of this place is doing great and goes above and beyond to make you feel special.\nSpa treatment is also very highly recommended.",
      "title": "Amazing hotel ",
      "trip_type": "Friends getaway",
      "travel_date": "2024-03-31",
      "user": {
        "username": "V8214TNannas",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ea/b2/default-avatar-2020-69.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ea/b2/default-avatar-2020-69.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ea/b2/default-avatar-2020-69.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ea/b2/default-avatar-2020-69.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ea/b2/default-avatar-2020-69.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 944601313,
        "title": "Owner response",
        "text": "Dear Anna S,\nThank you for taking the time to share your valuable review on Tripadvisor. We are absolutely delighted to learn that you had a wonderful stay at The Ixian Grand & All Suites, and that you were pleased with the exceptional service provided by our dedicated team.\nWarm regards,\nThe Ixian Grand & All Suites team",
        "lang": "en",
        "author": "The Ixian Hotels",
        "published_date": "2024-03-31T02:45:17Z"
      }
    },
    {
      "id": 936798382,
      "lang": "en",
      "location_id": 292642,
      "published_date": "2024-02-04T05:16:22Z",
      "rating": 5,
      "helpful_votes": 2,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635614-d292642-r936798382-Reviews-The_Ixian_Grand_All_Suites_Adults_Only_Hotel-Ialyssos_Rhodes_Dodecanese_South_Aegean.html?m=66827#review936798382",
      "text": "Most amazing hotel i’ve ever been to. the bed are huge and extremely comfortable. the cleaners came every day if u wanted them too. food was amazing and all the staff were extremely friendly and helpful. Best holiday i have been on in a long time",
      "title": "Best Hotel ever",
      "trip_type": "Friends getaway",
      "travel_date": "2023-09-30",
      "user": {
        "username": "O9682DBkatiem",
        "user_location": {
          "id": "187049",
          "name": "Swindon, Wiltshire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e8/ea/default-avatar-2020-63.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e8/ea/default-avatar-2020-63.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e8/ea/default-avatar-2020-63.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e8/ea/default-avatar-2020-63.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e8/ea/default-avatar-2020-63.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 937161079,
        "title": "Owner response",
        "text": "Dear O9682DBkatiem,\nwe want to deeply thank you for your positive review! We are absolutely delighted to learn that you had a wonderful stay at The Ixian Grand & All Suites.\nThank you for choosing our hotel, and we eagerly await your return for another memorable experience.\nKind Regards\nThe Ixian Grand & All Suites team\n",
        "lang": "en",
        "author": "The Ixian Hotels",
        "published_date": "2024-02-07T04:12:29Z"
      }
    },
    {
      "id": 933931437,
      "lang": "en",
      "location_id": 292642,
      "published_date": "2024-01-13T15:30:01Z",
      "rating": 5,
      "helpful_votes": 3,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635614-d292642-r933931437-Reviews-The_Ixian_Grand_All_Suites_Adults_Only_Hotel-Ialyssos_Rhodes_Dodecanese_South_Aegean.html?m=66827#review933931437",
      "text": "My boyfriend and I had a 2 week holiday at Ixian Grand back in June 2023 & had an amazing time. The hotel was spectacular & the grounds were stunning. This hotel is located on a beach front so you get stunning views… especially at sunset. We stayed in a suite with a pool (the smallest pool out of the options) and our room was amazing. The room was spacious, modern and very clean. \n\nThe best bit about this hotel was the food. We we able to eat at the a-la-carte restaurants for every meal during our stay & what a difference that made! You are treated as if you have come to a fancy restaurant, greeted, walked to your table and you order off a menu (which changes daily if you eat at the alazonia restaurant). You get a 3 course meal (you can order less if you want but the food is so good that you won’t want to order less). The food was so tasty. I am a somewhat picky eater and I didn’t leave a single thing! I also worry about food being not very healthy when eating out but the food felt very clean. \n\nThe service is worth noting too, every single member of staff treats you like royalty. Myself and my partner are young (22 & 23) we work hard but have never stayed in a hotel like this before but the staff treated us as if we were the most important people there. As I said above all the staff were amazing but there were 2 that stood out to us… thank you Michalis Mavroudis & Nicholas Bountou for making us feel extra special.\n\nThe location of this hotel is perfect if you want to relaxing holiday. But if you like exploring places within walking distance, there is not much around. \n\nIf you are looking to book your holiday with this hotel it’s worth knowing that booking a suite is the only way that you can have the daily a la carte restaurant experience. The rooms cost a little more but it’s 100000% worth it. We ate at the normal restaurant (buffet style) once and never went back. The buffet restaurant is nice but it doesn’t even come close to the a la carte restaurants. If we hadn’t have booked a suite, we might not have rated the hotel so highly. Let’s face it, the food is one of the most important parts of a holiday! \n\nThe following comments are just for the hotel, to help them improve but none of the below impacted our experience at all.\n\nWardrobe space… we stayed for 2 weeks with no wardrobe in our room which was quite tricky but we managed. There is a small hanging space for about 10-15 items of clothing & a small folding space but the room we stayed in could use a bit more storage.\n\nThe pools… the pool in our room wasn’t as clean as we would have liked. They supposedly get cleaned everyday but we are sure that didn’t happen daily. The pools also make your white swimwear turn slightly green/yellow. We think this is due to them being freshwater pools. The colour comes straight out when you wash the swimwear but we found this slightly frustrating.\n\nOverall, we had an incredible time and will definitely be coming back one day!",
      "title": "Unforgettable Holiday!",
      "trip_type": "Couples",
      "travel_date": "2023-06-30",
      "user": {
        "username": "Hollybirch_",
        "user_location": {
          "id": "187055",
          "name": "Milton Keynes, Buckinghamshire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1b/e6/e2/de/caption.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1b/e6/e2/de/caption.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1b/e6/e2/de/caption.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/1b/e6/e2/de/caption.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 935575161,
        "title": "Owner response",
        "text": "Dear Hollybirch,\nWe are grateful for your positive review of The Ixian Grand & All Suites. It is wonderful to hear that our friendly staff and well-appointed rooms contributed to a pleasant stay. We appreciate your constructive feedback, and we will utilize it to refine our services. Thank you for choosing our hotel, and we eagerly await your return for another memorable experience.\nKindest regards, \nThe Ixian Grand & All Suites Team",
        "lang": "en",
        "author": "The Ixian Hotels",
        "published_date": "2024-01-26T02:58:36Z"
      }
    }
  ]
}