{
  "data": [
    {
      "id": 930887422,
      "lang": "en",
      "location_id": 3339621,
      "published_date": "2023-12-24T08:49:39Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1175546-d3339621-r930887422-Reviews-Boutique_5_Hotel_Spa-Kiotari_Rhodes_Dodecanese_South_Aegean.html?m=66827#review930887422",
      "text": "Lovely hotel suitable Just for adults, very quiet and spotlessly clean, breakfast was lovely, cooked eggs to order.  We had a couple of evening meals, one was a tasting menu which was lovely, the other was a 3 course, also good, the village is a short walk and there are a few restaurants.  Would return",
      "title": "Great holiday",
      "trip_type": "Couples",
      "travel_date": "2023-05-31",
      "user": {
        "username": "JayneLinda",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f1/b8/default-avatar-2020-22.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f1/b8/default-avatar-2020-22.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f1/b8/default-avatar-2020-22.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f1/b8/default-avatar-2020-22.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f1/b8/default-avatar-2020-22.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 932228231,
        "title": "Owner response",
        "text": "Dear Jayne,\n\nThank you for choosing the Boutique 5 Hotel & Spa for your holiday. We are very pleased to see your positive review regarding our clean and lovely hotel. We are also happy to see you loved our tasting menu and food. We hope to host you again soon!\n\nSincerely,\nH Hotels Collection ",
        "lang": "en",
        "author": "H HOTELS COLLECTION",
        "published_date": "2024-01-04T02:56:34Z"
      }
    },
    {
      "id": 925469712,
      "lang": "en",
      "location_id": 3339621,
      "published_date": "2023-11-11T06:02:04Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1175546-d3339621-r925469712-Reviews-Boutique_5_Hotel_Spa-Kiotari_Rhodes_Dodecanese_South_Aegean.html?m=66827#review925469712",
      "text": "What a fantastic hotel and wonderful holiday we had. Boutique 5 is in a quiet location but close enough to a few bars and restaurants. Housekeeping was superb. Adisa Jace kept our room immaculate and nothing was too much trouble for her. The barman, Stergos, made my husband the best Long Island Iced Teas ever! The loungers on the beach were luxurious and super comfy. The beach was pebbly but lovely. Would advise purchasing a pair of beach shoes!  We booked for bed and breakfast for our stay and would definitely recommend this option. Lots of choice available and Marissa was attentive and efficient. Had a couple of treatments each in the spa which were super relaxing. Our therapists, George and Katerina, were very proficient and skilful. Vangelis talked us through all the options available in the spa and was able to recommend the ones that best suited our needs. Would recommend Boutique 5. All the staff were very helpful and nothing was too much trouble. ",
      "title": "Fabulous holiday",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "Jeanray_35",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e7/99/default-avatar-2020-57.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e7/99/default-avatar-2020-57.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e7/99/default-avatar-2020-57.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e7/99/default-avatar-2020-57.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e7/99/default-avatar-2020-57.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 926081876,
        "title": "Owner response",
        "text": "Dear Jean,\n\nThank you for staying at Boutique 5 Hotel & Spa and for taking the time to leave us a perfect review. We are delighted to hear you had a fantastic holiday, that our staff were very helpful and you also enjoyed your time at our spa! We are sincerely looking forward to hosting you again soon one day.\n\nBest wishes,\nH Hotels Collection ",
        "lang": "en",
        "author": "H HOTELS COLLECTION",
        "published_date": "2023-11-16T04:00:57Z"
      }
    },
    {
      "id": 922140004,
      "lang": "en",
      "location_id": 3339621,
      "published_date": "2023-10-20T09:25:11Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1175546-d3339621-r922140004-Reviews-Boutique_5_Hotel_Spa-Kiotari_Rhodes_Dodecanese_South_Aegean.html?m=66827#review922140004",
      "text": "A great place to relax and unwind. The staff were friendly, efficient and courteous. The hotel was very clean and tidy with an excellent ambiance and the outlook from the main terrace and pool area was superb. The food was plentiful, with plenty of choices and of good quality. The frequent live band entertainment was a nice touch and very welcomed. \n\nThe SPA was also excellent and all of the staff were friendly, efficient and helpful. The variety of treatment options was extensive and very well explained by the staff. My treatment was with George, who was very professional, friendly and courteous. He delivered an excellent experience for me in my treatment, having asked several questions about what I wanted to achieve. It was exactly as I wanted it to be. I left the treatment feeling very relaxed and fell-stressed. I can wholeheartedly recommend George for a treatment. \n\nOverall, the Boutique 5 & SPA experience was what I had hoped it would be.",
      "title": "A great place to relax and unwind.",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "Q2509IJjamesm",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f4/d0/default-avatar-2020-33.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f4/d0/default-avatar-2020-33.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f4/d0/default-avatar-2020-33.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f4/d0/default-avatar-2020-33.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f4/d0/default-avatar-2020-33.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 922270373,
        "title": "Owner response",
        "text": "Dear James,\n\nThank you for your review of Boutique 5 Hotel & Spa. We are very pleased to hear about your positive experience at our hotel. Our dedicated staff take great pride in providing a high level of service and it is encouraging to know that their friendliness and efficiency left a positive impression on you.\n\nCleanliness and a pleasant ambience are of paramount importance to us, and we are pleased that you found our hotel to be clean and tidy with an excellent atmosphere. We are pleased that you enjoyed the picturesque view from our main terrace and pool area, as well as the rich and quality dining experience.\n\nThe entertainment programme with live band and our spa offerings are designed to provide a well-rounded experience and we are pleased to hear that you found them enjoyable. The fact that you recommended George for a spa treatment means a lot to us and we will pass on your kind words to him.\n\nIt is our goal to meet and exceed our guests' expectations and we are grateful that your experience at Boutique 5 Hotel & Spa met your expectations.\n\nWe look forward to welcoming you for another memorable visit in the future. Thank you for choosing Boutique 5 Hotel & Spa for your relaxation.\n\nBest Regards,\nH Hotels Collection",
        "lang": "en",
        "author": "H HOTELS COLLECTION",
        "published_date": "2023-10-21T07:42:57Z"
      }
    },
    {
      "id": 921829571,
      "lang": "en",
      "location_id": 3339621,
      "published_date": "2023-10-18T06:11:07Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1175546-d3339621-r921829571-Reviews-Boutique_5_Hotel_Spa-Kiotari_Rhodes_Dodecanese_South_Aegean.html?m=66827#review921829571",
      "text": "Stayed here recently on a half board basis. On the positive, wonderful staff, excellent service, beautiful hotel, with breathtaking views. On the negative we have to mention the food, while the breakfast was acceptable it was the evening meal that seriously disappointed. Bland, overcooked food, with limited choice, I don’t know how a 5 star luxury hotel could get it so wrong.  Only on one night was the meal acceptable. If you plan to stay here, our advice is go bed and breakfast.  There’s plenty of family run Tavernas in close proximity that provide good quality food at a fraction of the cost. ",
      "title": "A mixed bag.",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "marypmckee",
        "user_location": {
          "id": "186470",
          "name": "Belfast, Northern Ireland"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f2/11/default-avatar-2020-23.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f2/11/default-avatar-2020-23.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f2/11/default-avatar-2020-23.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f2/11/default-avatar-2020-23.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f2/11/default-avatar-2020-23.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 922270651,
        "title": "Owner response",
        "text": "Dear Mrs McKee,\n\nThank you for your detailed feedback and the time you spent at Boutique 5 Hotel & Spa. We are pleased to hear that you found our property beautiful and the service from our staff excellent, which truly reflects a 5-star experience.\n\nWe are sorry to learn that your dining experience did not meet your expectations, particularly at dinner. Your comments on the quality of the food have been noted and we understand the importance of providing a consistent 5-star culinary experience. We take your feedback very seriously and will discuss the matter with our kitchen team in order to make an improvement in this area.\n\nIt is worth noting that our half board menu can be adapted to suit individual preferences and our service manager has offered several alternative dinner options to suit your needs. It is regrettable that these choices did not suit your taste. We also understand that not every culinary experience can suit all tastes and that individual preferences may well vary, as your husband had no problems with the food during your stay.\n\nWe strive to provide the best possible experience for all our guests and your feedback will help us to improve our offering. Your feedback is invaluable to us as it helps us to maintain and improve the quality of our services. We hope to welcome you back in the future and provide you with an even more enjoyable dining experience that meets your expectations.\n\nThank you again for choosing Boutique 5 Hotel & Spa and for sharing your opinion with us. We look forward to serving you even better in the future.\n\nBest Regards,\nH Hotels Collection",
        "lang": "en",
        "author": "H HOTELS COLLECTION",
        "published_date": "2023-10-21T07:45:37Z"
      }
    },
    {
      "id": 921542859,
      "lang": "en",
      "location_id": 3339621,
      "published_date": "2023-10-16T07:39:50Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1175546-d3339621-r921542859-Reviews-Boutique_5_Hotel_Spa-Kiotari_Rhodes_Dodecanese_South_Aegean.html?m=66827#review921542859",
      "text": "This is our first luxury holiday and in almost every way Boutique 5 met every expectation anyone could have.\n\nThe staff are amazing, friendly personal and do everything they can to go the extra mile.\n\nFood was great too - good quality and well presented\n\nSolid fast WiFi for those who need it\nNo issues with recent fires - although looking at adjacent burnt out areas you realise what a great job they’ve done to get lucious green grass and plants back around the hotel \n\nBut they were let down by just two things:\n\nBeware point 1:\nBottom floor Superior Junior Suite with Private Pool rooms are advertised as having a “sea view” - this is in contrast to the Junior Suites (which are also on the bottom floor) but advertised with a *partial* sea view.\n\nIn truth all the bottom floor rooms have a partial see view - the hotel’s photography is cleverly taken to suggest a good view of the sea but at most it’s about 15% sea and 85% buildings, trees and (if you’re unlucky) power and telegraph poles.\nThis is not the first review to point this out and it’s something they need to address by simply adding the word “partial” into those lower floor superior rooms so that guests can make the decision to upgrade before they arrive rather than be disappointed either in silence or bring it up with the staff\n\nHaving chosen to address this with the staff, first time they wanted to offer a pricey upgrade - but after persisting through our travel agent, they offered a more reasonably priced upgrade to an upper floor room which has much better views of the sea and does live up to expectations of a sea view.\nMaybe it’s a Greek thing but I prefer not to haggle over resolving an issue that like that.  Lesson learned though, if we come back we’ll be avoiding the lower floor and haggling over prices.\n\nBeware Point 2:\nOur return flight was late so we asked for options for a late checkout (we asked for up to 5 hours). They offered just a 15% discount off the full room rate -  which was excessive since the it’s the end of the season and the room was available.  This again seems to be hotel policy but I didn’t want to haggle this time and decide I would rather spend €150 elsewhere.\n\nTurning to the positives:\nThis does live up to expectations in every other way.  Special shoutout to Serving and Room Cleaning and Spa staff - always happy people, lovely smiles and friendliness.  And always trying (and achieving) a spectacular service that helps ensure this place does deserve the “luxury” name tag.\n\nThe Spa isn’t listed separately on Trip Advisor, but if it was, I’d give it a solid 100% - not a fault.  Vangelis was incredibly helpful and friendly and made our last few hours of stay a continued luxury.  A word of warning - be sure to take the staff’s advice and pre-book your spa treatment to avoid disappointment.\n\nOverall, as our first luxury holiday I don’t have any other luxuries to compare it against, but it has set a high (98%) standard for our next one!",
      "title": "98% positive but be aware of the 2%!",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "W9181XUnickw",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/eb/a3/default-avatar-2020-38.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/eb/a3/default-avatar-2020-38.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/eb/a3/default-avatar-2020-38.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/eb/a3/default-avatar-2020-38.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/eb/a3/default-avatar-2020-38.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 922271823,
        "title": "Owner response",
        "text": "Dear Nick,\n\nWe are delighted to receive your review and to hear that your stay at Boutique 5 Hotel & Spa was a memorable and enjoyable first luxury holiday in many ways. We greatly appreciate your kind words and the time you took to share your thoughts about your stay.\n\nWe are delighted that our staff provided you with exceptional service and maintained the high standards to which we aspire. Your appreciation for their efforts and friendly demeanour is greatly appreciated. We strive to do all we can to make our guests feel welcome and well looked after.\n\nRegarding the concerns you raised, we would like to thank you for bringing them to our attention. We sincerely apologise for the confusion regarding the room categories and their respective sea views. Your feedback is invaluable and we will definitely revise our room descriptions to provide clarity and accurate information for future guests to make informed decisions.\n\nWe also understand your disappointment with the late check-out options and rates offered. Our prices are based on a number of factors and we strive to provide our guests with an exceptional experience. We take your comments to heart and will revise our policies to better meet the needs of our guests, especially at the end of the season when availability allows for flexibility. It is encouraging to hear your positive comments about our spa services and dedicated staff, especially your praise for Vangelis.\n\nWe strive to create exceptional experiences for all our guests and your feedback will serve as motivation for us to maintain our high standards. We hope to continue to exceed your expectations of a luxury holiday and set a high standard for your trip. We are grateful for your feedback and will use it as an opportunity to improve.\n\nThank you again for choosing Boutique 5 Hotel & Spa for your luxury holiday and we hope to welcome you back in the future.\n\nBest Regards,\nH Hotels Collection",
        "lang": "en",
        "author": "H HOTELS COLLECTION",
        "published_date": "2023-10-21T07:55:21Z"
      }
    }
  ]
}