{
  "data": [
    {
      "id": 945806829,
      "lang": "en",
      "location_id": 507837,
      "published_date": "2024-04-08T05:36:22Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g303855-d507837-r945806829-Reviews-Pickalbatros_Royal_Moderna-Nabq_Bay_Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review945806829",
      "text": "Amazing hotel and holidays! The staff is wonderful and going beyond and above for the guests to feel great. Osama Ahmed from the beach bar is making sure you are always served before you ask. The beach, pools, aquapark, snorkeling side worth a lot! Myself and my family will definitely come back. Did I mention the tasty food?!",
      "title": "Great holidays great service great food!",
      "trip_type": "Family",
      "travel_date": "2024-04-30",
      "user": {
        "username": "viorical413",
        "user_location": {
          "id": "295424",
          "name": "Dubai, Emirate of Dubai"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/0f/c2/32/36/viorica2016.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/0f/c2/32/36/viorica2016.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/0f/c2/32/36/viorica2016.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/0f/c2/32/36/viorica2016.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 945843015,
        "title": "Owner response",
        "text": "Dear Ms. Viorica,\n\nGreetings from sunny Royal Albatros Moderna – Sharm El Sheikh!\nWe highly value your input on TripAdvisor and warm feedback on your stay at Royal Albatros Moderna. We are being cordially thankful for your beautiful comments concerning our facilities. \n\nWe are always striving to fully satisfy and impress our valuable guests from the very first till the last day. Their vacation impressions are always on top of the importance scale for us.\n\nWe look forward to consistently welcome you in our Royal Albatros Moderna.\n\nBest regards,\nRoyal Albatros Moderna team.",
        "lang": "en",
        "author": "Royal Albatros Moderna GrM",
        "published_date": "2024-04-08T10:43:24Z"
      }
    },
    {
      "id": 945618789,
      "lang": "en",
      "location_id": 507837,
      "published_date": "2024-04-06T17:06:08Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g303855-d507837-r945618789-Reviews-Pickalbatros_Royal_Moderna-Nabq_Bay_Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review945618789",
      "text": "Went back again in March for four weeks this time, can't remember how many times now, this time on my own due to family illness. On arrival in reception I was warmly greeted by Mr Sayed the reception manager and by the time we stopped chatting I had been checked in and given a room in the exact area I had requested. All the rooms I have had have always been spacious with good air con, tea and coffee making facilities that have powdered creamer, not real milk, but you can get fresh milk from the bar and keep it in the room fridge, the rooms do have a T.V. though not many channels in English, but you can get B.B.C. world news. The bathrooms are spacious with large walk in showers, though the lighting could be better, and they never have a working plug in the sink so we always take a travel plug, my room this time was kept cleaned and serviced daily by Osama Rahman who always smiled and said good morning. I did have two issues with the room, but both were sorted by the maintenance team in quick order after reporting them to the reception staff. This is a very large hotel with extensive grounds, there are 7 swimming pools 5 of which are heated including the aqua park, the two unheated pools are just about manageable by the end of March but very refreshing. All the grounds are continuously being cleaned and kept very clean, as are all the garden areas. There are plenty of sunbeds round the pools and the big double beds round the main pool are very good, but they do get busy and there is space for some more which would be an improvement, there are not enough moveable umbrellas round the main pool and some of the ones there need their wheels repairing as they are square. Big thanks to Mr Mohamed Basiony (pool area manager) who checked daily if all was O.K. While round the pool you will be approached by touts trying to sell spa treatments and excursions, after chatting to them in a friendly manner and making it clear I am not going to purchase any they never hassle me again apart from a greeting. All the lifeguards round the pools are very helpful, fetching complimentary towels, moving sunbeds and putting umbrellas up when required. Ice cream is served from the active pool bar in the afternoon and the chocolate is very good. The beach area is also very nice with plenty of sunbeds and shade also windbreaks which can be needed as the wind can be quite strong and cool in spring. The sea is very shallow for a long way out and even lower when the tide is out, if you want to snorkel you need to go down the 600 MTR jetty to where the water is deeper or to the end which is very near the drop-off of the reef, the snorkelling is very good at the end, but the sea can be quite rough due to the breeze. There is also a mini golf course and swings for children as well as tennis courts, and they were just building some paddle board courts when I was there. There are bars next to all the pools and near the beach, so drinks are never far away, I was looked after at the main pool bar by the great team of Mahmoud Saad, Ahmed Mohamed (Mr miserable) Ashraf Yasser Etc. and was never short of a drink, and they remember what you usually have. Many people drink the cocktails and criticise them as just cheap spirits and coloured syrup, I tend to stick to the beer and the Arabesque white wine they are serving now is very drinkable. A tip goes a long way but talking to the staff like humans and having some interaction with them goes a long way too, also not trying to drink your moneys worth of beer as many of the Eastern European guests seem to want to do. A please and thank-you can work wonders. Had great service at the other pool bars by Osama at the quiet pool, Waleed at the active pool, Elkenawy and Mageed at the beach bar. In the reception area there is a great coffee bar with many options, brilliantly staffed by Mohamed Sharawy and Mina. Also, the lobby bar staffed by the great team of Arafa, Ahmed Handy and Mohamed Mabrouk who was very shy and quiet at the start of my holiday but soon became more outgoing with a little encouragement. The bar manager Sabry stopped by every day for a chat and to make sure all was good. The reception staff are very helpful but could do with trying to smile a bit more, but you can see they are always busy and under some pressure. They have changed the ATM in reception and this one is not free it charges a transaction fee, so I go to one outside the hotel down the road that is free. I used the free gym daily and after an initial issue of not providing adequate sweat towels at the start was sorted by the hotel general manager Mr Tariq it was very good, although I missed the arc trainer that I was told was under repair and should be back in a month or so. There are 6 main themed buffet restaurants to choose from in the evening, 4 of which are open for breakfast and lunch, plus the Club MC serving lunch down near the beach and pool area. There is a great choice, and you can always find something to eat, but it was noticeable that the quality of the food had been lowered this time with no golden sultanas at breakfast and the availability of smoked cheese and smoked chicken being reduced, at lunchtime there is overuse of pumpkin, zucchini, carrots and potatoes and less cauliflower and broccoli, also more clear and less cream soups and lower quality meat. At dinner, the rotisserie chickens have disappeared from outside the Italian restaurant. Having said that, breakfast were very good with delicious fresh breads great eggs cooked to order by top egg man Elsayed, fruit, yogurts, and pastries. I tended to eat lunch in the Tagine restaurant as it tended to be less of a scrum and a lot brighter, had great service from Essmat Ismael and his team, Mahmoud Samy, A Rahman Hussain, Amr Ibrahim and Mohamed Adel, who brought my wine without being asked and saved my table when I went back to the buffet which can be a problem as a solo traveller as the staff are always being encouraged to clear empty tables. At dinner, I tended to eat in the fish restaurant, again less busy and the fish is always lush. As I tended to eat quite late after the rush sometimes the chips or fish was not that fresh but simply asking the chef to do me some fresh fish or reheat some chips it was no problem. Chefs Ahmed Mohamed,Hany and Eslam always happy to chat and help, At club MC the menu is the same every day, chip, pizza, pasta, sandwiches and salad, previously it rotated more with fish, fried cauliflower, calamari and frito misto and there is never any butter there for the sandwiches. I did eat in the White Elephant À la carte restaurant twice and had great meals both times, and had great table service, the fish soup for starter is excellent, and the mains cooked to order are very good, fresh and hot, but the deserts are just the same as most Egyptian desert bright-coloured look good but tasteless, the only deserts worth eating are in the Tagine restaurant though there is always fresh fruit and a real scrum when fresh strawberries are on. After all my criticisms and notes of lowering of quality, this is a great hotel with great friendly helpful staff in a country with brilliant weather in spring and autumn and would highly recommend to anyone as great value for money and will certainly be going back again, already booked for October.",
      "title": "Long solo stay.",
      "trip_type": "Solo travel",
      "travel_date": "2024-03-31",
      "user": {
        "username": "scubacol11",
        "user_location": {
          "id": "190734",
          "name": "Rotherham, South Yorkshire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/03/d1/17/a8/scubacol11.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/03/d1/17/a8/scubacol11.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/03/d1/17/a8/scubacol11.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/03/d1/17/a8/scubacol11.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/03/d1/17/a8/scubacol11.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 945706067,
        "title": "Owner response",
        "text": "Dear Valued Guests,\n\nGreetings from sunny Royal Albatros Moderna – Sharm El Sheikh!\nWe highly value your input on TripAdvisor and warm feedback on your stay at Royal Albatros Moderna. We are being cordially thankful for your beautiful comments concerning our facilities. \n\nWe are always striving to fully satisfy and impress our valuable guests from the very first till the last day. Their vacation impressions are always on top of the importance scale for us.\n\nWe look forward to consistently welcome you in our Royal Albatros Moderna.\n\nBest regards,\nRoyal Albatros Moderna team.",
        "lang": "en",
        "author": "Royal Albatros Moderna GrM",
        "published_date": "2024-04-07T10:46:24Z"
      }
    },
    {
      "id": 944554026,
      "lang": "en",
      "location_id": 507837,
      "published_date": "2024-03-30T15:56:32Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g303855-d507837-r944554026-Reviews-Pickalbatros_Royal_Moderna-Nabq_Bay_Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review944554026",
      "text": "Just returned from a fantastic holiday overal from this hotel. Our children 6 & 4\n\nCheck in - went smooth, just needed to send them copies of my flights (not sure if this is normal, I have booked flights and holiday seperately)\n\nRoom - fantastic room. Ground floor, sliding door, huge shower. Located right next to the pool with sunbeds, warm kids pool behind our room, bar and restaurants very near, just perfect. Cleaning servis top notch!\n\nPools - just perfect! For us it was just amazing! 2 big heated pools with slides for smaller children + 1  smaller heated pool just behind our room, that just suited us perfectly. The bigger pools with sunbeds was not heated but the water was rally refreshing. \n\nFood - great. Everybody can choose\n\nDrinks - bad. Either it's just loads of sugar, loads of alcohol, sometimes lack of alcohol, it was just bad. Beer was awesome when it was cold, really nice so I decided to stick with that, sometimes tried luck with drinks. Wine was OK. \n\nArea - amazing. Just amazing. We picked this hotel mostly because of this. 1 big and 2 smaller children playgrounds, kids club, minigolf, volleyball, table tennis, grass was so soft then even national football team of Egypt dont have that probably 😀 everything was so nice and clean, people work really hard there and the place just looks amazing. \n\nEntertainment - weaker. It was just not that entertaining, few minutes kids disco in the evening, probably just 1 decent show for adults, international dance. Other wise not really good, but we had every night dinner next to the stage, so lights ware flashing, music was playing, so it was OK for us 🙂\n\nStaff - let's say it like this. When you have $, you are their best friend, brother, habibi. When you don't tip, some of them started to be even arrogant, irritated\n\nOur second time in Egypt, first time was last november 2023 in their sister resort in Hurghada Pickalbatros Jungle Aqua Park Neverland. So I can compare what was better. Better and compact hotel then Neverland, that place is just ridiculously huge with coød water in many of them. \n\nWe had a lovely stay and hopefully we will come back soon. Overall rating 4/5",
      "title": "Great resort",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "slavom_rm211",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e3/1f/default-avatar-2020-46.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e3/1f/default-avatar-2020-46.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e3/1f/default-avatar-2020-46.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e3/1f/default-avatar-2020-46.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e3/1f/default-avatar-2020-46.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 944618041,
        "title": "Owner response",
        "text": "Dear Mr. Slavomir,\n\nGreetings from sunny Royal Albatros Moderna – Sharm El Sheikh!\nWe highly value your input on TripAdvisor and warm feedback on your stay at Royal Albatros Moderna. We are being cordially thankful for your beautiful comments concerning our facilities. \n\nIt is very important for us to receive objective feedback from our guests in order to improve the service. We are open to hear not only the positive aspects of the guests' holiday, but also the negative aspects that will allow us to make constructive decisions to correct them.\n\nWe hope that in the future we will again have the honor to see you among our guests and surprise you with the changes that have taken place.\n\nBest regards,\nRoyal Albatros Moderna team.",
        "lang": "en",
        "author": "Royal Albatros Moderna GrM",
        "published_date": "2024-03-31T05:49:59Z"
      }
    },
    {
      "id": 944474775,
      "lang": "en",
      "location_id": 507837,
      "published_date": "2024-03-30T04:01:39Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g303855-d507837-r944474775-Reviews-Pickalbatros_Royal_Moderna-Nabq_Bay_Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review944474775",
      "text": "Overall, we were satisfied with the hotel. The family room is two-part and large. With a modern finish. Aqva park is located nearby, which would be great if you are interested in using it. Other swimming pools and the beach are within walking distance (10 minutes). Fortunately, restaurants and the main gate were nearby. Large territory and different types of pools for both adults and children. I really liked that the children's pools were heated. There were three play areas for children. In addition, you could play mini golf, table tennis, volleyball, etc. The downside is overcrowding and a lack of sunbeds by the pool. It also seemed that some customers covered the chairs with towels and kept their things there without using them. \nThe food selection was sufficient and varied for us. The staff in the restaurant were helpful and quick. Ice cream could be offered throughout the opening hours and not at certain hours. The staff was generally nice. Sometimes it seemed that the employee was tired or bored. A bit arrogant even.",
      "title": "Good family vacation",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "aivid2015",
        "user_location": {
          "id": "274957",
          "name": "Rakvere, Laane-Viru County"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/27/fb/1d/f5/caption.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/27/fb/1d/f5/caption.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/27/fb/1d/f5/caption.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/27/fb/1d/f5/caption.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-m/1280/27/fb/1d/f5/caption.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 944494047,
        "title": "Owner response",
        "text": "Dear M. Aivi,\n\nGreetings from sunny Royal Albatros Moderna – Sharm El Sheikh!\nWe highly value your input on TripAdvisor and warm feedback on your stay at Royal Albatros Moderna. We are being cordially thankful for your beautiful comments concerning our facilities. \n\nIt is very important for us to receive objective feedback from our guests in order to improve the service. We are open to hear not only the positive aspects of the guests' holiday, but also the negative aspects that will allow us to make constructive decisions to correct them.\n\nWe hope that in the future we will again have the honor to see you among our guests and surprise you with the changes that have taken place.\n\nBest regards,\nRoyal Albatros Moderna team.",
        "lang": "en",
        "author": "Royal Albatros Moderna GrM",
        "published_date": "2024-03-30T07:44:56Z"
      }
    },
    {
      "id": 943982772,
      "lang": "en",
      "location_id": 507837,
      "published_date": "2024-03-27T05:27:54Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g303855-d507837-r943982772-Reviews-Pickalbatros_Royal_Moderna-Nabq_Bay_Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review943982772",
      "text": "Just arrived back home after a week at this amazing resort.\nStaff are all so friendly and can not do enough to help you,\nThe rooms are spotless and massive.\nGood selection of evening entertainment and the entertainment team are all very welcoming and always pop by and say hello when you are at the pool.\nGutted to be home and will definitely be looking at coming back soon",
      "title": "Amazing resort",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "rebeccasO1092PO",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f0/9f/default-avatar-2020-16.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 944221438,
        "title": "Owner response",
        "text": "Dear Ms. Rebecca,\n\nGreetings from sunny Royal Albatros Moderna – Sharm El Sheikh!\nWe highly value your input on TripAdvisor and warm feedback on your stay at Royal Albatros Moderna. We are being cordially thankful for your beautiful comments concerning our facilities. \n\nWe are always striving to fully satisfy and impress our valuable guests from the very first till the last day. Their vacation impressions are always on top of the importance scale for us.\n\nWe look forward to consistently welcome you in our Royal Albatros Moderna.\n\nBest regards,\nRoyal Albatros Moderna team.",
        "lang": "en",
        "author": "Royal Albatros Moderna GrM",
        "published_date": "2024-03-28T04:10:15Z"
      }
    }
  ]
}