{
  "data": [
    {
      "id": 932279009,
      "lang": "en",
      "location_id": 5565218,
      "published_date": "2024-01-04T11:25:43Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635613-d5565218-r932279009-Reviews-Bellevue_On_The_Beach_Suites-Rhodes_Town_Rhodes_Dodecanese_South_Aegean.html?m=66827#review932279009",
      "text": "Staying at Esperia Bellevue Suites was an extraordinary experience. This small boutique hotel with only 13 suites is located directly at the beach. Our suite was spacious, modern, clean, equipped with everything you need and more (fridge, coffee maker, even a washing machine) and had a stunning view. We only used the small rooftop pool once - the weather allowed for bathing in the sea, which was even more attractive! \nBut what really made our stay special was the team. The hotel manager Katerina made sure all our needs were met and inquired in person several times whether everything was alright or anything could be done better. Theodorus greeted us in the morning and made sure the breakfast made our day (it's your choice whether you want to have breakfast served in your room or downstairs in the breakfast room - no buffet, you have the full choice from a menu and the team will try to meet all your wishes). Nikos welcomed us in the afternoons and made sure we got a reserved table in fabulous restaurants each night and always had good suggestions on where to go and what to see next. Room service was fabulous as well. Big thanks to the whole team!\nOne thing you shouldn't expect: getting to know other guests. The whole atmosphere is meant for privacy, it's quiet. Although we were here in January we don't think this will be very different in the more busy times of the year ",
      "title": "Quiet small place with fabulous service ",
      "trip_type": "Couples",
      "travel_date": "2024-01-31",
      "user": {
        "username": "katjar944",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/de/0a/default-avatar-2020-35.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/de/0a/default-avatar-2020-35.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/de/0a/default-avatar-2020-35.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/de/0a/default-avatar-2020-35.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/de/0a/default-avatar-2020-35.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 935017623,
        "title": "Owner response",
        "text": "Dear Katja R,\n\nThank you for sharing your delightful experience at Bellevue On The Beach Suites! We are thrilled to learn that your stay with us was an extraordinary experience.\n\nIt warms our hearts to hear that you enjoyed the spacious, modern, and well-equipped suite with a stunning view. It sounds like the small rooftop pool and the proximity to the beach added to the charm of your stay, especially with the favorable weather for sea bathing.\n\nYour kind words about our team are truly appreciated. We're delighted that Katerina, Theodorus, and Nikos contributed to making your stay special. We'll make sure to share your praises with them. It's wonderful to know that the personalized attention, from inquiring about your needs to providing dining recommendations and excellent room service, made a positive impact on your overall experience.\n\nWe understand and appreciate your mention of the hotel's atmosphere designed for privacy and tranquility. It's great to hear that this aspect resonated with your expectations.\n\nThank you for choosing Bellevue On The Beach Suites, and we look forward to welcoming you back for another exceptional stay in the future.\n\nBest Regards,\nChris Zamagia\nPublic Relations & Communications Director\nEsperia Group\n",
        "lang": "en",
        "author": "Chrisoula Zamagia",
        "published_date": "2024-01-22T11:36:30Z"
      }
    },
    {
      "id": 924496475,
      "lang": "en",
      "location_id": 5565218,
      "published_date": "2023-11-04T05:00:43Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635613-d5565218-r924496475-Reviews-Bellevue_On_The_Beach_Suites-Rhodes_Town_Rhodes_Dodecanese_South_Aegean.html?m=66827#review924496475",
      "text": "Amazing boutique hotel - with an incredible view of the sunset, overlooking the ocean!\nCouldn’t ask for more - the team are brilliant. We received a gorgeous welcome from the owner / lead and her team. \nThe rooms are amazing - Sumptuous bedding, every amenity you could think of within a very chic environment. Our room had three separate balcony points alone. \nThe food is incredible and can be enjoyed overlooking the ocean too. \nA totally fabulous experience we enjoyed here. Thank you so much, Bellevue team 🥰 We will definitely be returning next year!",
      "title": "Truly gorgeous and very chic boutique hotel, overlooking the ocean and enjoying the perfect sunsets 🌅",
      "trip_type": "Family",
      "travel_date": "2023-11-30",
      "user": {
        "username": "333melanyp",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f1/42/default-avatar-2020-20.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 925137032,
        "title": "Owner response",
        "text": "Dear Melany,\nThank you for your truly wonderful review! We're absolutely delighted to hear that you had a fantastic experience at our hotel. It's great to know that you enjoyed the stunning view of the ocean and those perfect sunsets. Our team is dedicated to providing exceptional service, and we 're thrilled that you received a warm welcome from the owner and her team.\nThe praise for our rooms, sumptuous bedding, and amenities is much appreciated, and it's wonderful to hear that you enjoyed the incredible food with a view of the ocean. We look forward to welcoming you back next year for another fabulous experience. Thank you so much for your kind words, and see you soon!\nWarm Regards,\nStathis Barbagiannis\nGuest Services Department\nEsperia Group\n",
        "lang": "en",
        "author": "Chrisoula Zamagia",
        "published_date": "2023-11-09T03:29:20Z"
      }
    },
    {
      "id": 924018163,
      "lang": "en",
      "location_id": 5565218,
      "published_date": "2023-11-01T19:30:21Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635613-d5565218-r924018163-Reviews-Bellevue_On_The_Beach_Suites-Rhodes_Town_Rhodes_Dodecanese_South_Aegean.html?m=66827#review924018163",
      "text": "What an amazing boutique hotel!!!  We were greeted with a cocktail while Nico gave us an overview of the hotel and the services available. For example, we had the choice of having breakfast delivered directly to our suite, or we could have eaten in the dining area. We opted for a breakfast in our room every morning, which was delivered by Dimitris, with a smile.\nWe also had our own kitchen facilities, if we desired to use them. The room service was twice a day. The suite was large, spacious, clean, and decorated in a contemporary manner. The bed was very comfortable, and we really appreciated having two bathrooms in the suite. The view of the Aegean Sea was heavenly!Staff were very accommodating to ALL of our needs. ",
      "title": "Top Notch Boutique Hotel in Rhodes, Greece",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "monikasZ7016JQ",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f2/eb/default-avatar-2020-27.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f2/eb/default-avatar-2020-27.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f2/eb/default-avatar-2020-27.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f2/eb/default-avatar-2020-27.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f2/eb/default-avatar-2020-27.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 924499894,
        "title": "Owner response",
        "text": "Dear monikasZ7016JQ,\nThank you so much for your glowing review of our boutique hotel in Rhodes, Greece! We're delighted to hear about your amazing experience and the exceptional service you received during your stay.\n\nIt warms our hearts to know that your arrival was marked by a warm welcome and a refreshing cocktail. Nico's informative overview of the hotel and its services is a testament to our commitment to providing personalized and top-notch service to our guests.\n\nWe're thrilled to learn that you enjoyed the flexibility of having breakfast delivered to your suite, and it's wonderful to hear that Dimitris delivered your breakfast with a smile. Our team takes great pride in ensuring that your needs and preferences are met with a friendly and accommodating attitude.\n\nHaving kitchen facilities in your suite is indeed a convenient feature for those who prefer to prepare their own meals, and we're delighted that you appreciated the contemporary design, cleanliness, and spaciousness of your suite.\n\nWe understand the importance of a comfortable night's sleep, and we're glad to hear that the bed met your expectations. Two bathrooms in the suite certainly add to the convenience of your stay.\n\nThe view of the Aegean Sea is truly breathtaking, and we're pleased that you found it heavenly. Your kind words about our staff's accommodation of your needs are much appreciated.\n\nThank you for choosing our hotel, and we hope to welcome you back in the future.\n\nBest Regards,\nChris Zamagia\nPublic Relations & Communications Director\nEsperia Group\n",
        "lang": "en",
        "author": "Chrisoula Zamagia",
        "published_date": "2023-11-04T05:40:09Z"
      }
    },
    {
      "id": 923124571,
      "lang": "en",
      "location_id": 5565218,
      "published_date": "2023-10-26T22:16:19Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635613-d5565218-r923124571-Reviews-Bellevue_On_The_Beach_Suites-Rhodes_Town_Rhodes_Dodecanese_South_Aegean.html?m=66827#review923124571",
      "text": "We had a great stay here.  Staff very friendly and efficient. Rooms spacious, clean and comfortable. Just a cross of road from beach. A nice heated roof-top pool that you can reserve for private use for a couple of hours with good views. Breakfast good, ordered and brought fresh not buffet style.",
      "title": "Classy relaxed hotel in Rhodes Town",
      "trip_type": "Family",
      "travel_date": "2023-10-31",
      "user": {
        "username": "stuartmO7221SH",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e7/99/default-avatar-2020-57.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e7/99/default-avatar-2020-57.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e7/99/default-avatar-2020-57.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e7/99/default-avatar-2020-57.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e7/99/default-avatar-2020-57.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 923283210,
        "title": "Owner response",
        "text": "Dear Stuart,\n\nThank you for sharing your feedback about your recent stay at our hotel. We're thrilled to hear that you had a great experience with us in Rhodes Town.\n\nIt's wonderful to know that you found our staff to be friendly and efficient. Our team takes great pride in providing top-notch service, and your kind words are a testament to their dedication.\n\nWe're delighted that you enjoyed the spacious, clean, and comfortable rooms, and that the hotel's proximity to the beach was convenient for you. The heated roof-top pool with good views sounds like a perfect way to relax and enjoy your stay.\n\nWe take pride in offering a fresh, ordered breakfast experience to our guests, and it's great to hear that you appreciated this approach.\n\nYour positive feedback is greatly appreciated, and we hope to have the pleasure of hosting you again in the future\n\nBest Regards,\nChris Zamagia\nPublic Relations & Communications Director\nEsperia Group\n",
        "lang": "en",
        "author": "Chrisoula Zamagia",
        "published_date": "2023-10-28T03:52:47Z"
      }
    },
    {
      "id": 918248289,
      "lang": "en",
      "location_id": 5565218,
      "published_date": "2023-09-24T19:56:53Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635613-d5565218-r918248289-Reviews-Bellevue_On_The_Beach_Suites-Rhodes_Town_Rhodes_Dodecanese_South_Aegean.html?m=66827#review918248289",
      "text": "My husband and I visited Rhodes for a wedding and could not recommend Bellevue more. Starting with a friendly email from the manager Katerina the hotel staff did everything they could to make our stay as comfortable and enjoyable as it could be. The room was clean, lovely, cozy, and well equipped with a beautiful view of the beach. We particularly enjoyed the tasty breakfast which came with an expansive menu and the option to eat on the hotel’s terrace or have breakfast brought to our room (both included). The bread basket was the best bread I had in Greece — so tasty! The staff was also super welcoming and helpful with recommendations of things to do, including encouraging us to go to the water park when we asked about it, which we thoroughly enjoyed. ",
      "title": "Bellevue is the best :)",
      "trip_type": "Couples",
      "travel_date": "2023-09-30",
      "user": {
        "username": "suzannet600",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e3/6a/default-avatar-2020-47.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e3/6a/default-avatar-2020-47.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e3/6a/default-avatar-2020-47.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e3/6a/default-avatar-2020-47.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e3/6a/default-avatar-2020-47.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 918462536,
        "title": "Owner response",
        "text": "Dear suzannet600,\n\nThank you for your heartwarming review and for choosing Bellevue for your stay during the wedding in Rhodes. We are thrilled to hear about your positive experience with us.\n\nKaterina and our entire team work diligently to ensure our guests have a comfortable and enjoyable stay, and it's wonderful to know that you felt well taken care of from the moment of your first contact. We truly appreciate your kind words about our cleanliness, cozy rooms, and the beautiful beach view.\n\nWe're delighted that you enjoyed our tasty breakfast options, including the fresh bread which you found to be the best in Greece. We take pride in offering a variety of delicious choices to start your day right.\n\nOur staff members are dedicated to providing excellent service and helpful recommendations, and we're glad you had a great time at the water park based on their suggestion.\n\nWe hope to have the pleasure of welcoming you back to Bellevue in the future. \n\nThank you once again for your kind words and recommendation. We look forward to serving you again!\n\nBest Regards,\nChris Zamagia\nPublic Relations & Communications Director\nEsperia Group\n",
        "lang": "en",
        "author": "Chrisoula Zamagia",
        "published_date": "2023-09-26T02:53:07Z"
      }
    }
  ]
}