{
  "data": [
    {
      "id": 942904202,
      "lang": "en",
      "location_id": 563901,
      "published_date": "2024-03-19T11:05:44Z",
      "rating": 4,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d563901-r942904202-Reviews-Turquoise_Beach_Hotel-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review942904202",
      "text": "Really nice experience. The hotel is colourful and clean, the staff friendly and the pool area fab. The beach is just opposite (although it’s very much an Egyptian beach - think more gravel-soil type sand and the sea filled with water sport equipment than a typical Mediterranean sandy paradise…). \n\nMy room was very comfortable, yes the furniture is a little dated and the air conditioning unit old and loud, but it was generally lovely. The bathroom was large and well-equipped, although the bath is a little narrow, and on arrival I was given a welcome fruit platter, as well as a large bottle of water daily, a very nice touch!\n\nBreakfast is good, a mix of pastries and breads as well as warm Egyptian food (foul, falafel etc) and a small omelette station. The quality varied daily however - some days the hot food was fresh and delicious, others it had clearly just been reheated from the day before so very dry and not great. I had dinner at the hotel on one occasion and it wasn’t great quality - but absolutely fine if all inclusive is your thing and/or you’re travelling with kids. \n\nThe hotel has a small newsagent/off license on site as well as a dive shop, and the “old market” is a 5-10 minute walk away with plenty of shops and restaurants. There are mosquitoes galore after the sun sets, so being plenty of repellent!\n\nVery much recommended, I would definitely return!",
      "title": "Very nice",
      "trip_type": "Solo travel",
      "travel_date": "2024-03-31",
      "user": {
        "username": "greekdan",
        "user_location": {
          "id": "186338",
          "name": "London, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/10/64/4f/4c/greekdan.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/10/64/4f/4c/greekdan.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/10/64/4f/4c/greekdan.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/10/64/4f/4c/greekdan.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/10/64/4f/4c/greekdan.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 943652875,
        "title": "Owner response",
        "text": "Dear partner. We greatly appreciate you taking the time to review your experience during your recent stay at our hotel. Thank you for coming back and sharing your detailed experience, we would love to know your feedback to improve our services and hope to be glad to have you back soon. We look forward to welcoming you again soon at our hotel ensuring the best service and attention at all times. With kind regards ِAli Askr F.O",
        "lang": "en",
        "author": "Turquoise Beach Hotel SSH",
        "published_date": "2024-03-24T14:06:35Z"
      }
    },
    {
      "id": 942610564,
      "lang": "en",
      "location_id": 563901,
      "published_date": "2024-03-17T06:12:23Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d563901-r942610564-Reviews-Turquoise_Beach_Hotel-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review942610564",
      "text": "I went first time to Turquoise Hotel! I really like that sea is in the front of hotel! Quite good food, nice staff, the are really trying to make you feel comfortable. Around 6-7 min from Old market, everything is within walking distance, also a bank where you can exchange money. Also cleaning every day 👍🏻",
      "title": "Excellent value for money and quality",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "389mariiap",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f4/d0/default-avatar-2020-33.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f4/d0/default-avatar-2020-33.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f4/d0/default-avatar-2020-33.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f4/d0/default-avatar-2020-33.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f4/d0/default-avatar-2020-33.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 943653037,
        "title": "Owner response",
        "text": "Dear partner. We greatly appreciate you taking the time to review your experience during your recent stay at our hotel. Thank you for coming back and sharing your detailed experience, we would love to know your feedback to improve our services and hope to be glad to have you back soon. We look forward to welcoming you again soon at our hotel ensuring the best service and attention at all times. With kind regards ِAli Askr F.O",
        "lang": "en",
        "author": "Turquoise Beach Hotel SSH",
        "published_date": "2024-03-24T14:07:34Z"
      }
    },
    {
      "id": 935557346,
      "lang": "en",
      "location_id": 563901,
      "published_date": "2024-01-25T20:42:34Z",
      "rating": 4,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d563901-r935557346-Reviews-Turquoise_Beach_Hotel-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review935557346",
      "text": "8-10/12/23 cheap online deal\n\nWe three London based middle-aged guys were on a week trip to the sun before Christmas. My friends has previously visited Sharm in January and stayed at this hotel so knew what to expect, having booked a first floor room by the pool then and similar this time but including a kitchenette. The total price for the two nights was good at £86 (a Friday and Saturday) for three. It was somewhere to stay a couple of nights after the flight and getting there as we were planning to stay most of the time in Dahab.\n\nOur plane arrived late and we met the prearranged minibus (having prebooked a personal taxi in advance - obviously cutting costs for them but also being more environmentally friendly!) at the airport. I got the front seat by the driver. \n\nThe driver with a full minibus was taking phone calls and texting throughout the journey. Noone was wearing seat belts in the back. Thankfully, in a sense, the brand new extra wide motorways criss-crossing the empty desert were completely empty (a legacy of government promissing a rapid expansion of tourism by providing infrastructure as is now a white elephant and totally environmentally - and COP 27) unfriendly! Our driver just kept to the centre lane whilst chatting or texting merrily on his phone. I am not sure how connected he was with the hotel. We were the first to be dropped off.\n\nWe arrived 20:10 to find a friendly receptionist who checked us in quickly. We were the only people arriving at the time. \n\nWhilst at the desk we sorted out the Wifi for our devices one by one (we found that the speeds in the room and even reception were very very slow so no uploading TA reviews from here!).\n\nAfter reception we went to our ground floor room 501, through the open communal space, past two young male 'dancers' entertaining the few people in the space with their dj system set up and big speakers. They 'danced' in loose synchrony then played requests as the odd guest danced. The playlist was limited to a repetitive Egyptian song and Barbie with multiple restarts so quite annoying! Some of the later song lyrics were not appropriate for families and thankfully all loud music stopped at 21:45! \n\nOn entering the ground floor apartment it was was not as we had booked (first floor, pool view with kitchenette). It was admittedly large, with a large lounge and big windows onto the communal area with seating (the pool was round the corner).\n\nA keycard was necessary to insert into the reader which turned on all the electrics apart from the large (noisy) fridge freezer which was on a separate circuit.\n\nAs we were settling in one of us went to see if the room could be changed as it was not what we had booked. He returned later to say they had not another available and we would be given the kettle soon. Sure enough a kettle arrived along with two plates of fruits, coffee and tea bags as welcome gifts. On preparing the tea we had no mugs or cups. On enquiring at the desk I was told the glasses (in the fridge) were suitable. Despite my fears of cracking glasses with boiling water they seemed to work although too hot to handle (with no handles!). The glass must be different to English glasses!\n\nEach room had electric sockets for lamps but not devices simultaneously. I used my multiadapter (I usually bring for these circumstances). The lounge has a (tinny sounding) LED TV (American CNN the only English channel of 15) and a telephone to reception.\n\nThe 'balcony' is almost public with the staff crossing it as if communal. A very low wall separating it from the public space ensures no privacy at all.\n\nThe apartment had two wet rooms, both with toilets. One a tepid bath and shower set up and the other a hot powerful shower which left a pool on the entire floor as the drainage raking has not been engineered properly to the drain which overflow anyway if the bath was emptied too quickly. This wet room has a hair dryer and a telephone!\n\nAsh trays and boxes of tissues were on every table of every room. We are not smokers but no smells were evident thankfully!\n\nThe A/C units were quite old and noisy but did the job on the rare occasions we used them.\n\nThe master bedroom with the double bed had plenty of wardrobe space and chests of drawers. \n\nThe twin bed room was similarly equipped and had its own TV (possibly for the children?).\n\nOn our first (Saturday) morning we wanted the buffet breakfast included in the deal. The communal terrace area was prepared with some tables ready for breakfast although at 08:20 it was a little cold, furthermore the ground's piped music was rather distorted and unbearable to listen to. We went into the main large dining room with ornate wooden latticework ceiling (a nightmare for dust settling and cleaning). It was dressed with Christmas decorations between the Egyptian wall hangings.\n\nAs we entered the hot drinks in urns were on the right. The coffee and tea were ok. Hot milk came out of a smaller urn but was very slow pouring.\n\nA double dispenser of chilled orange juice (not freshly squeezed) and (perhaps hibiscus) blackcurrant juice was popular, with (single use presumably) upside-down plastic cups in a tray (not stacked). This is odd as single-use plastic containers were not encouraged at COP27 there.\n\nThe pastries and salads were on an island with hot savoury dishes in heated containers against the far end wall.\n\nNumerous young waiters in yellow shirts tended to clearing the tables and restocking trays. \n\nThe older management in pastel pink or lilac shirts were hovering around or eating in the far corner.\n\nA young man dressed up in a red trimmed chef's suit waited for orders for\nfresh omlette with ham, cheese or veg or small plain pancakes.\n\nAt 09:00 he was replaced by an older 'chef' in blue who was able to crack eggs with his right hand whilst on the phone with his left!! Last year my friend tried to get a fried egg to no avail.\n\nThe trays were a variety of luke warm savoury dishes including braised mixed vegetables with ham. \n\nThe pastries were ok, obviously not as fresh as French style croissants.\n\nThe dining room had musac lounge music but it was undistorted thankfully.\n\nOne of the guests was collecting bread in napkins and putting them in his bag for later. Another filled a Tupperware box with hot milk - taking ages!\n\nAfter breakfast we sat around in our apartment and on our small 'balcony'/terrace reading papers. The distorted music was so dreadful I had to ask the reception to turn it off completely, which they did but left it on (indistorted) by the pool (where they were painting the parasols bright blue, only using towels on the floor, although noone was sunbathing or swimming. As far as I'm concerned the musac was all noise pollution and spoilt the atmosphere, sorry I'm getting old!\n\nAfter a shop we made our way to the beach on opposite side if the road. We had been issued with cards for the beach towels and arrived about 15:15 and on entering we were given a big towel each by the young man at the entrance. The beach was full of wooden sunloungers and parasols. The sun was already low and almost disappearing behind the local cliffs so there was little chance of sunburn on our first day! The view was of the cliff and town opposite with various boats moored up including police, yellow submarine, 'seascope', speedboats and other excursion vessels including a towed (not quite) banana boat. The sea was calm and relatively warm. Some boats left with very few people on them to see the sunset. At about 4pm a relatively full yellow seascope boat arrived back and the smell of diesel filled the air.\n\nThe beach was made up of gritty sand but I'm afraid lots of cigarette butts, filters plus bits of polystyrene (including balls) and plastic too, even in the water. At the end of the day the staff were sweeping up the butts from around the loungers, clearing out the bins and raking the sand into patterns.\n\nThe hotel and beach has special colour coded recycling bins dotted around in threes (plastic, cans and paper) but no general bins (so the recycling filled up with ordinary rubbish indiscriminately too, including lots of swept up cigarette butts). There were no bins for glass though (maybe there is too much sand around). This may be a result of COP27 initiatives and directives in November 2022. The hotel has a sign at reception saying they are part of the initiative to improve sustainability and conditions for wildlife. On the back of the room door is a notice encoding people to respect the wildlife. There was no policy though on towel usage (e.g. put only used towels on the floor). A notice above the sink encouraged you to turn off the water after use (!). \n\nThe amount of litter flying about or recyclables left around randomly outside the hotel was not a good look as were the enormous lit five lane roads surrounding a relatively small city. A token hire bicycle station was in the centre but no recycling bins for tourists to use. Greenwashing comes to mind.\n\nOverall the hotel has seen better days but it was cheap and we could not complain at all although we would have preferred a pool view, first floor with kitchenette apartment.\n\nOne evening we encountered a c-r and a Mouse in the apartment. This is not unusual and not as big deal for us. \n\nOn leaving (after a relaxed breakfast outside on Sunday morning) for the 10am GoBus to Dohab I went to reception check out and enquire about the cost of a taxi to the GoBus terminus. The receptionist told us to wait. As we had no idea of the cost to go the 3km (one of us has a bad leg so could not walk that far) but being aware that the taxi from the Airport 7km away was only 180 we did not want to pay more. We were told to wait and he proceeded to talk away at his phone. \n\nAfter a while of this we just decided to leave to catch one of the numerous taxis passing the hotel on the main road. As we were leaving through the security gate the security guard told us to wait which we found odd. He must have be been phoned from reception so they could get the taxi commission.  Sorry we were not in the mood to catch a (probably overpriced) taxi. Immediately a taxi passed by, we hailed it and it doubled back expecting our custom. We asked the price and after a bit of haggling got it down to 100 total (not each!). The security man then argued with the driver and aggressively took his registration number down. As far as we were concerned we had left the premises and it was not their business. \n\nThe driver then drove the very long way round (via those extra wide empty highways) to the old GoBus (derelict) station passing by the new big GoBus terminus (we told him to stop there but he ignored us). We arrived to be accosted by local hawks trying to sell whatever.  \n\nLuckily we did not take up the semiderelict cafe owner's offer to wait for a (non existent) 10am bus that actually left from the proper terminus. We walked the 200m to the new terminal, bought the tickets and caught the real bus to Dahab which did not pop into the old bus station to pick up those who did not know the departure location had changed.",
      "title": "Very good hotel obviously seen better days but hit by Covid and war north of the border a long way away!  Friendly staff",
      "trip_type": "Friends getaway",
      "travel_date": "2023-12-31",
      "user": {
        "username": "MikeLondonSE",
        "user_location": {
          "id": "186338",
          "name": "London, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/13/b9/83/a4/mike-k.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/13/b9/83/a4/mike-k.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/13/b9/83/a4/mike-k.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/13/b9/83/a4/mike-k.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/13/b9/83/a4/mike-k.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 931831340,
      "lang": "en",
      "location_id": 563901,
      "published_date": "2023-12-31T15:40:13Z",
      "rating": 3,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d563901-r931831340-Reviews-Turquoise_Beach_Hotel-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review931831340",
      "text": "Location, rooms, staff،  view  and Beach are good.\nFood at the Buffet  are simply bad, not adequate, poor in quality, without tastes, lacks variety, small quantity and poor presentation.\n\nNo WiFi in the lobby",
      "title": "Don't eat there and expect to be very disappointed if you do",
      "trip_type": "Friends getaway",
      "travel_date": "2023-12-31",
      "user": {
        "username": "TutAnkhAmoun",
        "user_location": {
          "id": "3175452",
          "name": "Saint-Just-en-Chaussee, Oise, Hauts-de-France"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/de/0a/default-avatar-2020-35.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/de/0a/default-avatar-2020-35.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/de/0a/default-avatar-2020-35.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/de/0a/default-avatar-2020-35.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/de/0a/default-avatar-2020-35.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 931320847,
      "lang": "en",
      "location_id": 563901,
      "published_date": "2023-12-28T15:35:05Z",
      "rating": 5,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d563901-r931320847-Reviews-Turquoise_Beach_Hotel-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review931320847",
      "text": "Very good. Good staff and good entertainment for the kids. They have not so good food but you will manage to find something at each meal that is decent. I enjoyed my stay here it was very warm and nice. They are very welcoming. Room service is also good.",
      "title": "They have very nice staff, they are good at entertaining. Food however is not so good but you will find something good!",
      "trip_type": "Family",
      "travel_date": "2023-12-31",
      "user": {
        "username": "Nomad50139334677",
        "user_location": {
          "id": "297555",
          "name": "Sharm El Sheikh, South Sinai, Red Sea and Sinai"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f4/5d/default-avatar-2020-32.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f4/5d/default-avatar-2020-32.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f4/5d/default-avatar-2020-32.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f4/5d/default-avatar-2020-32.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f4/5d/default-avatar-2020-32.jpg"
        }
      },
      "subratings": {}
    }
  ]
}