{
  "data": [
    {
      "id": 945961606,
      "lang": "en",
      "location_id": 5982512,
      "published_date": "2024-04-09T10:27:43Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g20116893-d5982512-r945961606-Reviews-Aska_Lara_Resort_Spa-Kemeragzi_Antalya_Turkish_Mediterranean_Coast.html?m=66827#review945961606",
      "text": "We had a lovely stay at this place recently. This is essentially a one stop shop for all the needs of a tourist. You won’t require to go out of their eco system at all. \nThe service we received was fantastic and everyone seemed so passionate about their work. Some of the reviews talk about service not up-to the mark but maybe that might be due to the timing. We were there in April and I can’t complain about the service. I will have to name some of the people who looked after us because they went over and above to help us. \nEkin, who works in the restaurants was really helpful and she was always servicing with a smile. She was very kind and friendly and brought our drinks to our tables within no time.\nSalih, who works in the restaurant was very friendly and gave us really good information on local things. He knew our dining preferences very quickly and as soon as he saw us he would bring the relevant items. \nPlease pass on out thanks to them.\nAll in all a very friendly atmosphere and accommodating every need of the guests. Thank you for making our stay so wonderful. We would definitely return to this place.",
      "title": "Fantastic",
      "trip_type": "Family",
      "travel_date": "2024-04-30",
      "user": {
        "username": "666ronyc",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e5/66/default-avatar-2020-53.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e5/66/default-avatar-2020-53.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e5/66/default-avatar-2020-53.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e5/66/default-avatar-2020-53.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e5/66/default-avatar-2020-53.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      }
    },
    {
      "id": 945953958,
      "lang": "en",
      "location_id": 5982512,
      "published_date": "2024-04-09T09:15:08Z",
      "rating": 3,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g20116893-d5982512-r945953958-Reviews-Aska_Lara_Resort_Spa-Kemeragzi_Antalya_Turkish_Mediterranean_Coast.html?m=66827#review945953958",
      "text": "staff in restaurants pretend to look busy, tables dirty and staff were just waking past, not offering wine/drinks  with evening meal we honestly had to ask every night and it was as though we were an inconvenience. The young teenagers are a credit to the hotel so friendly,smiley and really do work hard same as the cleaning staff around the pool and inside the hotel well done guys 🙌🏻👍🏼 Cats roaming around the whole hotel in the restaurants, spa so did not like this at all as the cats were quite vicious. Staff were constantly on their phones and couldn’t even say good morning!!! This really spoils my holiday as manners cost nothing. \nRooms were clean and fridge replenished daily. It’s a very noisy hotel as it’s all open plan so if you enjoy your zzzzz it’s well into 1am before it goes quiet. \nLots of pools and the water park area amazing for kids we walked every day as just as quick. Lots of work going on tho at water park which I couldn’t understand why it wasn’t all done in winter ? Beach nice but again the pier not open or the private cabanas ?? \nSpa area nice used that often however small children in sauna and steam room think they’re too young  no one checking?  Big ginger cat roaming around spa 🤮\nStarbucks is good and lady works so hard can wait 10 mins but well worth it. \nNice hotel but wouldn’t be in a rush to come back.",
      "title": "Just ok",
      "trip_type": "Couples",
      "travel_date": "2024-04-30",
      "user": {
        "username": "maccyboy",
        "user_location": {
          "id": "186543",
          "name": "Inverness, Scottish Highlands, Scotland"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e2/81/default-avatar-2020-43.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e2/81/default-avatar-2020-43.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e2/81/default-avatar-2020-43.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e2/81/default-avatar-2020-43.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e2/81/default-avatar-2020-43.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
          "value": 2,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
          "value": 2,
          "localized_name": "Sleep Quality"
        }
      }
    },
    {
      "id": 945940670,
      "lang": "en",
      "location_id": 5982512,
      "published_date": "2024-04-09T07:08:53Z",
      "rating": 3,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g20116893-d5982512-r945940670-Reviews-Aska_Lara_Resort_Spa-Kemeragzi_Antalya_Turkish_Mediterranean_Coast.html?m=66827#review945940670",
      "text": "This was a holiday of 2 halves which is probably something to do with the full facilities opening on 1st April. \n\nI did a lot of research and read recent reviews on here before we booked ( unlike some people who review on here!! ) So was aware that I might have a bad view ( as I paid for the cheapest room) the water park wasnt open until the 1st April and that we had to get a bus to it. I was fine with all this as for the price we were paying you have to put things into context. I was worried about fighting as per earlier reviews but we didnt see any trouble during our stay.\n\nWe arrived late at the hotel and were happy to find that the restaurant opens up again at night for people who arrive late. Our room, as expected was facing some flats but I dont go on holiday to stay in my room so this wasn't a problem - it you want a nice view - pay for it. My request to be away from the nighclub and to have 2 single beds for the kids was honoured and our room was nice and clean and stayed that way all week - no issues with housekeeping.\n\nThe waterpark actually opened early as the weather was good and the bus ride was literally 2 minutes and very frequest. we walked back one day and it took 5 or 10 minutes - its really not a big deal - feels like you are going out for the day!\n\nI am surprised that people say there is nothing to eat at the restaurant - I actually can't believe how many options there were. If you dont know that there is another section right at the bottom near the ice cream stall though I wouldn't be surprised as its not signposted at all. You can get freshly grilled meat, veg and fish there and amazing freshly baked bread. Its also where the eggs are in the morning. The salad bar is extensive and is something I always go for for at a buffet so I was very happy with the food. Pizza might be good for the kids but there was always pasta. tip - the red sauce next to the chip is NOT ketchup! it is really hot chilli sauce. I would have thought there woud be more kebabs in Turkey though!\n\nStabucks was nice to have but the queue was always too big for me to be bothered - more staff needed.\n\nAfter 3 days i was getting very annoyed with the service though, I try to be polite to serving staff having been one myself and it just didn't make any difference. We would sit in the retaurant in the evening and try our hardest to get someones attention for a drink but its like they avoid eye contact! I went to the bar myself and they said no its table service?! When we did manage to get a small glass of wine it was poured out of a bottle from the side and was therefore warm. we had 2 or 3 meals without a drink - on holiday its nice to have a bottle of wine on your table. Staff would also walk right into you too like you were in their way, usually on holiday you are made to feel valued but it just felt like we were in the way. But after the 1st April this miraculousy changed and Ramazan was the first person to show us some proper service! After that waiters were walking round qwith chilled wine refilling your glasses when needed - it was a complete shift!  The buffet is busy but no busier than other all inclusive places, you just have to be wary of people with no manners as always.\n\nLunch at the waterpark is table service but again you have to try and get eye contact for a drink. It honestly looked like half the staff just hate being there.\n\nThe bar staff were the same, not friendly and sometimes plain rude. I was actually stood at the bar at the brasserie and the woman serving knew I was there but just went to have a chat to another staff member instead - when someone else came to the bar she went over to serve them! She was frankly miserable all week. The server on the water park bar actually closed the bar early a couple of times at 3.45 despite there being a queue of people - she just looked at everyone and said - its closed and pulled the shutter down. I was stood waiting with a 5 year old.\n\nThe watepark is fun for the kids albeit a bit cold but thats because it was April - there was some strange choices of music during the waterpolo one day - songs I would never play in front of kids but I thought it was quite funny - some might be really offended though. The slides close for 2 hours in the daytime - not really sure why?\n\nMy favourite part was the beach which also has a beach bar open til 5 - think this is later after April though. The ladies making the turkish bread were great and the bread tasted amazing - this was a lovely touch.  On the last day people were setting up some minatures plamtrees on the side of the walk way - we were sat next to it with our belongings beside us. The maintenance guy came over lieterally kicked our stuff out of his way and put the tree down instead of gesturing for us to move it as he was about to put it right there.\n\nI didnt see anything related to kids club - not really sure if I missed something but these recent reviews say how good it was but it just wasnt very obvious. I didnt seek it out though to be fair.\n\nEvening entertainment was ok. The best nights were the miss Aska and Mr Aska competitions with \"Nemo\" who is great - we laughed a lot at these. staff bringing drinks were actually much better in the evening and made it easier than standing in the bar queue and earned some well deserved tips.\n\nI dont understand why the pool bar closed at 4pm though, that annoyed me. The pool closes at 7.  One day we wanted to stay out as long as possble to make the most of the sun so kept having to go upstairs to the brasserie and get glasses or bottles and bring them back down which is not really ideal next to a pool. Not everyone is drinking all day and it might get to 4pm and you think I fancy a nice beer by the pool - no, bar is closed! Fair enough at the waterpark but not by the main pool, it should be open until it closes.\n\nWe did ok for sunloungers at the main pool - yes people come and put towels on but we would be there at 9am and manage to get a couple of beds, There are 4 of us but I would just grab 2 as the kids are mostly in the pool anyway. There's no need to be a family of 2 adults and 5 kids putting towels on 7 sun loungers that the kids dont even sit on all day whilst people are laying towels on the hard floor for their kids right next to them. Some people just don't have normaly decency and manners - and in case you are wondering they were English and actually took one of our beds to lie empty all day. When we didnt get a bed we just layed our towels on the grass which is not an issue for me.\n\nIf anyone has concerns about cats - there are lots of cats and yes there are in the restaurant and no one cares - I wasnt bothered by it though. \n\nI had a good time, met some great people and think the hotel was very fair for the price we paid but probably would not return and thats mainly due to the service in the bars and retaurants - we had no issue with reception staff though. The service Issue might be to do with the time of year though.",
      "title": "Nice holiday but not sure I would recommend because of service ( in March )",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "Gorfield",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/01/2d/37/f6/gorfield.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/01/2d/37/f6/gorfield.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/01/2d/37/f6/gorfield.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/01/2d/37/f6/gorfield.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
          "value": 2,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Sleep Quality"
        }
      }
    },
    {
      "id": 945873676,
      "lang": "en",
      "location_id": 5982512,
      "published_date": "2024-04-08T15:06:17Z",
      "rating": 3,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g20116893-d5982512-r945873676-Reviews-Aska_Lara_Resort_Spa-Kemeragzi_Antalya_Turkish_Mediterranean_Coast.html?m=66827#review945873676",
      "text": "I really don't like to complain, but I have to say I will never come back to this resort. After a couple of days my sunglasses were stolen from inside the hotel and the hotel were no help at all, but just kept fobbing us off and sending us to different people and didn't want to provide any information about where we could report the theft.  The hotel is nice enough to look at, but the service is really poor - no-one seems willing to help or provide any information about anything, events or what drinks they serve, and there are no menus or signs to help. It took us a few days to find the extra grill/breakfast items on the terrace as it was so poorly signposted and it was really hard to get drinks or food during the afternoon. ",
      "title": "Could have been so much better",
      "trip_type": "Family",
      "travel_date": "2024-04-30",
      "user": {
        "username": "emilyaddai22",
        "user_location": {
          "id": "186356",
          "name": "Nottingham, Nottinghamshire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/77/ae/default-avatar-2020-2.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/77/ae/default-avatar-2020-2.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/77/ae/default-avatar-2020-2.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/77/ae/default-avatar-2020-2.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/77/ae/default-avatar-2020-2.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 945929406,
        "title": "Owner response",
        "text": "Dear Guest\nThank you for choosing our hotel for your vacation and for sharing your candid thoughts about your recent stay with us. We always investigate the issues related to the experiences shared by our guests and we endeavour to do the necessary work when we are sure that it needs to be improved. However, you can rest assured that we will check all the points you mentioned in your review. And we will pass on your feedback to the hotel management. \nHowever, with your permission, we would like to point out a few points of your review. \nIn Thursday you addressed our colleagues about your forgotten glasses in the toilet near one of the bars. Our colleagues did all the work to help find your glasses and looked through the cameras, but unfortunately they could not find them. As you can understand there are a lot of guests in the hotel and it is not always possible to eliminate the confusion with the glasses. The hotel always tries to help all guests if they lose something, but unfortunately they are not always able to find it.\nAlso at check-in all our guests are provided with all information about the hotel, as well as on the keys to the room there is a QR code with the schedule of opening times of restaurants and bars, as well as the full concept. In the lobby of the hotel on the info stand there is a schedule of the animation program of the hotel. In all bars there is also a QR code with the menu, and at the entrance to the restaurant and in the restaurant itself there is a sign that there is a grill on the terrace that would make it easier for all guests to find. The hotel also has one of the bars open 24 hours a day for the convenience of all guests, as well as from morning until late evening there are always open restaurants or snacks, as well as in the brasserie bar there are always sandwiches for a snack for all guests.\nOur aim is to provide a relaxing and enjoyable experience. We would like to emphasize that the team of our hotel makes every effort to ensure that the rest of each of our guests passed in a friendly and comfortable environment. We are constantly working to improve the quality of our services, including through continuous training of our service staff. \nWe realize that your experience did not meet your expectations, and while we cannot change your past experience, we hope you will reconsider and give us another chance to ensure a more positive stay in the future.\nRegards\nDaria Yıldız\nCRM Shift Leader\nAska Lara Resort & SPA",
        "lang": "en",
        "author": "Aska Lara CRM",
        "published_date": "2024-04-09T05:12:30Z"
      }
    },
    {
      "id": 945742324,
      "lang": "en",
      "location_id": 5982512,
      "published_date": "2024-04-07T15:21:25Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g20116893-d5982512-r945742324-Reviews-Aska_Lara_Resort_Spa-Kemeragzi_Antalya_Turkish_Mediterranean_Coast.html?m=66827#review945742324",
      "text": "Aska Lara is amazing! The hotel is spotless, food caters for everyone & facilities couldn't be better. Would definitely recommend & come back. The staff are friendly & can't do enough to make your stay memorable. Nur and can were amazing, so friendly",
      "title": "Family holiday",
      "trip_type": "Family",
      "travel_date": "2024-04-30",
      "user": {
        "username": "912lyndsayj",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ea/74/default-avatar-2020-68.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ea/74/default-avatar-2020-68.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ea/74/default-avatar-2020-68.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ea/74/default-avatar-2020-68.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ea/74/default-avatar-2020-68.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 945782707,
        "title": "Owner response",
        "text": "Dear guest\nThank you for choosing our Aska Lara Resort & Spa for your vacation.\nWe would also like to thank you for taking the time to share your personal and positive impressions of your well-deserved vacation at our hotel.\nYour kind and motivating words are greatly appreciated and will be passed on to the management and staff!\nWe look forward to welcoming you back to us to give you many more comfortable vacation experiences!\nRegards,\nDaria Yıldız\nCRM Shift Leader\nAska Lara Resort & SPA",
        "lang": "en",
        "author": "Aska Lara CRM",
        "published_date": "2024-04-08T01:16:48Z"
      }
    }
  ]
}