{
  "data": [
    {
      "id": 943529192,
      "lang": "en",
      "location_id": 7806223,
      "published_date": "2024-03-23T15:11:05Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7806223-r943529192-Reviews-Axel_Two_Barcelona-Barcelona_Catalonia.html?m=66827#review943529192",
      "text": "I would not recommend this hotel for US travelers. It is not at all accommodating. The hotel manager woman on 3/31 was not helpful for many problems. I arrived and the A/C unit was not properly changed from “heat” to “a/c” per the manager. I waited around for it to be fixed and many hours later a gentleman from maintenance arrived only to tear apart the room to change it to an a/c setting In the ceiling. It cannot accommodate a simple 68 degrees. The air conditioning unit is simply obsolete. The room was hot. I asked to be switched to a different room and told from the manager that since I’m from America the A/C units do not have the functionality to be switched to “those that work like in the US Florida” it simply does not blow cold air at all. I was denied a switch. I had booked the hotel through expedia. The hotel  endorses  that it has a hotel bar and pool bar, not true! The hotel bar is small, without many options. However, after much debate I was switched to their sister property at Axel to accommodate my request only to find out after walking it was closed until 8pm from a suggestion of their stellar manager. In the Am I tried to obtain breakfast and was met with a host that would not allow me to pay cash, instead only to bill the room. The host was rude and only speaks to the mismanagement at this property. I finally asked to be switched to their sister property and I was met  with a much different experience, the manager cares about customers and was able to accommodate an a/c and a hotel bar. The manager at the “two hotel of Barcelona” was expecting me to walk several miles to go to their much better sister property at Axel. Finally, The management at two hotel of Barcelona  tried to charge me for a phone call from Expedia that I never received from poor training of the staff at the welcome desk. The staff at two hotel is unfriendly, unwelcoming, and does not try to help with any problems or concerns. Buyer beware! I would book with their sister property at Axel Hotel. I will be asking for asking Expedia for a full refund for the first night at two hotel of Barcelona. It was terrible!",
      "title": "Buyer beware",
      "trip_type": "Solo travel",
      "travel_date": "2024-03-31",
      "user": {
        "username": "bradhP3014BO",
        "user_location": {
          "id": "34227",
          "name": "Fort Lauderdale, Broward County, Florida"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f0/9f/default-avatar-2020-16.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 944276403,
        "title": "Owner response",
        "text": "Dear Brad,\nThank you for sharing your feedback regarding your recent stay at our hotel. As the manager, I would like to extend my sincerest apologies for any confusion or inconvenience you experienced during your time with us. \n\nI want to clarify that our hotel does not have a rooftop bar open outside of the high season, and the only bar available is located in the lobby. I'm sorry if there was any misunderstanding regarding this. Additionally, I apologize for any confusion regarding your visit to the Axel hotel and the closure of their bar. I had specifically informed you about this since it is not yet summer season. \n\nI also want to address the air conditioning issue you encountered. I'm pleased to inform you that the problem was promptly resolved once identified. It was discovered to be caused by a sudden change in weather, leading to difficulties in regulating the room temperature. \n\nRegarding your request to transfer to the Axel hotel due to your preference for a night bar, I want to assure you that we made every effort to accommodate your request. Upon receiving authorization (10min after our conversation) and securing a reservation at the main Axel hotel without any additional charges, we attempted to relay this information to you. Unfortunately, we were unable to locate you at the time to deliver the news. \n\nOnce we were able to communicate the information to you, I personally reached out to the hotel manager at the other Axel hotel to ensure a smooth transition for your stay. \n\nPlease accept my apologies once again for any inconvenience you experienced. Your comfort and satisfaction are important to us, and we appreciate your understanding. If there's anything else we can assist you with or if you have further concerns, please don't hesitate to reach out. \n\nWarm regards, ",
        "lang": "en",
        "author": "Manager TWO Barcelona by Axel",
        "published_date": "2024-03-28T13:03:09Z"
      }
    },
    {
      "id": 943174812,
      "lang": "en",
      "location_id": 7806223,
      "published_date": "2024-03-20T13:24:50Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7806223-r943174812-Reviews-Axel_Two_Barcelona-Barcelona_Catalonia.html?m=66827#review943174812",
      "text": "I enjoyed the very friendly welcome, to a great room which i could get in the morning when they saw that i stayed my birthday week. The room was spacious, well appointed and spotless clean. \nGood breakfast. Fantastic location and also loved the sundeck with the nice small pool.\nI would definitely recommend the TWO by Axel anytime\nGracias wonderful staff",
      "title": "I very much enjoyed my stay",
      "trip_type": "Solo travel",
      "travel_date": "2024-03-31",
      "user": {
        "username": "FarAway26932552911",
        "user_location": {
          "id": "187234",
          "name": "Nice, French Riviera - Cote d'Azur, Provence-Alpes-Cote d'Azur"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/de/0a/default-avatar-2020-35.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/de/0a/default-avatar-2020-35.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/de/0a/default-avatar-2020-35.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/de/0a/default-avatar-2020-35.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/de/0a/default-avatar-2020-35.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 943377753,
        "title": "Owner response",
        "text": "Thank you so much for taking the time to share your positive experience with us! We're thrilled to hear that you thoroughly enjoyed your stay at TWO by Axel.\n\nIt's wonderful to know that you appreciated the warm and friendly welcome from our staff, and we're delighted that we could make your birthday week even more special by providing a great room for you. We're glad you found your room spacious, well-appointed, and spotlessly clean - our team works hard to ensure every guest feels comfortable and satisfied.\n\nWe're pleased that you enjoyed the breakfast offerings and found our location fantastic. It's also great to hear that you loved our sundeck with the pool - it's always nice to relax and enjoy the amenities during your stay.\n\nThank you for recommending TWO by Axel! Your kind words mean a lot to us, and we're grateful for your acknowledgment of our wonderful staff. We look forward to welcoming you back on your next visit to Barcelona\nWarm regards,",
        "lang": "en",
        "author": "Manager TWO Barcelona by Axel",
        "published_date": "2024-03-22T09:51:19Z"
      }
    },
    {
      "id": 939626334,
      "lang": "en",
      "location_id": 7806223,
      "published_date": "2024-02-24T14:00:39Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7806223-r939626334-Reviews-Axel_Two_Barcelona-Barcelona_Catalonia.html?m=66827#review939626334",
      "text": "Just came home from a 3 night stay at this hotel. Staff welcoming and friendly. \n\nHotel room was clean, modern and just what we needed. Bed was big and comfortable, had towels and shower products & a hair dryer. Also has a mini bar if you want however cheaper to buy at a local supermarket. \nAlso had a balcony but can not smoke on the balcony. \n\nLocation wise it is not too bad. Had a few restaurants and shops locally but we decided to venture off to the hotspot areas such as Barcelona Cathedral, Barcelona Beach, La Rambla Street etc. We went to these areas everyday by walking or getting on the bus.\n(Bus is very easy to use in conjunction with Google Maps) \n\nWe did go to a little cafe / bar around the corner from the hotel called Garbi. Alcoholic drinks are very cheap, food was nice and staff very lovely so if you want a £2 beer go there! \n\nDefinitely check out La Boqueria Market if you want to try some new foods, Ciutadalla Park was lovely to walk around and you can row a boat. \n\nFood places we went to but (a bit expensive but well worth it) was Harry’s, La Selva and Boa Bao. \n\nAll in all, we had a pleasant stay. I could not fault the hotel, or the staff. Location is not in the centre but very easy to travel to by bus (10-15 min journeys). \n\nIf you are going to the hotel or to the airport, do NOT use a taxi!! They are expensive and not worth it. We found out there is a bus that takes you to the airport which was a 2 minute walk away - it cost $7 euros each compared to a $40 euro taxi! I think the journey was around 20-30 minutes by coach/bus. It was easy, cheap and convenient! \n\nThank you to the staff! \n\nReccomended!",
      "title": "Recommend!! GREAT HOTEL",
      "trip_type": "Couples",
      "travel_date": "2024-02-29",
      "user": {
        "username": "katiee_x",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e9/60/default-avatar-2020-64.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e9/60/default-avatar-2020-64.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e9/60/default-avatar-2020-64.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e9/60/default-avatar-2020-64.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e9/60/default-avatar-2020-64.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 942375526,
        "title": "Owner response",
        "text": "Thank you so much for taking the time to share your experience with us! We're thrilled to hear that you had a wonderful 3-night stay at our hotel.\n\nIt's fantastic to know that you found our staff welcoming and friendly, and that you enjoyed the cleanliness and modern amenities of your room. We're glad you found the bed comfortable and appreciated the complimentary towels, shower products, and hairdryer provided.\nWe're pleased to hear that our location suited your needs and that you were able to explore popular attractions such as the Barcelona Cathedral, Barcelona Beach, and La Rambla Street with ease. Thank you for mentioning the convenience of using the bus, especially with the assistance of Google Maps.\n\nYour recommendation of the nearby cafe/bar, Garbi, and your suggestions for exploring La Boqueria Market and Ciutadella Park are greatly appreciated. We're delighted that you enjoyed your dining experiences at Harry's, La Selva, and Boa Bao.\n\nWe're honored to have been a part of your memorable stay in Barcelona and are grateful for your kind words about our hotel and staff. Your tip about using the bus instead of taxis for travel to the airport is valuable information for our future guests, and we're glad you found it easy, cheap, and convenient.\n\nOnce again, thank you for choosing to stay with us, and we look forward to welcoming you back in the future! If there's anything else we can assist you with, please don't hesitate to let us know.\n\nWarm regards,",
        "lang": "en",
        "author": "Manager TWO Barcelona by Axel",
        "published_date": "2024-03-15T06:39:52Z"
      }
    },
    {
      "id": 930249352,
      "lang": "en",
      "location_id": 7806223,
      "published_date": "2023-12-19T04:27:37Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7806223-r930249352-Reviews-Axel_Two_Barcelona-Barcelona_Catalonia.html?m=66827#review930249352",
      "text": "Great hotel, staff was very friendly and helpful.  Rooms were nice and modern, concierge was able to get me a room earlier with a small upcharge so I can pass out from terrible sleepless flight.  Right next to the metro so traveling anywhere in the city was easy.  Staff scheduled a taxi pickup to Park Guell and the Airport for me.   Traveled as a solo hetero male and would stay again and recommended to others as well.  Didn't have chance to check out sky bar figured with it being December it would be too cold.  I didn't include breakfast in my stay since I'm not a breakfast person but had breakfast one day and it was good",
      "title": "Great stay",
      "trip_type": "Solo travel",
      "travel_date": "2023-12-31",
      "user": {
        "username": "Bdinh1985",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e9/ef/default-avatar-2020-66.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e9/ef/default-avatar-2020-66.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e9/ef/default-avatar-2020-66.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e9/ef/default-avatar-2020-66.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e9/ef/default-avatar-2020-66.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 933716997,
        "title": "Owner response",
        "text": "Dear Bdinh,\n\nThank you for sharing your positive experience! We're thrilled to hear that you enjoyed your stay with us and that our staff was able to make your arrival more comfortable. It's great to know you found the rooms modern and appreciated the convenient location near the metro. We're glad we could assist with taxi pickups and that you had a good breakfast experience. We hope to welcome you back in the future, and don't hesitate to check out the sky bar next time – it might surprise you, even in December! Safe travels, and thank you for recommending us to others!\n\nKind regards,",
        "lang": "en",
        "author": "Manager TWO Barcelona by Axel",
        "published_date": "2024-01-11T12:44:38Z"
      }
    },
    {
      "id": 920304507,
      "lang": "en",
      "location_id": 7806223,
      "published_date": "2023-10-08T06:37:41Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d7806223-r920304507-Reviews-Axel_Two_Barcelona-Barcelona_Catalonia.html?m=66827#review920304507",
      "text": "A clean and modern hotel, with very friendly staff. Nothing seemed to be too much trouble for all of the lobby receptionists. Particularly Eric who helped us out a couple of times. \nWe spent four nights in the Two hotel, the breakfast is pretty good value for money\n(A change of tea bag wouldn’t go amiss! 😂 my only complaint). The girl in the breakfast room was very efficient and kind. \nWe didn’t have time to get to the sky bar because we were too busy trying out some of the great restaurants in the city!\nCan’t wait to get back. \nA great hotel for all. \nDon’t be put off by the some of the advertising for this hotel. It’s a worthwhile stay.",
      "title": "Modern hotel for All",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "maysie24",
        "user_location": {
          "id": "186261",
          "name": "Dorset, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e8/ea/default-avatar-2020-63.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e8/ea/default-avatar-2020-63.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e8/ea/default-avatar-2020-63.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e8/ea/default-avatar-2020-63.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e8/ea/default-avatar-2020-63.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 922017130,
        "title": "Owner response",
        "text": "Dear Ian,\n\nWe deeply appreciate your kind words about your recent stay at our hotel. We're delighted to hear that you found the Two Hotel by Axel to be clean, modern, and our staff to be exceptionally friendly.\n\nIt's wonderful to know that Eric and the rest of the front desk team went above and beyond to assist you during your stay. We take pride in providing excellent service, and your recognition is truly rewarding.\n\nWe apologize for the minor hiccup regarding the tea bag, and we'll certainly take your feedback into account to enhance this aspect of our service. We're glad to hear that Paula in the breakfast room provided you with efficient and kind service.\n\nWe hope that, on your next visit, you'll have the opportunity to experience our sky bar\n. Exploring the city's fantastic restaurants is undoubtedly a great way to enjoy your time here.\n\nWe can't wait to welcome you back, and we're thrilled that you're looking forward to returning. Your enthusiasm means a lot to us, and we're grateful for your recommendation.\n\nThank you for choosing the Two . We're excited to host you again in the future.\n\nWarm regards,",
        "lang": "en",
        "author": "Manager TWO Barcelona by Axel",
        "published_date": "2023-10-19T11:33:53Z"
      }
    }
  ]
}