{
  "data": [
    {
      "id": 937736186,
      "lang": "en",
      "location_id": 889766,
      "published_date": "2024-02-11T08:03:26Z",
      "rating": 3,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d889766-r937736186-Reviews-Oriental_Rivoli_Hotel_Spa-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review937736186",
      "text": "I returned on Wednesday back home after a 10 nights stay at the hotel. \nHere now my review.\nBefore booking this hotel, I knew what to expect, as I was living for many years in Sharm. \nUnfortunately, as many hotels in Sharm there is no investment in TLC programs.\nCheck in was fast und you will be provided by your AI concept. The bellman then takes you to your room and will explain you the allocation of restaurants and bars, etc.\n\nRooms\nI have had a small tour through the hotel when it was taken over from Tropicana and been renovated. The rooms back then looked amazing but time took its toll and they look tired now. The bathroom was ok but a toilet brush was missing, so it is embarrassing when the houseman had to clean up the bowl. Upon arrival there was some dust underneath the wardrobe, the bathroom mirror was also not cleaned well and the soap dispenser had dried soap around the pump. \nWhat I also noticed was that the bedside lamp’s cord was fixed with tape.\nThere is a small flat screen telly with several channels, however it is placed on the dressing table in front of the mirror. Why do they not fix them on the wall?\nFurther you are provided with a small kettle, tea and sugar. If you like to have your morning coffee on the balcony, just go to the supermarket and buy some instant coffee. Please be careful when using the kettle, as the cord is very short and you have to use the same plug as of the telly.\nA free safety deposit box and a mini fridge is provided in the room with bottled water upon arrival.\nJust a thank you to Alaa the houseman, who did some nice decorations and cleaned the room well.\nRestaurant\nBreakfast lunch and dinner is served here. As the restaurant is small, so is the buffet, however there is always something you will like. Pasta, rice, potatoes, vegetables, salads etc., not to forget the pastries. On the terrace of the restaurant you will find the life cooking station, where the chef will prepare eggs and pancakes for breakfast, chicken, fish, pasta etc for dinner. At one of the dinners (different themes each day), they have had Shawerma wraps - very delicious.\nWhat annoyed me was, that the waiting staff used their mobile phones during the operation time. Addressed it to one of the managers, phones were banned and the service was more attentive. As I travelled on my own, the staff were very reserved at the beginning but it has been changed during my stay.\nSo, also here a thank you to all the waiting and kitchen staff for the service provided.\nBe careful when leaving unattended food on your table at breakfast and lunch time. The crows are an annoyance everywhere in Sharm and very clever. A staff member from Pest control will cease them with a stick. \nFiltered coffee (tasted awful), tea, the usual soft drinks and juice (mostly powdered) are available.\n\nIn the AI concept is mentioned an A la carte restaurant. Unfortunately it is not working as guests are not interested.\nBars/Pools\nThere are 3 pools in the hotel area, whereby one is heated during the winter time with cloudy water. I mostly stayed at the pool closed to the reception and enjoyed the sun.\nBars - 2 at pools which are serving non- and local alcoholic drinks, as well a bar next to the reception with international alcoholic beverages and fresh juices at extra charge.\nEntertainment\nIt was the usual hotel entertainment. Oriental show, belly dancer, Tanura, competitions, fire show etc.\nMika is a very bubbly girl and is doing her best in motivating the guests on the daily activities.\nThe DJ during the evening entertainment with his funny accent is annoying. \nThe clientele of the hotel is mixed - lots of Italians, some British, Egyptian and few Germans.\nWould I recommend the hotel? Why not. If you have a small budget, this hotel is for you. Go with an open mind and enjoy the weather of Egypt. \nAs the hotel is allocated in Naama Bay, it will be only a short walk into town with its restaurants, bars, shops and evening entertainment.\nSales men for excursions, from Spa and the beauty salon walking around the pools and offering their service.\nI went for some massage at the Spa and quite enjoyed it. I highly can recommend Hannan, she did a nice job.\nTipping - this is up to you. Take Dollar or Euro notes with you, as the staff will exchange it on a better rate as in the bank. \nI haven´t tipped the staff during my stay, only at the end I handed some Euro to the manager in charge. \nTummy bugs – I haven’t had at any time during my stay an upset tummy. Please put on mind you are not home. For sure you will try different types of food whilst on holiday and you also will have a few drinks with ice cubes as it is already hot in Egypt. This is mostly what causes an upset tummy, as well the AC in the room, which we European are not use to. Drink plenty of water, don’t stay too long in the heat and set the AC in the room at 23 degrees. \nI like to say a big Thank You to Eslam from the reception, with who I had a nice chat from time to time. If you have any question he will definitely assist you.\n\nThank you and good luck to everyone at the hotel",
      "title": "My stay",
      "trip_type": "Solo travel",
      "travel_date": "2024-01-31",
      "user": {
        "username": "496annettm",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/eb/a3/default-avatar-2020-38.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/eb/a3/default-avatar-2020-38.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/eb/a3/default-avatar-2020-38.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/eb/a3/default-avatar-2020-38.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/eb/a3/default-avatar-2020-38.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 936060523,
      "lang": "en",
      "location_id": 889766,
      "published_date": "2024-01-30T09:48:38Z",
      "rating": 2,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d889766-r936060523-Reviews-Oriental_Rivoli_Hotel_Spa-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review936060523",
      "text": "Firstly and to be fair the new year celebration was amazing, however.\n1. There is no private beach it is shared with a hotel and restaurant and is a good 35 minute walk. There is also no all inclusive serving at this beach.\n2.It advertises WiFi you will not get this in a lot of the bedrooms.\n3. The all inclusive is closed by 10pm and there is only one small bar where this is available.\n4. The all inclusive buffet is very similar everyday.",
      "title": "Not all as it may seem",
      "trip_type": "Couples",
      "travel_date": "2023-12-31",
      "user": {
        "username": "bobnI9645QD",
        "user_location": {
          "id": "186216",
          "name": "United Kingdom"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f1/b8/default-avatar-2020-22.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f1/b8/default-avatar-2020-22.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f1/b8/default-avatar-2020-22.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f1/b8/default-avatar-2020-22.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f1/b8/default-avatar-2020-22.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
          "value": 2,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
          "value": 2,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 926123063,
      "lang": "en",
      "location_id": 889766,
      "published_date": "2023-11-16T10:02:41Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d889766-r926123063-Reviews-Oriental_Rivoli_Hotel_Spa-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review926123063",
      "text": "Unfortunately the hotel only gets a 1 star which I will explain via the review . I will however start off with the good points which there isn't many . 3 pools of all different depths 1 of those being a bit warmer and dirtier due to them having foam parties every Monday in that particular pool which was very good and entertaining and we thoroughly enjoyed that . Now only one bar was operating really which was by the restaurant and in all fairness the bar worker can't remember his name was very friendly and welcoming . The other bar was pretty non existent hardly anyone manning it and several times you were left standing there and leaving without a drink which after a few days didn't bother us as we'd completely had enough of the horrible watered down crap that you get everywhere in all honesty on all inclusive trips . The food ! Very good some days atrocious most of the time . Ended up with very bad belly for the majority of the holiday and twice being served raw egg on the omelette station not acceptable so like I said earlier regarding the drinks same applied with the food we purchased food and drink from outside the hotel and within 2 days was feeling a lot better.   The cleanliness of the hotel was good plenty of bins etc and the rooms were cleaned regularly until we had a severe issue and this is why I'm writing this review as I have never ever had this issue anywhere in the world and you always have to trust where your staying and I've been to many places . My brand new after shave £50s worth purchased from the airport was emptied and replaced only half way which is laughable back up with water hence how I noticed something was up . My issue besides the theft which can only be the cleaners was the joke of management saying I done it I spilt it . Absolute nonsense and this was relayed back to me twice . Not even a sorry not even an apology and basically calling me a liar !!! I gave up after 2 days as I knew this was going one way only . ( Pathetic) So the one star is all this hotel gets as this totally ruined our experience and as reviews are supposed to outline what the hotel is really like as that's why I read them I hope people understand what I'm saying . If my wedding ring or something of real importance was stolen under no circumstances are they doing anything about it so stay well clear of this place in that regard . If that personal experience didn't happen it would only be a 3 star review as outlined with previous information .",
      "title": "SHOCKING",
      "trip_type": "Couples",
      "travel_date": "2023-11-30",
      "user": {
        "username": "LiamW966",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f2/11/default-avatar-2020-23.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f2/11/default-avatar-2020-23.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f2/11/default-avatar-2020-23.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f2/11/default-avatar-2020-23.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f2/11/default-avatar-2020-23.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
          "value": 2,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 923832090,
      "lang": "en",
      "location_id": 889766,
      "published_date": "2023-10-31T12:15:33Z",
      "rating": 5,
      "helpful_votes": 2,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d889766-r923832090-Reviews-Oriental_Rivoli_Hotel_Spa-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review923832090",
      "text": "Fantastic resort, Ramadan Ahmed,, the great chef World Pastry, exceptional potato dumplings with a spectacular oriental sauce,. Thanks to resort manager Aman Elhawary.Exceptional manager who runs the resort wonderfully",
      "title": "Culture mix, exceptional management by the director and the spectacular cuisine of Wael Pastry",
      "trip_type": "Business",
      "travel_date": "2023-10-31",
      "user": {
        "username": "75antonio75",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e8/ea/default-avatar-2020-63.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e8/ea/default-avatar-2020-63.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e8/ea/default-avatar-2020-63.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e8/ea/default-avatar-2020-63.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e8/ea/default-avatar-2020-63.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 922452272,
      "lang": "en",
      "location_id": 889766,
      "published_date": "2023-10-22T11:54:55Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d889766-r922452272-Reviews-Oriental_Rivoli_Hotel_Spa-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review922452272",
      "text": "We transferred to here-(@our own cost)-having initially chosen a dreadful hotel for our holiday…and my goodness were we pleased we changed to the Oriental Rivoli…!!…superb hotel, very friendly staff-especially Ghallab on the front desk…all staff were charming and helpful…my favourite staff member being the guy on security outside the hotel…!!…there are 3 pools to choose from and you can either bask in the sun or laze in the shade, always plenty of loungers and umbrellas…the beach that belongs to the hotel is amazing, the sea and fish are a sight to behold…there’s a friendly bar where you can get drinks and food-(even if you are AI you still have to pay unfortunately, but it’s very cheap, huge pizza and chips, enough for 2 and 4 cans of pop approx €15)-we enjoyed this hotel so much and are already going back in January…❤️🇪🇬❤️",
      "title": "Fantastic hotel ❤️",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "Moo474",
        "user_location": {
          "id": "1069784",
          "name": "Royston, Hertfordshire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/26/66/4e/a5/amanda-l.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/26/66/4e/a5/amanda-l.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/26/66/4e/a5/amanda-l.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/26/66/4e/a5/amanda-l.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/26/66/4e/a5/amanda-l.jpg"
        }
      },
      "subratings": {}
    }
  ]
}