{
  "data": [
    {
      "id": 925782182,
      "lang": "en",
      "location_id": 9865057,
      "published_date": "2023-11-13T16:11:19Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1467782-d9865057-r925782182-Reviews-Titanic_Luxury_Collection_Bodrum-Guvercinlik_Bodrum_District_Mugla_Province_Turkish_A.html?m=66827#review925782182",
      "text": "We stayed at Titanic in October. It was our first trip with our newborn baby and I don't think we could have chosen better!\n\nThe hotel itself is very compact, albeit with escalators to get you about. This was very handy when with a newborn, as you can reach the other end of the resort in no more than a few mins walk. It was towards the end of the season so there were plenty of sunbeds at both the pool and beach. \n\nBooking a la cartes is usually a pain at most all inclusives, but it was actually pretty simple here via the WhatsApp concierge. We had Aiya and Lola look after us, and they were always extremely friendly and helpful, thanks again to you both!\n\nThe facilities were really top end, with perhaps our only slight disappointment being that a) the kids pool wasn't heated, so we couldn't take our baby (although the indoor pool more than made up for it) and b) the music from the beach could be heard throughout the resort until 1am. With the doors closed it wasn't much of a problem though, but I would recommend families with small children asking for a room further away. \n\nThe restaurants and bars were all very good, serving good food and decent drinks (including proper cocktails). Even the coffee bar was decent, which usually at these types of resorts isn't a given. \n\nThe staff there left the biggest impression though. There are too many to name them all but, beyond Aiya and Lola, we were really thankful for Gorkem, Marya, Burak and Marat who we saw several times throughout the week and were always very friendly. \n\nThanks to everyone at Titanic for a great stay, we'll surely be back in the future. ",
      "title": "Great facilities and very friendly staff",
      "trip_type": "Family",
      "travel_date": "2023-11-30",
      "user": {
        "username": "choppalot",
        "user_location": {
          "id": "503869",
          "name": "Hemel Hempstead, Hertfordshire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e2/e6/default-avatar-2020-45.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e2/e6/default-avatar-2020-45.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e2/e6/default-avatar-2020-45.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e2/e6/default-avatar-2020-45.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e2/e6/default-avatar-2020-45.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 926642394,
        "title": "Owner response",
        "text": "Dear Jim,\n\nThank you so much for choosing Titanic Luxury Collection Bodrum for your October stay, and for taking the time to share such a detailed and positive review of your experience with us. We are delighted to hear that you enjoyed your time with us, especially during this special trip with your newborn baby.\n\nWe're thrilled to know that our compact layout, equipped with escalators, made navigating the resort convenient for you, especially with a newborn. Your kind words about the assistance provided by Aiya and Lola are truly appreciated. We will make sure to pass on your gratitude to them.\n\nIt warms our hearts to hear that you found our facilities to be top-notch, and we take note of your feedback about the kids' pool and the beach music. Your insights are valuable, and we will certainly consider them for future improvements.\n\nWe are also glad that you enjoyed our restaurants and bars, and that the staff, including Gorkem, Marya, Burak, and Marat, made a positive impression on you. We believe that our team is the heart of our hospitality, and it's wonderful to see their efforts recognized.\n\nThank you once again for your kind words and for choosing Titanic Luxury Collection Bodrum. We look forward to the pleasure of welcoming you and your family back in the future. \n\nKind regards,\nGuest Relations Management",
        "lang": "en",
        "author": "Titanic Luxury Collection Bodrum",
        "published_date": "2023-11-20T06:17:16Z"
      }
    },
    {
      "id": 924540303,
      "lang": "en",
      "location_id": 9865057,
      "published_date": "2023-11-04T12:17:33Z",
      "rating": 5,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1467782-d9865057-r924540303-Reviews-Titanic_Luxury_Collection_Bodrum-Guvercinlik_Bodrum_District_Mugla_Province_Turkish_A.html?m=66827#review924540303",
      "text": "Nice experience for me and my son. Luxury hotel, excellent service, good and  diverse cuisine. Professional assistant Aya was kind and helpful all the time. Big and interesting kids and teenagers club, a lot of activities. Thanks a lot! ",
      "title": "Wonderful holidays",
      "trip_type": "Family",
      "travel_date": "2023-11-30",
      "user": {
        "username": "_J9503UG",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/eb/a3/default-avatar-2020-38.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/eb/a3/default-avatar-2020-38.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/eb/a3/default-avatar-2020-38.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/eb/a3/default-avatar-2020-38.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/eb/a3/default-avatar-2020-38.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 926631119,
        "title": "Owner response",
        "text": "Dear Natalia,\n\nThank you for taking the time to share your wonderful experience at Titanic Luxury Collection Bodrum on TripAdvisor. We are thrilled to hear that you and your son had a nice and enjoyable stay.\n\nIt warms our hearts to know that you found our hotel to be a luxurious haven and that our service exceeded your expectations. We are particularly delighted that Aiya, our professional assistant, made a positive impact on your experience with her kindness and helpfulness. We will be sure to pass on your kind words to Aiya.\n\nYour appreciation for our diverse cuisine and the excellence of our service is truly gratifying. We are committed to providing a memorable and delightful stay for our guests, and it's rewarding to know that we achieved that for you and your son.\n\nWe're pleased to hear that the kids and teenagers club, along with the various activities, added to the overall enjoyment of your stay. Creating memorable experiences for families is at the heart of what we do, and it sounds like we succeeded in making your time with us special.\n\nOnce again, thank you for choosing Titanic Luxury Collection Bodrum. We look forward to the opportunity of welcoming you and your family back for another exceptional stay in the future.\n\nKind regards,\nGuest Relations Management",
        "lang": "en",
        "author": "Titanic Luxury Collection Bodrum",
        "published_date": "2023-11-20T04:34:10Z"
      }
    },
    {
      "id": 924525598,
      "lang": "en",
      "location_id": 9865057,
      "published_date": "2023-11-04T10:06:58Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1467782-d9865057-r924525598-Reviews-Titanic_Luxury_Collection_Bodrum-Guvercinlik_Bodrum_District_Mugla_Province_Turkish_A.html?m=66827#review924525598",
      "text": "From start to finish our stay here was fantastic.\n\nThe personal assistants Aayia and Lola, we’re very happy to go above and beyond for us with any requests we had. What an amazing service to offer and clearly well trained passionate and happy staff. \n\nGrounds are beautiful, although the hotel has lots going on and busy with guests, our room and grounds of the resort is incredibly peaceful! An oasis. \n\nChildrens facilities kikoa club, wow.  Unique rooms and amazing equipment all enclosed and included. Lovely friendly staff. The only thing I’d like to see improve here is that parents can enter the building without distinguishing who they are, meaning a non parent maybe able to gain entry to where parent are leaving their children. I assume this will be looked into and covered for next season.\n\nThe spa and the spa pool/facilities are beautiful and the warm pool of 32deg is amazing. It’s half indoor and halo out door. The juice bar and coffee shops are perfect extras.\n\nRestaurants, the main buffet restaurant service is fab and the food is delicious. Delivered to a high standard and much prefer to be served the food as opposed to scoop it my self. \n\nAl a carte have a plentiful and easy booking system and most are inclusive of your package. The few that aren’t operate a £30 per adult charge and kids under 6 eat free. Cannot fault the cleanliness or efficiency of the staff.\n\nFrom a regular traveler with children aged 1- 13 this place has it all. It’s well managed and completely lovely to go somewhere and feel like your on holiday from start to finish and the staff be on hand for any request you may need ! \n\nThank you again so much especially to our PAs who were amazing. \nWe will be back.\n\nAlso the qr ordering- super easy and super helpful.",
      "title": "Just wow",
      "trip_type": "Family",
      "travel_date": "2023-10-31",
      "user": {
        "username": "GGDL",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/df/99/default-avatar-2020-40.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/df/99/default-avatar-2020-40.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/df/99/default-avatar-2020-40.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/df/99/default-avatar-2020-40.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/df/99/default-avatar-2020-40.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 926643846,
        "title": "Owner response",
        "text": "Dear Family Lauri,\n\nThank you for taking the time to share such an incredible review of your recent stay at Titanic Luxury Collection Bodrum. We are absolutely delighted to hear about your fantastic experience from start to finish, and we sincerely appreciate your kind words.\n\nAiya and Lola are overjoyed to have made a positive impact on your stay. We are indeed fortunate to have such dedicated and passionate team members who go above and beyond to ensure our guests feel well taken care of.\n\nYour compliments about our grounds, the peaceful atmosphere, and the Kikoa Club for children bring smiles to our faces. We are delighted that you found our spa and pool facilities, as well as the dining options, to be exceptional. Your feedback about the buffet restaurant, a la carte options, the cleanliness and efficiency of our staff is truly appreciated.\n\nYour kind words about our staff's dedication to making your holiday memorable mean the world to us. We understand that travel with children can have its challenges, and we are thrilled to have been able to provide a seamless and enjoyable experience for your family.\n\nWe are also glad to hear that you found our QR ordering system convenient and helpful in making your stay even more enjoyable.\n\nThank you once again for choosing Titanic Luxury Collection Bodrum. It was a pleasure hosting you and your family, and we look forward to welcoming you back for another exceptional experience in the future.\n\nKind regards,\nGuest Relations Management",
        "lang": "en",
        "author": "Titanic Luxury Collection Bodrum",
        "published_date": "2023-11-20T06:31:15Z"
      }
    },
    {
      "id": 923810680,
      "lang": "en",
      "location_id": 9865057,
      "published_date": "2023-10-31T09:41:27Z",
      "rating": 5,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1467782-d9865057-r923810680-Reviews-Titanic_Luxury_Collection_Bodrum-Guvercinlik_Bodrum_District_Mugla_Province_Turkish_A.html?m=66827#review923810680",
      "text": "I've spent very relaxing days with my little daughter age in this luxury All Inclusive Hotel. I am not a big fan of AI-concepts and it was the first time in Turkey after avoiding it for quite some years after so many people opposing the regime where imprisoned.\n\nMy experience was great. Everything was spotlessy clean, great food, fantastic a la carte restaurants, great system of guest relations (personal concierge service via whats app, ordering drinks & food via whats app, getting help with all questions via whats app). The Spa is amazing and we found our mother-daughter heaven to relax.\n\nI'm a mother of 4. Never ever did any of my children spend time in a kids club voluntarely. The Kids Club Team of Titanic Luxury Collection broke ground for a new experience. It was a combination of the kids club design (it has EVERYTHING can can imagine, the atmosphere and the friendly team especially: Melis, Adema, Aigerim & Violetta. Little Laura loved it and so did I. We loved the bracelets design, the MiniDisco, the kids shows! The girls were lovely, very friendly and hat their arms wide open for the kids of all ages. I can really recommend this hotel for families with kids of ages up to 15. I guess we will return if the hotel matches this years price for our stay.\n\nLet me also give 2 recommendations for the management and the technician:\n\n1) The children splash pool with the colorful waterslides is standing under a constant rain of chilling cold water. The area with the slides and steps looks beautiful/ inviting but children don't like to be sprayed with ice-cold water from above constantly. It scares them, sprays into their eyes and they get so cold. While I was there, 98% of the children only cllimbed this children splash pool area AFTER the water pump was switched out at 12.30 & 17.00.  Please, especially in the shoulder season: try to find a solution to water the 3 coloured slides without the constant flush of water from above (maybe by blocking hoses/pipes/ drains). And a temperature of 29 degrees for the splash pool instead of 25/26 would also be a great improvement!\n\n2) Noise at the beach is a little problem, I suggest to talk to Lujo Hotel and to both agree on 2 hours of peace without the noise of motor speed boats from 2-4. The loud beach club music at 4 pm is 1 hour too early in my eyes. People where forced to listen/to escape  but seeing from their expressions didn't like it, Hotel guests where mainly 55+ or families with children under 6 - this is not the target group for techno music and club sounds, especially not so noisy. :-)",
      "title": "Great experience - 100% of luxury, 100% of service - few recommendations",
      "trip_type": "Family",
      "travel_date": "2023-10-31",
      "user": {
        "username": "Resort06223738938",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/7c/01/default-avatar-2020-5.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/7c/01/default-avatar-2020-5.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/7c/01/default-avatar-2020-5.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/7c/01/default-avatar-2020-5.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/7c/01/default-avatar-2020-5.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 923910243,
        "title": "Owner response",
        "text": "Dear Valued Guest,\n\nThank you for taking the time to share your detailed and insightful feedback regarding your recent stay at Titanic Luxury Collection Bodrum. We truly appreciate your kind words and suggestions, as they are invaluable to us in our ongoing efforts to provide the best experience for our guests.\n\nWe are delighted to hear that you had a fantastic and relaxing time with your little daughter at our All-Inclusive Hotel. We're glad that we were able to exceed your expectations in every aspect, from cleanliness to food and service.\n\nThank you for appreciating the convenience of the Guest Assistant service. Our aim is to make our guests' stay as seamless and enjoyable as possible.\n\nWe are especially grateful for your kind words about our Kids Club team, the design of the club, and the experiences provided for children. Melis, Adema, Aigerim, and Violetta are indeed wonderful members of our team, and your recognition of their efforts is heartwarming.\n\nYour recommendations regarding the children's splash pool are noted, and we will explore ways to improve the water experience for our little guests, especially during the shoulder season. Your suggestion to address the issue of noise at the beach with our neighboring hotel is also appreciated, and we will certainly consider how to make the environment more peaceful and enjoyable for our guests.\n\nYour detailed feedback is invaluable, and we hope to welcome you and your family back to Titanic Luxury Collection Bodrum in the future. Thank you for choosing to stay with us, and we look forward to creating more wonderful memories with you.\n\nKind regards,\nGuest Relations Management",
        "lang": "en",
        "author": "Titanic Luxury Collection Bodrum",
        "published_date": "2023-11-01T03:03:16Z"
      }
    },
    {
      "id": 923793303,
      "lang": "en",
      "location_id": 9865057,
      "published_date": "2023-10-31T07:45:49Z",
      "rating": 5,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1467782-d9865057-r923793303-Reviews-Titanic_Luxury_Collection_Bodrum-Guvercinlik_Bodrum_District_Mugla_Province_Turkish_A.html?m=66827#review923793303",
      "text": "Wow, Wow, Wow! \n3 friends celebrating my 60th birthday. The hotel is beautiful and the setting is stunning. Just 20 mins from Bodrum Airport. Our room was a family Deluxe. 2 bedrooms, 2 bathrooms, a lounge and huge balcony. \nYou have a WhatsApp chat with an assistant who is at your service all day. They deal with all your requests and book restaurants including a shuttle service to anywhere in the resort if you prefer. I have only experienced that level of service on a cruise, and this service is for everyone staying at the Titanic.  We tried every restaurant Inc the Steak and Japanese which carry €30 supplement but well worth it. One highlight was sat on your luxury sunbed at the beach and scanning the bar code on the umbrella, ordering your drink and nibbles and it arriving directly to you within minutes. \nWe are planning another visit next year as the weather in October was fabulous.",
      "title": "Wow, Wow, Wow",
      "trip_type": "Friends getaway",
      "travel_date": "2023-10-31",
      "user": {
        "username": "927suziep",
        "user_location": {
          "id": "255060",
          "name": "Sydney, New South Wales"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e2/e6/default-avatar-2020-45.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e2/e6/default-avatar-2020-45.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e2/e6/default-avatar-2020-45.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e2/e6/default-avatar-2020-45.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e2/e6/default-avatar-2020-45.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 923908870,
        "title": "Owner response",
        "text": "Dear Suzie,\n\nWe're absolutely delighted to receive your enthusiastic feedback and learn that you had such an incredible time celebrating your 60th birthday at Titanic Luxury Collection Bodrum. Thank you for choosing our resort for this special occasion.\n\nWe're delighted to hear that you found the hotel and its setting beautiful and stunning. The convenience of being just 20 minutes away from Bodrum Airport certainly adds to the appeal of our location. We're pleased that Family Deluxe Room provided you with the perfect accommodation for your celebration.\n\nOur WhatsApp chat service with a personal assistant is designed to make your stay as seamless and enjoyable as possible, and we're glad to know that it exceeded your expectations. Whether it's handling your requests or assisting with restaurant bookings and shuttle services, we aim to provide a level of service that rivals the best cruise experiences.\n\nIt's wonderful to hear that you had the opportunity to explore and enjoy all of our restaurants, including the Steak and Japanese options. Your positive feedback about these dining experiences is greatly appreciated.\n\nThe beachside service with the barcode system for ordering drinks and snacks is a unique feature that many of our guests love, and we're glad you found it convenient.\n\nThank you for sharing your amazing experience with us. We look forward to creating more memorable moments for you in the future.\n\nKind regards,\nGuest Relations Management",
        "lang": "en",
        "author": "Titanic Luxury Collection Bodrum",
        "published_date": "2023-11-01T02:49:58Z"
      }
    }
  ]
}