{
  "data": [
    {
      "id": 945539246,
      "lang": "en",
      "location_id": 1049226,
      "published_date": "2024-04-06T04:49:53Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297549-d1049226-r945539246-Reviews-Steigenberger_Aqua_Magic-Hurghada_Red_Sea_and_Sinai.html?m=66827#review945539246",
      "text": "Miss Titanic 2024 \nRoom no 3091\n\nMohammed (reservation) was very kind and took complete care of us. He helped us with last minute reservations at the restaurants and it was absolutely fantastic. He is fantastic 😊 and we loved the food at the restaurants.",
      "title": "Mohammed reservation is fab☺️",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "sonalin493",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e4/59/default-avatar-2020-49.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e4/59/default-avatar-2020-49.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e4/59/default-avatar-2020-49.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e4/59/default-avatar-2020-49.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e4/59/default-avatar-2020-49.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 945667570,
        "title": "Owner response",
        "text": "Dear Guest, \nThank you so much for taking the time to share your excellent review about your recent stay with us. \nIt was a sheer delight to read your positive words about our hotel. Further, we wish to thank you for your lovely feedback about \nMohammed. We will be happy to share your review with him.\nThe entire Team is looking forward in welcoming you back in the future.\nWith kindest regards,\nSteigenberger Aqua Magic Team\n",
        "lang": "en",
        "author": "Guest Relation",
        "published_date": "2024-04-07T05:06:03Z"
      }
    },
    {
      "id": 945228126,
      "lang": "en",
      "location_id": 1049226,
      "published_date": "2024-04-03T12:10:06Z",
      "rating": 2,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297549-d1049226-r945228126-Reviews-Steigenberger_Aqua_Magic-Hurghada_Red_Sea_and_Sinai.html?m=66827#review945228126",
      "text": "- Sunfactor had booked an extra night than necessary since departure from the hotel was at 10:55 PM, and we therefore did NOT need to stay another night. A waste of money.\n\n- There were problems already at check-in as the hotel said the trip was booked through Masters Travel Service in England (which was probably booked by Espaceaway/Sunfactor) and we were registered as English guests, for which different prices applied than if we were Danish guests. How is that even legal? Not the best way to start a 5-star vacation. However, the next day they took pity on us, and we were allowed to stay at the hotel without extra payment.\n\n- It was nearly impossible to get even one sun lounger before breakfast, and ALL the hotel's towels had already been lent out, so they couldn't provide any for several days. It's almost like having bought access to a buffet but the restaurant has no more cutlery.\n\n- Smoking was allowed almost everywhere outside - really disgusting, not least for our children.\n\n- The main restaurant was packed, and there was an insane amount of noise, not least because of the really bad acoustics.\n\n- The waiters kept walking around asking if one could exchange their euro coins for Egyptian pounds. Really inappropriate to constantly disturb guests with these problems.\n\n- The waiters did not hold back when you walked by with your family - they definitely always thought they had right of way. At a \"5-star\" hotel?\n\n- A waiter demanded a review from us on Google Maps while making sure we gave the hotel 5 stars. Really inappropriate - and that review was of course deleted later.\n\n- The WiFi was incredibly bad, really slow, and at the pool, there was no signal at all.\n\n- The \"associated\" beach is about 700 meters away, so you have to walk there in the scorching heat, if you can bear it.\n\n- There were incredibly strict rules about what was allowed and not allowed on the water slides. Some required wearing a t-shirt, others did not; some required a glide mat, others did not. None of this was naturally described but was explained by a snarky and cheeky lifeguard.\n\n- They CONSTANTLY whistled in their lifeguard whistles at both the bathers and each other, greatly annoying EVERYONE who was just nearby the pool trying to relax on their vacation.\n\n- The air conditioning in the room did not work, the minibar was only refilled when you \"bribed\" the maids, and the remote control had no batteries.\n\n- Tobacco smoke wafted up and into our suite from the room below.\n\n- The hotel's associated nightclub played very loud music until 2 AM, greatly annoying all the surrounding rooms.\n\n- One of us got, of course, a 5-star stomach upset and had to spend the last few days in the room.\n\n- The hotel's kiosk does not operate with visible prices, and you know you're being ripped off both by the tourist prices and their exchange rate.",
      "title": "Save your money for somewhere else",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "anchorpoint2002",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f4/5d/default-avatar-2020-32.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f4/5d/default-avatar-2020-32.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f4/5d/default-avatar-2020-32.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f4/5d/default-avatar-2020-32.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f4/5d/default-avatar-2020-32.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
          "value": 2,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 945438779,
        "title": "Owner response",
        "text": "Dear guest, \nThank you for sharing your feedback with us, it is our priority to satisfy our guests, to respect their wishes and to keep our hotel service and hospitality according to the Steigenberger standards. We apologize for the experience you had during your stay so far. Please be assured that we will take your feedback very seriously and passed onto the responsible management. This gives us the opportunity to check and improve our service. \nRegarding your Check-In kindly be informed that we already spoke to our front office manager. Actually the reservation we received was from a completely different market segmentation as the booking we received from your tour operator. As a courtesy from our side, we fixed that directly.\n\nPlease notice that many sunbeds and towels are consistently occupied due to high demand. However, our recreation team is always assisting to find a place or sunbed, so please do not hesitate to contact our recreation team. They are always around in the pool area and very happy to help our guests to enjoy a lovely day. \n\nAccording to our hotel policy it is not allowed to smoke in the guest rooms as well as inside our dining areas.\n\nCertainly we do regret that your impression concerning our staff attitude was not like expected. Every guest deserves nothing less than a friendly, fast and positive attitude at all times and in all circumstances. This is the absolute minimum that we expect from our team and is a core part of the training that our personnel receive.\n\nTo make the way to the beach in the heat more pleasant for our guests, our golf car regularly drives our guests to the beach. We would be delighted if you would take advantage of this service. If you have any questions, we will be happy to assist you at any time.\n\nFurthermore, we would like to inform you that our engineering team could already fix the Air Condition and remote control in your room as well as our housekeeping refilled your minibar again. \nConcerning our hotel’s kiosk, we kindly ask you to give as more detailed information which exact kiosk you have visited so we can follow up with them as they are operating here as third party.\n\nPlease accept our sincere apologies for the inconveniences. We are always looking for ways to improve our customer experience as your satisfaction is very important to us and we try hard to make sure all of our guests have a great stay. If there is anything we can do for you to feel more comfortable and to fully satisfy you, please do not hesitate to contact us directly in our hotel. We are looking forward to you and wish you a wonderful vacation with us.\nWith best wishes,\nOliver Kurscheid – General Manager\n",
        "lang": "en",
        "author": "Guest Relation",
        "published_date": "2024-04-05T08:05:13Z"
      }
    },
    {
      "id": 944250282,
      "lang": "en",
      "location_id": 1049226,
      "published_date": "2024-03-28T09:10:52Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297549-d1049226-r944250282-Reviews-Steigenberger_Aqua_Magic-Hurghada_Red_Sea_and_Sinai.html?m=66827#review944250282",
      "text": "first of all, I would like to thank  the hotel managers because they choose the right person to handle every single request from the Guest. I am really happy that I see Karim 👨‍👦 from the reception who is taking very good care of us we feel At The Hotel like we are in our home because of this man and really if I come one time again to the hotel will be the main point is to see this beautiful Karim 👨‍👦 again, who did everything and organise everything for me and my wife was my best honeymoon ever  from the moment we arrived till we leave about the for us who help us who assist everything for us until we leave the hotel thank you again Karim for your kindness and helping us was a very vacation 🙏",
      "title": "Thank you 🙏 steigenberger ❤️",
      "trip_type": "Couples",
      "travel_date": "2024-03-31",
      "user": {
        "username": "B7677axii",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f1/42/default-avatar-2020-20.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 944488209,
        "title": "Owner response",
        "text": "Dear Guest,\n\nThank you for your excellent review – it was a sheer delight to read your positive words about our hotel. Further, we wish to thank you for your lovely feedback about Mr. Karim.\nWe will be happy to share your review with him.\n\nIt also makes us proud to read your positive words about our “SKY Restaurant”. We will be happy to share your review with the staff members.\n\nIt has been our pleasure to serve you and we are looking forward in welcoming you on your next time \n\nBest regards,\nSteigenberger Aqua Magic Team\n",
        "lang": "en",
        "author": "Guest Relation",
        "published_date": "2024-03-30T06:35:32Z"
      }
    },
    {
      "id": 944194962,
      "lang": "en",
      "location_id": 1049226,
      "published_date": "2024-03-27T20:23:56Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297549-d1049226-r944194962-Reviews-Steigenberger_Aqua_Magic-Hurghada_Red_Sea_and_Sinai.html?m=66827#review944194962",
      "text": "Having just returned from 10 days away at Steigenberger Aqua Magic I can honestly say that this is the BEST all inclusive hotel we have ever stayed at. So much to do for children with the water slides, pool areas and activities throughout the day as well as an adult only pool on the roof top and spa. The private beach is also beautiful. There’s an excellent choice of places to eat and drink for breakfast, lunch and dinner and we particularly liked that you could eat lunch at either the buffet, Italian or beach restaurant which makes a change to most hotels where you only have the option of buffet. We ate at all three a la cartes during our stay but have to say that the magic sky restaurant was our favourite. The fillet steak was delicious and cooked exactly how I asked for it. The hotel was very clean and well maintained throughout with plenty of staff onsite. All the staff were very friendly and helpful. Our only gripe is that we weren’t staying for longer. This hotel really does tick all the boxes and we certainly hope to return.",
      "title": "Fabulous holiday at Steigenberger aqua magic",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "R3855NEzoec",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e2/4a/default-avatar-2020-42.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e2/4a/default-avatar-2020-42.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e2/4a/default-avatar-2020-42.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e2/4a/default-avatar-2020-42.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e2/4a/default-avatar-2020-42.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 944233097,
        "title": "Owner response",
        "text": "Dear Guest,\n\nThank you for your excellent review – it was a sheer delight to read your positive words about our hotel. Further, we wish to thank you for your lovely feedback about our staff. We will be happy to share your review with them.\n\nIt also makes us proud to read your positive words about our “SKY Restaurant”. We will be happy to share your review with the staff members.\n\nIt has been our pleasure to serve you and we are looking forward in welcoming you on your next time \n\nBest regards,\nSteigenberger Aqua Magic Team\n",
        "lang": "en",
        "author": "Guest Relation",
        "published_date": "2024-03-28T06:14:37Z"
      }
    },
    {
      "id": 943884919,
      "lang": "en",
      "location_id": 1049226,
      "published_date": "2024-03-26T09:20:33Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297549-d1049226-r943884919-Reviews-Steigenberger_Aqua_Magic-Hurghada_Red_Sea_and_Sinai.html?m=66827#review943884919",
      "text": "Amazing hotel and THE MAGIC carries through to the staff.\nBooked 10 days through love holidays. Two 50 something friends.\nGreeted by MTS at the airport, 10 minute transfer to the hotel ( plane noise no issue despite being close.)\nReception staff very welcoming. Special mention to Gerges, Mahran and Ahmed Safwat who were fabulous and helped with any query we had going above and beyond every time.\nMain restaurant is busy but good varied food and special mention to Yasser who beamed from morning to night. \nA la carte restaurants were superb, especially Palappas, special mention to Keralos and his flambee lobster.\nSky restaurant was a beautiful rooftop setting. Samir Sabry and Mamdouh Ahmed made it so special. King prawns and brûlée particular favourites.\nReception bar light and airy and Yousef Sabry a joy to see. \nHousekeeping great, very clean room, pools and communal areas, beautiful gardens on the short stroll to the lovely beach with free pedals and canoes and beach bar with restaurant all included.\nPool attendants find you the best beds and set everything up for you, moving sunshades as the sun moves around! Mohktar and Mohammed Sayed were particularly helpful. Unlimited cocktails brought to your subbed. Don’t be put off by thinking it’s only for families. The rooftop relax pool is so quiet and the lazy river great for a float around the complex. \nAll in all, these people really want you to have the best time ever and therefore, thanks to them, we did. Thankyou everyone. Alex and Nicky. Somerset, UK.",
      "title": "Five star all the way!",
      "trip_type": "Friends getaway",
      "travel_date": "2024-03-31",
      "user": {
        "username": "Youngie1810",
        "user_location": {
          "id": "190730",
          "name": "Taunton, Somerset, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e4/2d/default-avatar-2020-48.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e4/2d/default-avatar-2020-48.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e4/2d/default-avatar-2020-48.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e4/2d/default-avatar-2020-48.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e4/2d/default-avatar-2020-48.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 944102528,
        "title": "Owner response",
        "text": "Dear Guest,\n\nThank you for your excellent review – it was a sheer delight to read your positive words about our hotel. Further, we wish to thank you for your lovely feedback about our staff. We will be happy to share your review with them.\nIt has been our pleasure to serve you and we are looking forward in welcoming you on your next time \n\nBest regards.\nSteigenberger Aqua Magic Team\n",
        "lang": "en",
        "author": "Guest Relation",
        "published_date": "2024-03-27T07:45:44Z"
      }
    }
  ]
}