{
  "data": [
    {
      "id": 942662983,
      "lang": "en",
      "location_id": 1079054,
      "published_date": "2024-03-17T13:43:03Z",
      "rating": 3,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d1079054-r942662983-Reviews-Ascott_Park_Place_Dubai-Dubai_Emirate_of_Dubai.html?m=66827#review942662983",
      "text": "We've stayed at the Ascott in Bangkok and Jakarta in the past and were really impressed with the quality of everything from the premises, the staff to the facilities provided. This encouraged us to try out the Ascott in Dubai. I have to say, it was nothing like the SEAsian Ascotts. There was nothing similar. It's like they are okay with having different standards in different regions. Definitely not considering staying here in the future.",
      "title": "Sadly, very disappointing ",
      "trip_type": "Couples",
      "travel_date": "2024-03-31",
      "user": {
        "username": "ShoaibMotiwala",
        "user_location": {
          "id": "295414",
          "name": "Karachi, Sindh Province"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f4/20/default-avatar-2020-31.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f4/20/default-avatar-2020-31.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f4/20/default-avatar-2020-31.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f4/20/default-avatar-2020-31.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f4/20/default-avatar-2020-31.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 945783890,
        "title": "Owner response",
        "text": "Dear ShoaibMotiwala,\n\nThank you for taking the time to share your feedback with us following your recent stay at Ascott Park Place Dubai. We sincerely apologize that your experience did not meet the high standards you have come to expect from Ascott properties, particularly based on your positive experiences at Ascott locations in Bangkok and Jakarta.\n\nWe understand your disappointment and frustration, and we regret that we fell short of providing you with a comparable experience during your stay in Dubai. Maintaining consistent standards across all our properties worldwide is paramount to us, and we are disappointed to hear that we did not meet your expectations in this regard.\n\nYour feedback is invaluable to us as it helps us identify areas for improvement, and we will be sure to review our processes and standards to ensure greater consistency and alignment across all our properties.\n\nWe sincerely hope that you will reconsider and give us another opportunity to demonstrate the level of service and quality that you have come to expect from Ascott. Should you decide to return, please do not hesitate to reach out to us directly, and we will do our utmost to ensure that your next stay exceeds your expectations.\n\nOnce again, we apologize for any inconvenience caused and appreciate your loyalty to the Ascott brand. Thank you for bringing this matter to our attention, and we hope to have the chance to welcome you back in the future.\n\nWarm regards,\n\nMarinela ILAGAN",
        "lang": "en",
        "author": "Marinela Ilagan",
        "published_date": "2024-04-08T01:37:37Z"
      }
    },
    {
      "id": 939602554,
      "lang": "en",
      "location_id": 1079054,
      "published_date": "2024-02-24T10:28:52Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d1079054-r939602554-Reviews-Ascott_Park_Place_Dubai-Dubai_Emirate_of_Dubai.html?m=66827#review939602554",
      "text": "Just opposite the exhibition center, few minutes walk, great location. Nice apartments in good shape. Pool where the sun reaches the area after lunchtime. Perfect service from the reception 24/7. Possibilities to get breakfast at the restaurant just beside the residence.",
      "title": "Perfect location 3 min walk from the exhibition center",
      "trip_type": "Business",
      "travel_date": "2024-02-29",
      "user": {
        "username": "Anders333",
        "user_location": {
          "id": "189835",
          "name": "Ängelholm, Skane County"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ef/73/default-avatar-2020-13.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ef/73/default-avatar-2020-13.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ef/73/default-avatar-2020-13.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ef/73/default-avatar-2020-13.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ef/73/default-avatar-2020-13.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 945783961,
        "title": "Owner response",
        "text": "Dear Anders R,\n\nThank you for taking the time to share your positive feedback regarding your recent stay at Ascott Park Place Dubai. We are delighted to hear that you enjoyed various aspects of your stay with us.\n\nIt's wonderful to know that you found our location convenient, especially being just opposite the exhibition center and within walking distance. We understand the importance of a convenient location for our guests, and we're pleased that it added to the enjoyment of your stay.\n\nWe're also thrilled that you found the apartments to be comfortable and well-maintained. Providing a pleasant and comfortable environment for our guests is one of our top priorities, and we're glad that our accommodations met your expectations.\n\nFurthermore, we're delighted that you enjoyed our pool area and that you found the service provided by our reception team to be perfect. Our staff strives to deliver exceptional service to all our guests, and it's gratifying to hear that their efforts contributed positively to your experience.\n\nAdditionally, we're glad that you had the opportunity to enjoy breakfast at the restaurant next to the residence. We aim to provide a variety of dining options to cater to our guests' preferences, and we're pleased that you found this convenient.\n\nThank you once again for choosing Ascott Park Place Dubai for your stay, and for sharing your positive experience with us. We look forward to welcoming you back in the future. If there's anything else we can assist you with or if you have any further feedback to share, please don't hesitate to reach out.\n\nWarm regards,\n\nMarinela ILAGAN",
        "lang": "en",
        "author": "Marinela Ilagan",
        "published_date": "2024-04-08T01:38:55Z"
      }
    },
    {
      "id": 938879750,
      "lang": "en",
      "location_id": 1079054,
      "published_date": "2024-02-19T07:59:22Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d1079054-r938879750-Reviews-Ascott_Park_Place_Dubai-Dubai_Emirate_of_Dubai.html?m=66827#review938879750",
      "text": "The service and the facilities are top notch. I had a very comfortable stay and will definitely make Ascott Park place my regular choice when travelling to Dubai.\nThe housekeeping staff are always eager to assist with any needs\nThe front desk staff are super helpful in answering any local questions and eager to go out of their way to assist in anyway.",
      "title": "Great service and excellent facilities",
      "trip_type": "Family",
      "travel_date": "2024-02-29",
      "user": {
        "username": "rajshreer2019",
        "user_location": {
          "id": "295424",
          "name": "Dubai, Emirate of Dubai"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f1/06/default-avatar-2020-18.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f1/06/default-avatar-2020-18.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f1/06/default-avatar-2020-18.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f1/06/default-avatar-2020-18.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f1/06/default-avatar-2020-18.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 945784030,
        "title": "Owner response",
        "text": "Dear rajshreer2019,\n\nThank you so much for your wonderful feedback regarding your recent stay at Ascott Park Place Dubai. We are thrilled to hear that you had such a comfortable and enjoyable experience with us.\n\nIt's fantastic to know that you found our service and facilities to be top-notch. Providing our guests with a high standard of service and comfort is our utmost priority, and we're delighted that we were able to meet your expectations in this regard.\n\nWe're especially pleased to hear your kind words about our housekeeping staff. We strive to maintain a clean and welcoming environment for all our guests, and it's rewarding to know that our housekeeping team's efforts contributed positively to your stay.\n\nAdditionally, we're delighted that you found our front desk staff to be super helpful and eager to assist with any local questions or needs. Our team takes great pride in providing exceptional service and ensuring that our guests have a memorable experience during their time with us.\n\nWe are honored that you have chosen Ascott Park Place Dubai as your regular choice when traveling to Dubai, and we look forward to welcoming you back on your future visits. If there's anything else we can assist you with or if you have any further feedback to share, please don't hesitate to reach out.\n\nWarm regards,\n\nMarinela ILAGAN",
        "lang": "en",
        "author": "Marinela Ilagan",
        "published_date": "2024-04-08T01:40:17Z"
      }
    },
    {
      "id": 934860350,
      "lang": "en",
      "location_id": 1079054,
      "published_date": "2024-01-21T05:13:08Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d1079054-r934860350-Reviews-Ascott_Park_Place_Dubai-Dubai_Emirate_of_Dubai.html?m=66827#review934860350",
      "text": "I would like to express my sincere gratitude for the exceptional experience during my stay at your hotel. The apartment's elegance and meticulous maintenance truly stood out, creating a comfortable and welcoming environment. The level of cleanliness was impeccable, and I appreciated the attention to detail that contributed to a pristine atmosphere. Your commitment to providing such a high standard of hospitality did not go unnoticed, and it significantly enhanced my overall enjoyment. Thank you for ensuring a memorable and delightful stay.",
      "title": "First stay 2024",
      "trip_type": "Family",
      "travel_date": "2024-01-31",
      "user": {
        "username": "E5565ZNadela",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/10/6b/d7/6d/adel-a.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/10/6b/d7/6d/adel-a.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/10/6b/d7/6d/adel-a.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/10/6b/d7/6d/adel-a.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 935229300,
        "title": "Owner response",
        "text": "Dear Mr. Adel A,\n\nThank you so much for your heartfelt review and for choosing Ascott Park Place Dubai for your stay! We are thrilled to read about your exceptional experience and sincerely appreciate your kind words.\n\nIt's truly gratifying to know that you found our apartments elegant, meticulously maintained, and that you enjoyed the comfortable and welcoming environment we strive to create. Your acknowledgment of our commitment to high standards of cleanliness and attention to detail is deeply gratifying. We're delighted to have significantly contributed to enhancing your overall enjoyment during your stay.\n\nThank you for taking the time to share your positive thoughts with us. We look forward to welcoming you back for more memorable moments at Ascott Park Place Dubai.\n\nWarm regards,\n\nRandy Rosita",
        "lang": "en",
        "author": "Randy Rosita",
        "published_date": "2024-01-24T13:01:09Z"
      }
    },
    {
      "id": 934005430,
      "lang": "en",
      "location_id": 1079054,
      "published_date": "2024-01-14T09:44:45Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d1079054-r934005430-Reviews-Ascott_Park_Place_Dubai-Dubai_Emirate_of_Dubai.html?m=66827#review934005430",
      "text": "It's was a very memorable stay at ascot park place Dubai the staff at the reception are very professional they treat you like a family with a marm welcoming and the smiles it's makes you feel comfortable and they are always helpful when you need them  even for the smal things",
      "title": "Very thanks for all the staff especially Omar Allen Aslam Samir Mohamed randy sorry  I forget the others I can'remember.",
      "trip_type": "Business",
      "travel_date": "2023-12-31",
      "user": {
        "username": "900janakd",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e7/fe/default-avatar-2020-58.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e7/fe/default-avatar-2020-58.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e7/fe/default-avatar-2020-58.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e7/fe/default-avatar-2020-58.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e7/fe/default-avatar-2020-58.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 934776593,
        "title": "Owner response",
        "text": "Dear 900janakd,\n\nThank you so much for taking the time to share your wonderful feedback about your recent stay at Ascott Park Place Dubai. We truly appreciate your kind words and are delighted to hear that you had a memorable experience.\n\nOur team, especially Omar, Allen, Aslam, Samir, Mohamed, and the other team members, takes pride in providing exceptional service to our guests. We're thrilled to learn that their professionalism, warm welcoming, and genuine smiles contributed to making your stay comfortable. It's our goal to treat every guest like family, and we're glad to hear that you felt that warmth during your time with us.\n\nYour appreciation for the staff's helpfulness, even for the smallest things, means a lot to us. We strive to create a home away from home for our guests, and it's rewarding to know that we succeeded in making your stay special.\n\nWe look forward to welcoming you back to Ascott Park Place Dubai in the future. If there's anything specific you'd like to share or any suggestions you may have, feel free to reach out.\n\nWarm regards,\n\nRandy Rosita",
        "lang": "en",
        "author": "Randy Rosita",
        "published_date": "2024-01-20T09:49:19Z"
      }
    }
  ]
}