{
  "data": [
    {
      "id": 937563839,
      "lang": "en",
      "location_id": 1136585,
      "published_date": "2024-02-09T14:49:59Z",
      "rating": 1,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1175546-d1136585-r937563839-Reviews-Mitsis_Rodos_Village-Kiotari_Rhodes_Dodecanese_South_Aegean.html?m=66827#review937563839",
      "text": "Worst holiday ever. Staff were incredibly rude. Bars didn't open during opening times so couldn't get anything to drink, not even water until they opened 45 minutes late. Overcrowded, couldn't get loungers by the pool. Table service took forever (to get a coffee with breakfast) and once again staff where rude and ignored us when we asked for a coffee. The main pool always had a wierd smell like sewage, and the top pool occasionally has some slimy stuff floating on top which looked like vomit but not entirely sure. ",
      "title": "Terrible holiday. Staff are so rude. ",
      "trip_type": "Family",
      "travel_date": "2023-07-31",
      "user": {
        "username": "lisaandjono",
        "user_location": {
          "id": "186356",
          "name": "Nottingham, Nottinghamshire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e4/2d/default-avatar-2020-48.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e4/2d/default-avatar-2020-48.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e4/2d/default-avatar-2020-48.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e4/2d/default-avatar-2020-48.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e4/2d/default-avatar-2020-48.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 940513833,
        "title": "Owner response",
        "text": "Dear valued guest,\n\nWe sincerely apologize for the negative experiences you encountered during your stay at Mitsis Rodos Village. We deeply regret that the level of service and overall atmosphere did not meet your expectations, and we appreciate your feedback as it allows us to address and rectify the issues you've highlighted.\n\nOnce again, we apologize for the negative aspects of your stay, and we hope you will allow us the opportunity to make amends and provide you with a much-improved experience in the future. Your feedback is invaluable, and we appreciate your willingness to share it with us.\n\nWarm regards,\nMitsis Rodos Village",
        "lang": "en",
        "author": "EVANGELINOS EVANGELATOS",
        "published_date": "2024-03-02T03:46:19Z"
      }
    },
    {
      "id": 928084202,
      "lang": "en",
      "location_id": 1136585,
      "published_date": "2023-12-01T15:12:59Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1175546-d1136585-r928084202-Reviews-Mitsis_Rodos_Village-Kiotari_Rhodes_Dodecanese_South_Aegean.html?m=66827#review928084202",
      "text": "Nice hotel, with friendly staff and decent food. We went for a girls trip and enjoyed staying at the hotel and chilling!\n\nThe hotel is quite isolated so if you want to venture out will need to book excursions.",
      "title": "Nice, all inclusive girls trip",
      "trip_type": "Friends getaway",
      "travel_date": "2023-06-30",
      "user": {
        "username": "Mbison87",
        "user_location": {
          "id": "186338",
          "name": "London, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/2a/ec/bc/15/mbison87.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/2a/ec/bc/15/mbison87.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/2a/ec/bc/15/mbison87.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/2a/ec/bc/15/mbison87.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/2a/ec/bc/15/mbison87.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 940513610,
        "title": "Owner response",
        "text": "Dear valued guest, Thank you for taking the time to share your positive experience at Mitsis Rodos Village. We're thrilled to hear that you found our hotel to be a pleasant place for your girls' trip, enjoying the nice ambiance and friendly staff.\n\nIt's wonderful to know that you had a relaxing time chilling at the hotel. We appreciate your feedback on the food, and we're pleased to hear that it met your expectations. Our team strives to create a welcoming and enjoyable atmosphere for all our guests, and we're glad to hear that their efforts contributed to your positive experience.\n\nOnce again, we appreciate your kind words and are delighted that you chose Mitsis Rodos Village for your girls' trip. We hope to have the pleasure of hosting you again in the future.\n\nWarm regards,\nMitsis Rodos Village",
        "lang": "en",
        "author": "EVANGELINOS EVANGELATOS",
        "published_date": "2024-03-02T03:43:11Z"
      }
    },
    {
      "id": 924632943,
      "lang": "en",
      "location_id": 1136585,
      "published_date": "2023-11-05T06:25:28Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1175546-d1136585-r924632943-Reviews-Mitsis_Rodos_Village-Kiotari_Rhodes_Dodecanese_South_Aegean.html?m=66827#review924632943",
      "text": "We’ve just returned to Britain from Rhodes and the Rodos Village Hotel- a much anticipated first overseas trip as a family of four: children of nine and seven, my wife  and I. \n\nI can’t recommend Rodos Village highly enough, from the welcome we received as we arrived at 1am to the wonderful animation team led by Willy who provided excellent activities and evening entertainments (fire, magic and break-dancing shows) \n\nThe layout of the hotel is memorable, built into a rocky out-crop overlooking the beach at Kiotari. The landscape means that Rodos Village would be difficult for those with mobility limitations but the steep ascents are quite handy in burning off some calories acquired at the wonderful buffet restaurant. The restaurant does get busy but there is a fantastic variety of soups, salads, main courses and puddings. The staff are friendly and attentive and work so very hard. We ate in all the Al a carte restaurants (use the Mitsis hotels app to book these beforehand) and I would particularly recommend the Greek and Italian restaurants, up the hill, near the salt-water pool, delicious food and fantastic staff. \n\nWhen we visited the temperature ranged between 25 and 27 degrees Celsius which was perfect for an Autumn getaway. The hotel pools were quite cool but thanks to the roasting summer the sea was very warm and a great place to snorkel, feeding and viewing the local fish. The pizza oven and bar on the beach are excellent and helped transport us to states of utmost relaxation. There are water sports, volleyball and pétanque in case you get bored of swimming. \n\nWe hired a car for four days which proved to be a good call- we didn’t go far but the drive to the hill top acropolis at Lindos is well worth it and the natural beauty of the “Seven Springs” is also highly recommended. \n\nNow we are back home- we are so grateful for our ten days of Rhodes sunshine and hospitality. Thank you to everyone at the hotel for making this such a memorable holiday. I hope you all have a well deserved break at the end of a long and stressful season- you deserve it. My thoughts are with those locals whose homes have been decimated by the forest fires. \nIn summary, this hotel is designed for families and it succeeds mightily  in providing a safe, friendly and welcoming environment. I think some reviews of Rodos Village expect it to be something it is not (Mitsis have other hotels which cater for different demographics). \nWell done everyone involved.",
      "title": "A memorable family holiday",
      "trip_type": "Family",
      "travel_date": "2023-11-30",
      "user": {
        "username": "adamcO6536WB",
        "user_location": {
          "id": "186411",
          "name": "Leeds, West Yorkshire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f3/7c/default-avatar-2020-29.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f3/7c/default-avatar-2020-29.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f3/7c/default-avatar-2020-29.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f3/7c/default-avatar-2020-29.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f3/7c/default-avatar-2020-29.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 925835032,
        "title": "Owner response",
        "text": "Dear valued guest,\n\nThank you so much for sharing such a wonderful and detailed review of your recent stay at Mitsis Rodos Village! We are thrilled to hear about your fantastic experience as a family of four, and we appreciate you taking the time to highlight the aspects that made your holiday memorable.\n\nIt's heartening to know that the welcome you received, even at the late hour of 1 am, set a positive tone for your entire stay. We are delighted that you enjoyed the activities and evening entertainments organized by our animation team, led by Willy. It's great to hear that the fire, magic, and break-dancing shows added an extra layer of enjoyment to your evenings.\n\nYour description of the hotel's layout, perched on a rocky outcrop overlooking the beach at Kiotari, paints a vivid picture of the stunning surroundings. We appreciate your understanding of the landscape's impact on mobility and are pleased to hear that it provided an opportunity for some calorie-burning after indulging in the wonderful buffet at our restaurant.\n\nWe are glad you had the chance to explore our various à la carte restaurants, and your recommendation of the Greek and Italian options near the salt-water pool is noted. It's fantastic to hear that you found the food delicious and the staff fantastic.\n\nYour exploration of Rhodes and the surrounding areas, including the drive to the hilltop acropolis at Lindos and the natural beauty of the \"Seven Springs,\" adds valuable information for future guests looking to venture beyond the hotel.\n\nWe appreciate your kind thoughts for our hardworking staff, especially considering the challenges they faced during a long and stressful season. Our hearts go out to the locals affected by the forest fires, and we are grateful for your empathy.\n\nIn conclusion, we are thrilled that you felt Mitsis Rodos Village successfully provided a safe, friendly, and welcoming environment designed for families. Your understanding that the hotel caters to a specific demographic is insightful, and we're grateful for your recognition of our efforts.\n\nThank you once again for choosing Mitsis Rodos Village, and we hope to have the pleasure of welcoming your family back for another memorable holiday in the future.\n\nWarm regards,\nMitsis Rodos Village",
        "lang": "en",
        "author": "EVANGELINOS EVANGELATOS",
        "published_date": "2023-11-14T05:42:18Z"
      }
    },
    {
      "id": 924545646,
      "lang": "en",
      "location_id": 1136585,
      "published_date": "2023-11-04T13:01:18Z",
      "rating": 5,
      "helpful_votes": 2,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1175546-d1136585-r924545646-Reviews-Mitsis_Rodos_Village-Kiotari_Rhodes_Dodecanese_South_Aegean.html?m=66827#review924545646",
      "text": "Not usually one to review but we have just got home from a fabulous 2 week stay. \nIt’s one of the best holidays we’ve had. \nMy other half wasn’t a fan of all inclusive holidays but he’s converted. \nFirstly the bar and entrainment staff are amazing…. Thank you!  Our 8 and 15 year old both enjoyed the shows daily. \nThere’s so much food.  Lots of choice.  We’ve never eaten so well.  Amazing salad bar, fresh fish, lovely fruit. \nWe didn’t have to queue at the pool bar or the amphitheater at all for drinks. \nThe staff work so hard.  The hotel was always clean and tidy.  Rooms cleaned daily.  Mini bar filled every 2 days. \nJust prepare to queue at the day and night bars, but that’s literally our one and only negative.  Between the hotel busy times (around 7-9pm) we just took a stroll over the road to the 2 beautiful cocktail bars Mosa Beach Bar and Lythos, both with amazing sea views!  \nThe hotel beach bar and pizzas on the beach are perfect 👌🏻\nThe island is so beautiful.  The bus stop is right outside the hotel.  Lindos is lovely and only 15-20 mins on the bus.  \nThe water sports on the beach are such fun!! \nYou can take a speed boat out which we all loved (prices on the app) well worth it!! \nThere’s no rush in this hotel, it’s very chilled out (once you get your head around that, and away from our ‘everything needs to be now’ mentality it’s great 😀). \n100% going back next year!  Thank you for a brilliant holiday. ",
      "title": "Brilliant Family Holiday!",
      "trip_type": "Family",
      "travel_date": "2023-11-30",
      "user": {
        "username": "D2200ZLkatyr",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/2a/c0/57/e3/katy-r.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/2a/c0/57/e3/katy-r.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/2a/c0/57/e3/katy-r.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/2a/c0/57/e3/katy-r.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-m/1280/2a/c0/57/e3/katy-r.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 925826887,
        "title": "Owner response",
        "text": "Dear valued guest, Thank you so much for taking the time to share your experience at Mitsis Rodos Village! We are thrilled to hear that you had a fabulous 2-week stay and that it ranks among the best holidays you've had. It's especially rewarding to know that even someone who wasn't initially a fan of all-inclusive vacations was converted by the exceptional service and amenities. \n\nWe appreciate your shout-out to the bar and entertainment staff for their amazing service. It's fantastic that both your 8 and 15-year-olds enjoyed the daily shows. We're delighted to hear that the variety and quality of food exceeded your expectations, with highlights like the salad bar, fresh fish, and delicious fruit.\n\nYour positive comments about the cleanliness of the hotel, the attentive staff, and the regular room maintenance are truly appreciated. We take pride in providing a relaxing and enjoyable environment for our guests.\n\nWe apologize for any inconvenience you experienced with queuing at the day and night bars, but we're glad it was your only negative aspect, and it's heartening to hear that you found great alternatives nearby.\n\nIt's wonderful to hear that you enjoyed the beach bar and pizzas on the beach, and that you took advantage of the convenient location of the bus stop to explore the beautiful island, especially Lindos. The water sports and the speed boat experience adding a fun and adventurous touch to your holiday is fantastic!\n\nWe're delighted that you embraced the relaxed atmosphere of the hotel and found it to be a positive change from the usual fast-paced mentality. We look forward to welcoming you back next year for another brilliant holiday! Thank you for choosing Mitsis Rodos Village, and we appreciate your kind words. Safe travels until we see you again!\n\nKind Regards,\nMitsis Rodos Village ",
        "lang": "en",
        "author": "EVANGELINOS EVANGELATOS",
        "published_date": "2023-11-14T04:07:09Z"
      }
    },
    {
      "id": 924081531,
      "lang": "en",
      "location_id": 1136585,
      "published_date": "2023-11-02T04:14:50Z",
      "rating": 5,
      "helpful_votes": 5,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1175546-d1136585-r924081531-Reviews-Mitsis_Rodos_Village-Kiotari_Rhodes_Dodecanese_South_Aegean.html?m=66827#review924081531",
      "text": "For all those worried about negative reviews, fear not! We had a wonderful holiday and we are quite fussy; I was so worried beforehand and I really wish I hadn’t expended so much needless energy reading negative reviews. It’s not perfect and it’s not five stars, but value for money people! It’s excellent for that. \n\nFood is very good. As others have said, book in advance. Asian and Italian in particular are sensational. Staff are simply lovely. My daughter was stung by a jelly fish (very rare by the way) and they put on cream and made her a drink, and she was soon better. The snorkelling is great. Tip - go to the further beach where there are fewer people. A lot of marine life - we saw a lion fish and a moray eel! We loved our room, which was a family suite. Definitely worth paying a little extra, as you get two little rooms. We were 512, which is a little noisy after entertainment spills out at 11pm but nothing too much (kids slept through). Acrobats and magic show very good, though we didn’t do much else (as kids’ activities are quite late). Recommend bus to Lindos and glass bottom boat ride. \n\nYes there are queues for drinks, about ten minutes. Get over it. The staff work double jobs all season and are exhausted, and still had the energy to be kind and helpful in the last week of the year. I am sure we are able to wait for a cocktail. We didn’t much like the big pool, partly due to the behaviour of some other guests. We saw one guest scream (literally shout!) in the face of a lovely waiter because he happened to serve someone else before her in the burger queue! Actually made him cry. Most guests are a delight, and our kids made friends, but some definitely deserve one star for politeness and humility (and could do with cutting back on the all-in booze)! Salt pool much more chilled atmosphere. \n\nParts of the hotel are a bit dated, but for what we paid we were thrilled. All our drinks were delicious, as were added bonuses likes crepes, pizza, Souvlaki, etc. Wish we were still there!",
      "title": "Ignore negative reviews! We loved it",
      "trip_type": "Family",
      "travel_date": "2023-10-31",
      "user": {
        "username": "RachelC503",
        "user_location": {
          "id": "186369",
          "name": "Somerset, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f0/9f/default-avatar-2020-16.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 925827107,
        "title": "Owner response",
        "text": "Dear valued guest, Thank you so much for sharing your positive experience at Mitsis Rodos Village Beach Hotel & Spa! It's refreshing to read a review that focuses on the positive aspects and provides a balanced perspective.\n\nIt's great to hear that you had a wonderful holiday despite any concerns you may have had beforehand. Your tips on booking in advance for certain restaurants and exploring the less crowded areas of the beach are helpful for future travelers. The fact that the staff went above and beyond to assist your daughter when she was stung by a jellyfish speaks volumes about their dedication and hospitality.\n\nYour understanding and appreciation for the challenges faced by the staff, especially during the busy season, are commendable. It's important for travelers to recognize the hard work put in by the staff members and to be patient during peak times.\n\nIt's also nice to know that you enjoyed the entertainment, the snorkeling, and the various activities offered by the hotel. Your recommendation for excursions to Lindos and the glass bottom boat ride adds valuable information for those looking to explore the surrounding areas.\n\nYour review provides a well-rounded perspective on the hotel, acknowledging both its strengths and areas for improvement, all while emphasizing the excellent value for money. Overall, it sounds like you had a fantastic time, and your positive attitude is sure to inspire confidence in potential guests. Thanks again for sharing your insights!\n\nWarm Regards, \nMitsis Rodos Village",
        "lang": "en",
        "author": "EVANGELINOS EVANGELATOS",
        "published_date": "2023-11-14T04:09:49Z"
      }
    }
  ]
}