{
  "data": [
    {
      "id": 921011795,
      "lang": "en",
      "location_id": 1226490,
      "published_date": "2023-10-12T17:42:20Z",
      "rating": 2,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g666539-d1226490-r921011795-Reviews-Coliseum_Studios_Apartments-Pefkos_Rhodes_Dodecanese_South_Aegean.html?m=66827#review921011795",
      "text": "Arrived midnight and was greeted by the manager (Paul) gave us a run down - well mostly negatives on what you can and can't do. Cannot reserve sunbeds, can only buy drinks from the bar when using the pool, room cleaned once a week, once toilet roll was used we had to buy our own and told where the bins were to empty our rubbish.\nTold we were upgraded from a studio to an apartment- so double room tax. Was given room 2 in block A, had to carry suitcase up dark stairs as no lighting and couldn't see to open the door. Once in the room glad i didn't pay €100 for aircon which was above the front door do would not have made a difference in keeping the room cold due to the lay-out. Sheets on the bed were worn, towels were small, rooms very dated, no TV.\nPool area OK, large pool, fithy pool shower with cracked tiles and pool toilets dirty and smelly, Jacuzzi not working or had been cleaned in a while. Pool water not checked or cleaned for the week we were there. Many returning guests so all knew each other and as a 1st timer to this resort I found we were looked upon as strangers, There was no guest room with shower if you have a late departure you have to pay €30 to keep room on for an extra 3 hours otherwise to use the pool shower unless you are a returning guest and you get special treatment.\nLots of noise and music until 2am from the Karma bar next door.\nStaff in local Restaurants and bars were welcoming and lovely, great views of the sea. If you like basic accommodation you may like it here, but sorry I won't be returning to these apartments or resort.\n",
      "title": "Very basic",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "adrienneg259",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ee/db/default-avatar-2020-10.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ee/db/default-avatar-2020-10.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ee/db/default-avatar-2020-10.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ee/db/default-avatar-2020-10.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ee/db/default-avatar-2020-10.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
          "value": 2,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
          "value": 2,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 911850554,
      "lang": "en",
      "location_id": 1226490,
      "published_date": "2023-08-21T03:44:34Z",
      "rating": 5,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g666539-d1226490-r911850554-Reviews-Coliseum_Studios_Apartments-Pefkos_Rhodes_Dodecanese_South_Aegean.html?m=66827#review911850554",
      "text": "Ignore the bad reviews on here!!! We stayed here in July with our 15 year old daughter and had a wonderful holiday. Paul the owner is a lovely man and extremely kind. My husband suffers with a rare illness and drinks celery juice every morning to help ease the inflammation. Paul not only went to the market to buy it for him, he lent us a juicer for our room which we used for the duration of our holiday. Diane who works behind the bar is lovely along with Paul’s daughter and the rest of the girls that work there. The rooms are basic, however they’re large, clean and the shower is huge! The rooms are cleaned meticulously during your stay and clean towels are provided and changed. Yes you have to buy toilet rolls for your room but so what, there’s a supermarket over the road and a big bag of them can be purchased for a few euros. As for the rules, I completely agree that food and drink should only be purchased from the on-site bar, this is a business at the end of the day and I’ve been to many other hotels that stand by this also. The pool is huge and was a welcome relief from the heatwave we had when we were there. The pool bar serves some tasty food, we had breakfast there most mornings and the iced coffee’s are a must!! The hotel is very very central and within walking distance to the beaches, bars, supermarkets and restaurants and there’s a great restaurant at the top of the drive called Karma. So to sum it up we had made a promise that we’d go back next year but couldn’t wait that long so we’re going back this October for a week. I can only presume the bad reviews on here are by some very precious individuals, this is a budget hotel, not the Ritz, however it has everything you could possible want and more! Keep up the good work guys and see you very soon. X",
      "title": "A perfect holiday",
      "trip_type": "Family",
      "travel_date": "2023-07-31",
      "user": {
        "username": "970eden100",
        "user_location": {
          "id": "186399",
          "name": "Stratford-upon-Avon, Warwickshire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/2a/1c/fc/e3/caption.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/2a/1c/fc/e3/caption.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/2a/1c/fc/e3/caption.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/2a/1c/fc/e3/caption.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-m/1280/2a/1c/fc/e3/caption.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 911138756,
      "lang": "en",
      "location_id": 1226490,
      "published_date": "2023-08-18T02:02:10Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g666539-d1226490-r911138756-Reviews-Coliseum_Studios_Apartments-Pefkos_Rhodes_Dodecanese_South_Aegean.html?m=66827#review911138756",
      "text": "Absolutely disgusting! Paul the manager of the apartments was consistently rude to us when raising concerns about the cleanliness and facilities (that should have been provided) in the apartment. He spoke to us on three occasions. He spoke to us with such disgusting language and tone and made us all feel very uncomfortable. On arrival there was no actual reception to check in at so we was walking around with our suitcases for half an hour trying to find where reception was. It came to our attention that there isn’t actually a reception just the pool/bar area. We were told to wait around as the person to take us to our room was cooking. When eventually taken to our room we were disgusted with how dirty and unclean the apartment was. 4/6 plug sockets did not work, ‘kitchen’ area consisted of a table and fridge with a sink, no cooking amenities atall. Floors and walls were dirty with handprints and dirty creams/oils. The shower did not always work and when we raised these concerns with Paul he laughed and said ‘who wants to take a hot shower anyway it’s hot’. Our bathroom window could be seen through by everyone and yet again Paul’s response was ‘well how many people are walking past to see in’, we were room number 1 so a lot of people have to walk past the bathroom window. We spoke to him about dirty marks in our apartment which he responded with ‘it’s not unhygienic where you’re going to catch something, it’s not a blood stain’.  On booking it states that air con is provided however when arriving we were told it was €15 a day/€100 for the week. We spoke to a lovely lady called Diane who helped us with our booking when back in the UK about us bringing someone different to the original booking. We were told that this was fine as we had booked for three people. However, once we had raised concerns with the manager (Paul, strange Canadian accent) he came to our room at 7:30am banging ridiculously loud on our apartment door. He stated that he now, 4 days into our stay, needs to see passports as one person isn’t the original on the booking. When we stated we had spoken to Diane he said that she is just an employer and has nothing to do with what he says and what goes. He then went on to say that he would make all residents in the Coliseum apartments aware of what was going on and try to embarrass us. We were told one member of our family had 24 hours to leave or police would be informed. Jacuzzi does not work in pool area, blinds broken, dirty windows, sewage coming back up through bathroom drains, smoke detector left on side unplugged, clothes airer on balcony was broken and rusty. We were told that cleaning came once a week so would only be provided with clean towels at this time. Absolutely shocking!! Stay away! Do not waste your time and money.",
      "title": "AVOID!!",
      "trip_type": "Family",
      "travel_date": "2023-08-31",
      "user": {
        "username": "Joanne121272",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/eb/e3/default-avatar-2020-59.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/eb/e3/default-avatar-2020-59.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/eb/e3/default-avatar-2020-59.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/eb/e3/default-avatar-2020-59.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/eb/e3/default-avatar-2020-59.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 910318032,
      "lang": "en",
      "location_id": 1226490,
      "published_date": "2023-08-14T13:32:22Z",
      "rating": 1,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g666539-d1226490-r910318032-Reviews-Coliseum_Studios_Apartments-Pefkos_Rhodes_Dodecanese_South_Aegean.html?m=66827#review910318032",
      "text": "Where do I start we arrived at the coliseum at about 2am after a long flight with our 9 year old daughter the place was in darkness we had nobody there to greet us to tell us where we were going we walk around the hotel for a good 45 mins before walking to the pub just on the main road out side the hotel we were told the key would be in our door we did speak to our rep at the airport (thankgod) she did give us a door number and that was all. We entered our room it was a room for 3 me my husband and my daughter the bedding was dirty the blankets had better days and definitely hadnt seen the washing machine for a good while and we had 1 set of towels. The pool was great only thing I can say is the last step isn't painted in different colour like the rest so stumped our toe and fell into the pool serval times. Couple of days into the hotel I asked at the pool bar for another toilet roll which I would replace when I go to the shop to which I got told its not a hotel its up to us to get more supplies. So i did and also got more water and drinks for the next couple of days. We walked down the the pool with our drinks to which we were told by a very rude manager that was wasnt aloud to use our own drinks round the pool we HAD to buy from the pool bar for tax reasons (yeah ok ) There was 14 of us on the holiday and they all came to our pool as it was a meeting point bringing trade to the hotel. While the fire in Greece was happening (which where extremely close to our hotel) the manager of the hotel (paul) left us all in bed when we were supposed to be evacuated. The hotels all around us were put on buses and taken away to safety this isn't exceptable at all not only did this cause us stress on our holiday but the panick that it causes for my 9 year old was uncalled for. We paid 200 euro for air conditioning that didn't work the first 2 nights we slept on the balcony and got bites ALOT, when it did work it did nothing for us due to the bed was around the corner away from the air con we actually had to move the bed into the kitchen so we could sleep. Half way through the holiday we asked about the towels and asked if we could have clean one to be told by a very rude older lady behind the pool bar that  towels get changed twice thats it its not a hotel!! The smell in the room was horrible we found the source was a  bubbling  hole in the bathroom it looked like other people's waste was in our bathroom we couldn't be bare footed on the bathroom floor due to this. If anyone is looking at at staying at this hotel not only will u be confronted by a very rude man which which has issues he will also put you and your family at risk if there is any more fires, we rusfused to pay the late fee ans give this man any more of our money and booked into the hotel chysanthum next door what a lovely man and family couldn't do more for us when we visit Greece again we will be staying in the chysanthum!!! Would rather give our money to a lovely family than a rude man that talks to his staff like there somethink on his shoe!!!!",
      "title": "Worst hotel every stay away don't give this man your money",
      "trip_type": "Family",
      "travel_date": "2023-07-31",
      "user": {
        "username": "980suzib",
        "user_location": {
          "id": "187069",
          "name": "Manchester, Greater Manchester, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f3/7c/default-avatar-2020-29.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f3/7c/default-avatar-2020-29.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f3/7c/default-avatar-2020-29.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f3/7c/default-avatar-2020-29.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f3/7c/default-avatar-2020-29.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 902712006,
      "lang": "en",
      "location_id": 1226490,
      "published_date": "2023-07-13T10:49:58Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g666539-d1226490-r902712006-Reviews-Coliseum_Studios_Apartments-Pefkos_Rhodes_Dodecanese_South_Aegean.html?m=66827#review902712006",
      "text": "Second stay at coliseum obviously such a lovely place , great first holiday for me and my partner. Great for all ages and only a 2 min walk to beach which is never busy! Food from the bar is nice diane always makes good food, paul and diane have it running lovely. I praise the housekeeping lady (not sure of her name) she’s brilliant, cleaned our room to high speck. Loved my holiday at the coliseum, would definitely come back again! Many thanks to the coliseum team. ",
      "title": "Lovely place 😊",
      "trip_type": "Couples",
      "travel_date": "2023-07-31",
      "user": {
        "username": "martikaw2023",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ea/74/default-avatar-2020-68.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ea/74/default-avatar-2020-68.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ea/74/default-avatar-2020-68.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ea/74/default-avatar-2020-68.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ea/74/default-avatar-2020-68.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      }
    }
  ]
}