{
  "data": [
    {
      "id": 931176777,
      "lang": "en",
      "location_id": 13298623,
      "published_date": "2023-12-27T11:23:30Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1467782-d13298623-r931176777-Reviews-Lujo_Hotel_Bodrum-Guvercinlik_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review931176777",
      "text": "Overall, Lujo is a stunning hotel with top class facilities.  However, the operational side of things is less than slick, and our trip was ruined by a catalogue of errors that made the experience less than stress-free.  In recent years, we have been fortunate to stay at some of the best hotels in Turkey, including Maxx Royal Belek, Maxx Royal Kemer, Voyage Belek, Regnum, and Hilton Dalaman, so these are my points of comparison.    \n\nPros\n\n•\tThe pools are in a league of their own.  They were *properly* heated and never busy.  Even the aquapark water was heated!  The 20m indoor pool was usually deserted and perfect for swimming laps. The service around the Maki pools was fabulous.  \n\n•\tOur Joy Advisors (WhatsApp assistants), Valeria and Elmira were incredibly helpful and worked their socks off.  They organised a taxi for us to go to an obscure bird watching location, ordered antihistamines from a pharmacy for us, and tried their best to fix the many problems we encountered during our stay (see below in the ‘cons’ section). \n\n•\tThe views over the bay are beautiful, aside from the very ugly neighbouring hotel which does spoil it a little bit!\n\n•\tThe beach is amazing, with (imported) white sand and very calm water.  The only caveat is that the water gets deep *very quickly* so it’s not great for small children or weak swimmers.  Service was great on the beach also. \n\n•\tThe rooms are gorgeous with lovely, comfy beds, a choice of mattress (soft, medium, hard), and a pillow menu.  My only complaint was that the family room was a bit short on storage space for a family of 4, meaning the room was always in a mess, but we made do.  We were very grateful to be upgraded to a family corner suite (following a complaint about a catalogue of problems) which was very comfortable with loads of space to put things.  The view was breath-taking.  Family rooms include a complementary PlayStation loan, which was great for the kids. \n\n•\tThe cocktails were excellent.  Choice of San Pellegrino or Perrier water was lovely. \n\n•\tThe chocolate bar serves Moet (not just at check-in) but (bizarrely) not chocolate!\n\n•\tThere are lots of healthy and vegetarian food options.  Food highlights were asparagus carpaccio in the Italian restaurant, falafel in the Turkish restaurant and guacamole in the seafood restaurant.  \n\n•\tThe hotel’s rescue dogs (particularly Tilki) were a massive hit with our kids.\n\nCons\n\n•\tThe food was the biggest problem for us.  It was very hit and miss.  Some of it was great but some was disappointing.  For example, we were served burnt bacon, a very greasy burger, and chips that tasted of old fat.  \n\n•\tWe also had a lot of problems finding food for our fussy children.  There was almost nothing on the menu that they would eat, so we had to place special orders in advance (for things like chicken goujons, plain bread, plain pasta and rice) for every meal.  This had to be done at least 2 hours in advance.  Although we were grateful to have this option, it meant it was difficult to relax as we were constantly having to plan the kids’ food orders.  However, sometimes the special orders never actually materialised.  It was striking that our youngest child ended up losing weight over the course of the holiday.  The lack of a buffet at Lujo compounded these issues.  \n\n•\tThe service in the restaurants was also very mixed.  Items we ordered frequently got forgotten and there were at least two dinners where one member of the family never got their main course.  \n\n•\tWe were grateful to be given a room upgrade part way through the stay due to the problems we’d had with meals.  Unfortunately, my son’s (much loved) inflatable crocodile got left behind by the bellboy during the transfer and then popped by the cleaners.  Our joy advisor did very kindly get him another inflatable to say sorry but he was still very upset by croccy’s ‘murder’. \n\n•\tOn another day, the cleaners accidentally took my other son’s (extremely important) cuddly toy away with the laundry.  He was hysterical when he saw that it was missing.  Thank goodness, we managed to retrieve it from the laundry area, but we could all have done without the stress of this mini crisis!  \n\nIn sum, I think we were quite unlucky with so many things going wrong. Regardless, I can’t see us returning because our kids hated it!\n \n",
      "title": "Stunning hotel with top class facilities but operational problems",
      "trip_type": "Family",
      "travel_date": "2023-10-31",
      "user": {
        "username": "Sophcana",
        "user_location": {
          "id": "186338",
          "name": "London, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/01/2e/70/a6/avatar077.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/01/2e/70/a6/avatar077.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/01/2e/70/a6/avatar077.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 931379075,
        "title": "Owner response",
        "text": "Dear Guest,\n\nThank you for taking the time to share your detailed feedback on your recent stay at Lujo Hotel Bodrum. \n\nWe deeply appreciate your positive comments regarding our exquisite facilities, the excellence of our pools, the dedicated assistance from our Joy Advisors, the captivating bay views, and the splendid beach featuring imported white sand. We are delighted that you found comfort in our well-appointed rooms, enjoyed the breathtaking views, relished our cocktails, and appreciated the diverse selection of healthy and vegetarian food options. Please allow us to mention that we offer, among other treats, delicious homemade strawberry chocolate at the Chocolate Bar.\n\nNevertheless, we extend our sincere apologies for any aspects of your holiday experience that fell short of your expectations, particularly the challenges you faced with special orders for your children, the unfortunate incidents involving your son's inflatable crocodile and the accidental laundry mishap with the cuddly toy. Such occurrences do not align with our usual standards, and we are dedicated to implementing corrective measures.\n\nWe understand that these issues may have impacted your overall enjoyment, and for that, we extend our heartfelt apologies. It would be an honor to welcome you back in the future, providing an opportunity to showcase the improvements we have implemented and regain your trust.\n\nBest regards,\nLujo Management\n",
        "lang": "en",
        "author": "Lujo Hotel",
        "published_date": "2023-12-29T05:19:20Z"
      }
    },
    {
      "id": 925728337,
      "lang": "en",
      "location_id": 13298623,
      "published_date": "2023-11-13T08:10:23Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1467782-d13298623-r925728337-Reviews-Lujo_Hotel_Bodrum-Guvercinlik_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review925728337",
      "text": "Perfect hotel! Everything was perfect the staff is really nice and the food excellent!!! \nThe swimming pools, the restaurant area bars etc are beyond beautiful. This is by far one of the best hotel i have ever seen in my life. And the service is top top. I will come back",
      "title": "Perfect",
      "trip_type": "Family",
      "travel_date": "2023-05-31",
      "user": {
        "username": "Camper06900522100",
        "user_location": {
          "id": "187147",
          "name": "Paris, Ile-de-France"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/eb/43/default-avatar-2020-11.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/eb/43/default-avatar-2020-11.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/eb/43/default-avatar-2020-11.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/eb/43/default-avatar-2020-11.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/eb/43/default-avatar-2020-11.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 925832206,
        "title": "Owner response",
        "text": "Dear Guest,\n\nThank you ever so much for your glowing review and kind words! \n\nWe are thrilled to hear that you found Lujo Hotel Bodrum to be perfect in every aspect. It warms our hearts to know that you appreciated the friendliness of our staff, the excellence of our cuisine, and the beauty of our swimming pools, restaurant areas, and bars.\n\nYour praise, especially considering it as one of the best hotels you have ever seen, is truly rewarding. We are delighted to have provided you with top-notch service. \n\nIt would be our pleasure to welcome you back, and we look forward to creating more wonderful memories during your next visit.\nBest regards,\nLujo Management\n",
        "lang": "en",
        "author": "Lujo Hotel",
        "published_date": "2023-11-14T05:11:44Z"
      }
    },
    {
      "id": 925722459,
      "lang": "en",
      "location_id": 13298623,
      "published_date": "2023-11-13T07:18:34Z",
      "rating": 3,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1467782-d13298623-r925722459-Reviews-Lujo_Hotel_Bodrum-Guvercinlik_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review925722459",
      "text": "Amazing property in terms of the physical resort - nice setting, lovely spacious grounds, good beach etc. Did not feel crowded (though we visited in low season). Rooms were nice and large with good linens and toiletries. Very comfortable. \n\nWhat could have helped is more upfront communication about the resort from staff at checkin. They prefer to communicate via WhatsApp (with your “Joy Advisor”) but this became tedious as you could never speak to anyone quickly. WhatsApp also used to flog you extras (spa, seaplane, excursions) without asking.\n\nService was the major downfall. The vast majority of the team seemed totally disinterested. No one said hello. Smiles rare. Often rude. Often untrained. Often English language lacking. Beyond this, I had a few notable service failures and there was no recovery, just an “Oh sorry”. This is why I don’t believe it’s a five star hotel, it’s four. \n\nFood was variable, ranging from superb to awful (overcooked steak - worst I’ve had ever). Better restaurants incurred a €75-100 surcharge per person, not ideal.",
      "title": "Pretty good - service let’s it down",
      "trip_type": "Business",
      "travel_date": "2023-10-31",
      "user": {
        "username": "EpicDownUnder",
        "user_location": {
          "id": "186338",
          "name": "London, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/04/4e/a2/ce/adampies.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/04/4e/a2/ce/adampies.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/04/4e/a2/ce/adampies.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/04/4e/a2/ce/adampies.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/04/4e/a2/ce/adampies.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 925832123,
        "title": "Owner response",
        "text": "Dear Guest,\n\nThank you for taking the time to share your detailed feedback following your stay at Lujo Hotel Bodrum. We appreciate your positive comments about our stunning property, spacious grounds, beach, and comfortable rooms.\n\nHowever, we sincerely apologize for the shortcomings you experienced with our service. Your concerns are taken seriously, and we regret that we fell short of your expectations. We will address the issues you raised with our team to ensure that necessary improvements are made.\n\nWe also appreciate your feedback regarding communication and the use of WhatsApp. Please allow us to mention that all our guests are assigned their personal Joy Advisors upon arrival, all fluent in English to assist with all our guests’ wishes and concerns. We are sorry that you were not entirely satisfied with this option and will review our communication procedures to make the process more convenient for our guests.\nRegarding the food, we apologize for the variable experience, and we assure you that your comments will be shared with our culinary team for further enhancement.\n\nYour insights are invaluable, and we hope for an opportunity to welcome you back, providing an improved and more seamless experience.\nBest regards,\nLujo Management\n",
        "lang": "en",
        "author": "Lujo Hotel",
        "published_date": "2023-11-14T05:10:45Z"
      }
    },
    {
      "id": 924279016,
      "lang": "en",
      "location_id": 13298623,
      "published_date": "2023-11-03T04:44:35Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1467782-d13298623-r924279016-Reviews-Lujo_Hotel_Bodrum-Guvercinlik_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review924279016",
      "text": "We had an excellent holiday at the Lujo hotel. It feels more like a small village than a hotel, with a variety of restaurants to choose from and several beaches and pool decks. We visited at a quiet time of year, but even at peak times the amount of space means it never felt too busy. The staff were friendly and always keen to help. There were several activities, we took part in a bicycle tour, pilates sessions, and played tennis in one of their two courts. The quality of the food was excellent, the Turkish restaurant Asma particularly good. The Opa restaurant was great for breakfast and had lovely views of the beach. For drinks, the classic cocktails were generally OK but the signature hotel cocktails such as the Newton Jack much better. The swim-up rooms meant you always had somewhere you could go for a swim which was super convenient. We saw two live singers in the evenings at the brilliantly named Pablo Esco Bar, Seran Bilgi and Della Miles, who both performed with six-piece bands and were terrific entertainment. Also worth mentioning the spa, sauna and gym, and the water park with some super fun slides (if you're brave enough, try the Rocket). When you check in, you are added to a WhatsApp group with two joy advisors who answer questions and help with anything you need - ours, Julide and Vlada - were terrific. Getting taxis to visit nearby towns was easy, quick and worthwhile. Our favourite place to hang out in the hotel was probably pier lotus, lots of sun loungers, and a lovely sea breeze to balance out the sun. ",
      "title": "Wonderful and luxurious",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "M4858GOstevenw",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e7/3d/default-avatar-2020-55.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e7/3d/default-avatar-2020-55.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e7/3d/default-avatar-2020-55.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e7/3d/default-avatar-2020-55.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e7/3d/default-avatar-2020-55.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 924759557,
        "title": "Owner response",
        "text": "Dear Guest,\n\nWe are happy to read your wonderful review of your stay at Lujo Hotel Bodrum. It brings us great joy to know that you had an excellent holiday and enjoyed the luxurious experience we provide.\n\nOur resort's expansive layout indeed offers a village-like atmosphere, ensuring that even during busier times, you can find ample space to relax and unwind. We're delighted to hear that you found our staff friendly and helpful, and it's fantastic that you took part in various activities, from bicycle tours to pilates and tennis.\n\nWe appreciate your compliments on the food quality, particularly at Asma and Opa restaurants. It's lovely to know you enjoyed our signature cocktails and the live entertainment at Pablo Esco Bar. Our spa, sauna, gym, and water park indeed add to the overall experience.\n\nYour mention of your Joy Advisors, Julide and Vlada, is greatly appreciated. We aim to provide the best service possible, and their assistance exemplifies our commitment to ensuring your stay is memorable and stress-free.\n\nThank you for choosing Lujo Hotel Bodrum, and we look forward to welcoming you back for another fantastic experience.\n\nBest regards,\nLujo Management \n",
        "lang": "en",
        "author": "Lujo Hotel",
        "published_date": "2023-11-06T05:18:01Z"
      }
    },
    {
      "id": 924183247,
      "lang": "en",
      "location_id": 13298623,
      "published_date": "2023-11-02T13:52:02Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g1467782-d13298623-r924183247-Reviews-Lujo_Hotel_Bodrum-Guvercinlik_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review924183247",
      "text": "We stayed at Lujo in October and had the most amazing experience. All the staff are excellent providing service with a smile. We were linked with two “joy advisors” Juliede and Vlada, who answered every query to ensure we had a relaxing experience. Every area was spotlessly clean. Food was excellent esp secret restaurant and the three private beaches were the perfect places to relax. The Bvlgari toiletries were a nice touch!",
      "title": "Lujo hotel review",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "HM456",
        "user_location": {
          "id": "186338",
          "name": "London, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/77/ae/default-avatar-2020-2.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/77/ae/default-avatar-2020-2.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/77/ae/default-avatar-2020-2.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/77/ae/default-avatar-2020-2.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/77/ae/default-avatar-2020-2.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 924759746,
        "title": "Owner response",
        "text": "Dear Guest,\n\nThank you for choosing Lujo Hotel Bodrum for your stay in October and for sharing your wonderful experience with us. We are delighted to read your kind words and to know that you had an amazing time during your visit.\n\nIt's great to hear that our staff, known for their excellent service with a smile, left a positive impression on you. We appreciate your mention of your Joy Advisors Julide and Vlada, who went the extra mile to ensure your relaxation and satisfaction.\n\nMaintaining a spotlessly clean environment is a top priority for us, and we are thrilled that you noticed and appreciated it. We are also pleased that you enjoyed the food, especially at the Secret Restaurant, and made the most of our three private beaches.\n\nThe Bvlgari toiletries are indeed a nice touch, and we're glad you appreciated the little details that enhance your stay.\n\nOnce again, thank you for your kind words. We hope to welcome you back to Lujo Hotel Bodrum for another unforgettable experience in the future.\nBest regards,\nLujo Management\n",
        "lang": "en",
        "author": "Lujo Hotel",
        "published_date": "2023-11-06T05:20:06Z"
      }
    }
  ]
}