{
  "data": [
    {
      "id": 941951371,
      "lang": "en",
      "location_id": 14089108,
      "published_date": "2024-03-12T18:00:37Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g312738-d14089108-r941951371-Reviews-The_Bodrum_EDITION-Yalikavak_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review941951371",
      "text": "Service, Style, The Entire Product is a Win.  \nThere is a good reason this Edition is No One Edition worldwide.   \nAsk for rooms up high if you want more privacy..some rooms are along a pathway...just check as you book.\nService - fabulous.  Happy !   Roula & Emmy at the beach,  Ece & Erina at Concierge ,  Doguhan bellman are just some of the great folks.   Roula i think (from Greece originally) that was one of the best hotel service people we have interacted with ...and we travel a lot.  Informative, kind, warm, professional and just reads people very well.\n\nLoved the clean open floorplan and layout - as consistent with other editions.\n\nFood was very good to great.  They accommodated my vegan needs.  Some mornings a local woman made warm fresh local food for breakfast.  \n\nAt poolside they passed some yummy snacks.  Better service closer to bar on the platforms vs the beach.  \n\nLots of classy global weddings happen here but did not overwhelm the property.  Met people who we had friends in common in Dubai..how fun was that\n\nOne day we came back via a dingy off our friends goolet.  Was great to have the easy access after a few days on the water.\n\nHave a vegan ice cream welcome offering please. \n\nCleaning staff so kind and did a great job too\n\nWe stayed here and at the Aman..we liked both.  This had a mix of calm tranquil with a bit more happening.  \n\nTHANK YOU",
      "title": "No One Edition - well earned",
      "trip_type": "Couples",
      "travel_date": "2023-09-30",
      "user": {
        "username": "lajolla1",
        "user_location": {
          "id": "33045",
          "name": "Santa Barbara, California"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/01/44/fb/18/lajolla1.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/01/44/fb/18/lajolla1.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/01/44/fb/18/lajolla1.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/01/44/fb/18/lajolla1.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/01/44/fb/18/lajolla1.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 933625953,
      "lang": "en",
      "location_id": 14089108,
      "published_date": "2024-01-10T16:13:53Z",
      "rating": 5,
      "helpful_votes": 2,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g312738-d14089108-r933625953-Reviews-The_Bodrum_EDITION-Yalikavak_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review933625953",
      "text": "The overall stay was beyond expectations. Like a dream we never wanted to wake up from. We seriously felt like movie stars every minute of our stay. Everything in the resort felt perfect - the setting, the ambience, our room, the food, activities, and most important of all, the service. We have visited some truly wonderful resorts but can say with confidence the service here was levels above. Very impressive. Every single employee was kind and caring of guest needs but not only that, they knew how to make every single interaction truly memorable. We will always remember our time in Bodrum for the beautiful service received at this hotel. \n\nAnd it is the service that really sets this place apart, but there are so many more wonderful reasons to go here:\n\n- The most gorgeous setting! \n- Views of turquoise waters all day long!\n- Beautifully manicured gardens everywhere!\n- A breakfast truly fit for kings and queens! What a unique experience we had here every morning! \n- The special touches were everywhere!\n- You will get pampered all the way! Cooling gel applied to you while you lounge at the pool…..Your beach or pool items are neatly organized for you the moment you sit down…... If traveling with little ones, they will be offered smiles, ice cream, and treats everywhere they go!\n- The Japanese pop up restaurant had the most delicious sushi rolls we have ever had anywhere! Even our little girls loved the food here, even though they had refused to try Japanese food before.\n- Fabulous views from every restaurant!\n- So much delicious food! Fresh food, healthy food, sophisticated food, simple food, there was always something for everyone in the menu. And the quality was always fantastic!\n- Booze ice cream! \n- Watermelon slushies for our girls!\n- Really elegant decor. White, minimal, fresh, and perfectly luxurious. \n- Lazy mornings by the pool! And what an amazing pool it was.\n- Soft uplifting music always playing the perfect tune at the perfect volume!\n- Hotel’s GM walks around and greets you every day by name with a kind and welcoming smile!\n- Best spa! \n- Resort never feels busy!\n- There’s always someone available to help! Staff to guest ratio is amazing.\n- Lovely guests around you every day!\n\nThere was a lovely lady walking around during breakfast and offering guests a new special treat every morning, with a story behind each treat, and the sweetest smile: it was a beautiful touch. \n\nOne last item to note since there are not many reviews here on traveling with  children… We traveled with our 6 year old twin girls… There’s no kids club or pre planned activities for the kids at the resort. When being shown to our room we were told that “we do not see a lot of kids in our hotel and we apologize for the lack of kids entertainment or activities”. But our girls didn’t mind it one bit! They were in absolute paradise! They were in the most beautiful and luxurious resort and the kids, just like the adults, will feel so pampered. And who doesn’t love being papered?! Our girls enjoyed every minute here just as much as we did. It was so cute to see them so happy.\n\nAfter having visited many Bonvoy properties, I truly believe this is one of their best. Visit if you can!!",
      "title": "What can I say about this little piece of paradise!",
      "trip_type": "Family",
      "travel_date": "2023-08-31",
      "user": {
        "username": "NYCnana",
        "user_location": {
          "id": "155019",
          "name": "Toronto, Ontario"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e6/ea/default-avatar-2020-54.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e6/ea/default-avatar-2020-54.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e6/ea/default-avatar-2020-54.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e6/ea/default-avatar-2020-54.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e6/ea/default-avatar-2020-54.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 919264485,
      "lang": "en",
      "location_id": 14089108,
      "published_date": "2023-10-01T07:09:51Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g312738-d14089108-r919264485-Reviews-The_Bodrum_EDITION-Yalikavak_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review919264485",
      "text": "We traveled all through Turkey and the Bodrum EDITION was a favorite. The food sublime, the staff, even better, the atmosphere....the Turkish Riviera! The staff from front desk, food and beverage, spa, pool, housekeeping etc., all seemed to be in sync with the goal of insuring a perfect stay for the guests. The architecture and location over the top. A shout out to the \"Kitchen\" restaurant for the best breakfast ever and they even offered a recipe for a dish I loved. The dinner in the same restaurant was the best meal we had on a month long journey. Thank you all and congrats on all your talent and hard work. Cheryl ",
      "title": "A delightful surprise at Bodrum EDITION!",
      "trip_type": "Friends getaway",
      "travel_date": "2023-09-30",
      "user": {
        "username": "cameyerson",
        "user_location": {
          "id": "60745",
          "name": "Boston, Massachusetts"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ef/9c/default-avatar-2020-14.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ef/9c/default-avatar-2020-14.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ef/9c/default-avatar-2020-14.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ef/9c/default-avatar-2020-14.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ef/9c/default-avatar-2020-14.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 918176065,
      "lang": "en",
      "location_id": 14089108,
      "published_date": "2023-09-24T11:08:51Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g312738-d14089108-r918176065-Reviews-The_Bodrum_EDITION-Yalikavak_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review918176065",
      "text": "What's not to love about the Edition Bodrum. We had had this hotel on our bucket list for a few years. We have stayed at a few outstanding hotels in the marriott portfolio (e.g. St Regis Maldives) so we had high expectations. \n\nBooking: we used points for our stay. It came out to around 90k (give or take) per night. This presented OUTSTANDING value since the nightly cash cost is upwards of $2000+ per night. I paid $100 extra per night to upgrade to ocean view. I highly recommend this. The view was outstanding and some of the garden view rooms have no view at all and some have very little privacy being next to the walking path. Worth every penny to upgrade. \n\nGetting there: We reserved a car service ahead of time. We knew the hotel was around 40 min from the airport but it took well over an hour since our driver did not know where he was going and did not know how to use google maps. This was quite frustrating but what can you do. \n\nCheck-in:  very smooth and easy. We were given some refreshing Edition branded ice creams which were amazing. We were delighted to be given free breakfast daily (I am titanium elite). \n\nRoom: we had the base room but upgraded to ocean view for $100 per night as mentioned above. The room was outstanding. My only complaint is that it didn't cool off quite enough and I found myself uncomfortably warm sleeping at night. Other than this, the room was perfect with large balcony. The other issue (minor) is that you cannot stream any content on the TV such as Netflix and there aren't really many English channels. Not a big deal since were not in the room much but it would have been nice. We had a nice cake and plate of fruit waiting for us as a welcome amenity which was very thoughtful. \n\nFood: outstanding. The free breakfast was expansive with many options. We ate at all the restaurants and really have no complaints. All the food was outstanding.\n\nShout out to Emilia (spelling?) at the pool/beach area. She was unbelievable. She knew my wife is pregnant and always came to check on her to see if there was anything she needed. She would bring us drinks and make sure we had shade at the pool etc. She is an outstanding employee and the Edition is very lucky to have her. \n\nWe went into Bodrum town once to walk around, eat, do some shopping. Its a it of a drive but worth going in once. We did not make it to Yalikavak marina area although its very close to hotel. \n\nOverall definitely a 5 star hotel. We will definitely be returning some day. Thank you to all the staff who make this hotel as great as it is.",
      "title": "Outstanding hotel and equally good service.",
      "trip_type": "NONE",
      "travel_date": "2023-08-31",
      "user": {
        "username": "MarkDiamond0125",
        "user_location": {
          "id": "54805",
          "name": "Sioux Falls, South Dakota"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/17/8b/fd/63/caption.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/17/8b/fd/63/caption.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/17/8b/fd/63/caption.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/17/8b/fd/63/caption.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "1": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 918381125,
        "title": "Owner response",
        "text": "Dear Gmarkd,\n\nWe are truly grateful for taking the time to share your exceptional feedback with us. It's heartwarming to hear that your stay not only met but exceeded your expectations.\n\nEfficient and smooth check-in experiences are crucial, and it's wonderful that you found ours to be just that. Our branded ice creams are indeed a real treat, and we're pleased you enjoyed them along with the complimentary daily breakfast. \n\nYour feedback on the room is valuable to us. We're thrilled you found it perfect with a spacious balcony and that the welcome amenity added a thoughtful touch to your stay. We'll certainly look into the cooling issue you mentioned to ensure all our guests enjoy the utmost comfort.\n\nOur culinary team is delighted that you found our food outstanding, and your exploration of all our restaurants is commendable.\n\nAimilia's exceptional service is a testament to our dedicated team, and we'll be sure to pass on your praise to her. She truly goes above and beyond to make our guests' experiences memorable.\n\nWe appreciate your kind words, and your recognition of our staff's hard work is a great source of motivation for us. \n\nWe can't wait to have the pleasure of welcoming you back someday for another enchanting experience.\n\nWarm regards,\n\nAlena Samli\nDIRECTOR OF QUALITY & BRAND ",
        "lang": "en",
        "author": "Alena Samli",
        "published_date": "2023-09-25T13:12:54Z"
      }
    },
    {
      "id": 917814963,
      "lang": "en",
      "location_id": 14089108,
      "published_date": "2023-09-22T05:19:47Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g312738-d14089108-r917814963-Reviews-The_Bodrum_EDITION-Yalikavak_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review917814963",
      "text": "My husband and I spent 5 nights at The Edition Bodrum boutique hotel.  Deluxe Sea View Room 1228 , kept  perfectly clean by Meral Balcic of housekeeping . Firstly I must mention and thank ALL members of staff . Roulla and her team went above and beyond. Greetings us with a warm friendly welcome each morning, remembering our names, replacing wet towels without being asked, refreshing our ice buckets, always attentive without being overbearing. The hotel design is calming bright airy contemporary relevant and authentic….. luxury without the fuss . With beautiful lush well manicured gardens. We had dinner most nights  at The Kitchen Restaurant ( where the A La Carte breakfast is also served )  The food was fist class deserving of a Michelin star. Starting  with the most amazingly more-ish Amuse - Bouche and ending in equally stunning Petit fours . A big thank you to the wonderful restaurant manager Goksel Evren who’s always greeted us at the door and always came to our table to ensure we were well looked after throughout the evening, attentive perfect service. After commenting on the delicious Turkish cookies I had earlier that day, he arranged for  some to be delivered to our room , which we discovered when returning from our dinner that evening. We loved this this hotel and look forward to returning in the near future.",
      "title": "Amazing Bouquet Hotel ",
      "trip_type": "Couples",
      "travel_date": "2023-09-30",
      "user": {
        "username": "Mary201753",
        "user_location": {
          "id": "186338",
          "name": "London, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e5/2b/default-avatar-2020-52.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e5/2b/default-avatar-2020-52.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e5/2b/default-avatar-2020-52.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e5/2b/default-avatar-2020-52.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e5/2b/default-avatar-2020-52.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 918380295,
        "title": "Owner response",
        "text": "Dear Mary201753,\n\nThank you for choosing The Bodrum EDITION for your recent stay, and for taking the time to share your wonderful experience.\n\nWe're thrilled to read about your stay and we appreciate your kind words about Meral, who ensured your room was kept impeccably throughout your stay.\n\nYour heartwarming compliments about our dedicated team members, especially Roula, truly resonate with the spirit of our hospitality. We're delighted that they went above and beyond to make your stay memorable while maintaining a balance of attentiveness.\n\nIt's fantastic to hear that you found our hotel design authentic and a manifestation of quiet luxury, as well as acknowledgement of our lovingly maintained natural surroundings. \n\nDining at The Kitchen Restaurant was clearly a highlight for you, and we're grateful for your compliments. \nGoksel, was thrilled to hear your words and we're glad you appreciated the nice surprise he arranged for you.\n\nYour expressed intention to return in the near future is the best compliment we could receive, and we look forward to welcoming you back. \n\nWarm regards,\n\nAlena Samli\nDIRECTOR OF QUALITY & BRAND ",
        "lang": "en",
        "author": "Alena Samli",
        "published_date": "2023-09-25T13:07:49Z"
      }
    }
  ]
}