{
  "data": [
    {
      "id": 945647767,
      "lang": "en",
      "location_id": 1599623,
      "published_date": "2024-04-07T01:09:46Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d1599623-r945647767-Reviews-Kempinski_Central_Avenue_Dubai-Dubai_Emirate_of_Dubai.html?m=66827#review945647767",
      "text": "Amazing hotel. Great location. Breakfast was exceptional as was the service. Salah was friendly and attentive. We stayed for 5 nights and had no issues at all. We would definitely recommend this hotel to friends and family looking to visit Dubai in the future.",
      "title": "Fantastic Dubai hotel",
      "trip_type": "Couples",
      "travel_date": "2024-04-30",
      "user": {
        "username": "O6254UCkerryc",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ef/32/default-avatar-2020-12.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ef/32/default-avatar-2020-12.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ef/32/default-avatar-2020-12.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ef/32/default-avatar-2020-12.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ef/32/default-avatar-2020-12.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 945925134,
        "title": "Owner response",
        "text": "Dear O6254UCkerryc,\n\nMarhaba from Kempinski Central Avenue Dubai.\n\nhank you for your wonderful review! We're thrilled to hear that you had an amazing experience at our hotel and that you found our location to be great. It's fantastic to know that you enjoyed our exceptional breakfast and experienced friendly and attentive service from Salah.\n\nWe're delighted that you had a seamless five-night stay with us and truly appreciate your recommendation to friends and family. We look forward to welcoming you back on your next visit to Dubai!\n\nBest Regards, \n\nSity Nurhayati\nManagement Office\n",
        "lang": "en",
        "author": "Sity Nurhayati",
        "published_date": "2024-04-09T04:26:11Z"
      }
    },
    {
      "id": 945641331,
      "lang": "en",
      "location_id": 1599623,
      "published_date": "2024-04-06T22:56:48Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d1599623-r945641331-Reviews-Kempinski_Central_Avenue_Dubai-Dubai_Emirate_of_Dubai.html?m=66827#review945641331",
      "text": "This hotel was formerly known as the Address Dubai Mall Hotel and was converted to a Kempinski hotel in Jan2024. I selected this hotel due to it being connected to Dubai Mall, which is the largest mall in Dubai ( and one of the largest in the world ). I encountered some issues with the reservation but it was promptly resolved. More on that later. \n\nArrival \n\nI booked the hotel car who picked me up from airport. Journey about 20 mins. The arrival experience was somewhat underwhelming. There is no in room check in and I had to queue for check-in. Thankfully, it’s quite quick. The receptionist that checked me in was new so it took a while. I was then escorted to the room but was not shown the room features. It became the job of the bellhop. The room is quite sophisticated with touch screen controls and a tablet that control the temperature and lighting.\n\nThe Room\n\nI booked a Premier Club King Room. The first room I checked in had issues. The jacuzzi wasn’t working, there’s no hot water ( or rather luke warm water ) and the room has a strange layout that is very different from what was shown on the website. I complained to the hotel management and on the 2nd night, I was re-assign to a new room that’s exactly like what was depicted on the website. This new room has a full view of the Burj Khalifa and the surrounding skyscrapers as well as a view from the Jacuzzi bathtub. Wonderful. \n\nThe re-assigned room was also in a much better condition. There’s a working desk, a large LG TV and comfortable bed. The only issue I had with the room were with the towels. They are very rough in texture, almost “sand paper” like. It’s time to change those towel. \n\nThe bathroom had issues with water temperature. While the first room has no hot water, the second room has too much so the temperature can goes very high suddenly. I am not sure why but it seems many hotels short of top tier luxury hotels have issues with water temperature in their bathrooms. The jacuzzi also wasn’t as bubbly as what I experienced in other hotels with jacuzzis but still having a jacuzzi is still better than not having. \n\nAll rooms in Kempinski comes with a balcony and mine has a much larger balcony, almost like a mini-terrace. In the morning when sunrise, it’s so relaxing to just have a cup of coffee in the balcony and enjoy the morning view with cool breeze. \n\nThe Common Areas and Location\n\nThe location of the Kempinski is snack down in the middle of downtown Dubai and of course, directly connected to the Dubai Mall which is the main advantage of this hotel. For those that want to start their trip with intensive shopping at Dubai Mall, there is frankly no better location. However, it does requires one to walk through the perfume section of Bloomsdale and over-eager sales rep trying to promote their perfumes. \n\nFrom the Dubai Mall, one can also reach the Burj Khalifa with a bit of walking and the Burj Khalifa / Dubai Mall metro station that can connect to the rest of the city. Should walking be too much, taxis and private cars for hire are readily on call at the front entrance of the hotel. \n\nThe hotel lobby is grand, with high ceiling and decked on in marble and beautiful chandeliers. However, I find it overtly commercialized with lots of shops in the lobby area selling various stuff and display casing selling luxury products from various brands. It feels like a shopping mall. Apparently, this is common in Dubai as other hotels does this as well. \n\nThe hotel has two restaurants, the Cez restaurant that I ate there for morning breakfast and the Nai restaurant which I had a quick lunch there ( free of charge, more on that later ). Food is average in both locations, typical 4/5 star. F&B isn’t a strong point of this hotel from what I can tell. \n\nService\n\nIt’s a really mix bag here. Problem started right from the reservation. I booked this hotel months in advance before the switch of ownership from Address to Kempinski and that cause issues with the reservation. By right, they should have reached out to me to advise of the change but nobody did so there was a lot of back-and-forth with the reservation department until someone from management step in to rectify the situation. Overall it’s not a big issue but for some reason, the reservations department was really bad in communication. Perhaps due to poor training. \n\nNext while my reservation says “Club King Premier Room” which entitles me to the use of the club lounge, what the hotel did not mentioned was that the club lounge was closed during Ramadan. They didn’t even mention this to me upon my checked in and I have to contact the staff to get clarification. This should have been informed to me upon check-in. So instead of club access, the hotel designated certain F&B outlets to have evening cocktail, afternoon tea and lunch. Again, at some of these venues, the staff were not informed of these benefits and they have to check with their manager who in turn have to check with frontdesk and so on and so off… \n\nMy lunch at the Nai restaurant was a comical experience, one of the funniest in my travels. The Nai restaurant was an outdoor sheltered restaurant with air condition on while being open air ( why can’t they use a fan instead? ) which is weird. I got a free set lunch as part of the “club benefit”. I was told I can choose from a selection of starters, main course and dessert. When I asked for the menu, there was none. Instead the waiter proceed to recite the entire menu to me including description a total of 12 items. Praise to him for the memory prowess but is it too much work to just print a menu? \n\nThe food was just OK. The Lentil soup was bad but the seabass main course was fine. However, it was hot and uncomfortable sitting outside and I was soon join by unwelcomed “companions” who wanted a share of the food, aka flies. Soon after my appetizer arrive, there was a “mini swarm” of flies cycling around me. The same waiter apologize and I asked if he was able to provide me a candle that can chase away the flies, typically use in Southeast Asia. Instead he said he will call “pest control”. Well, the pest control arrive which is another hotel staff with what looks like a tennis racket. Then he proceeded to use the device to swap the files, killing or electrocuting them in the process while I am having my meal. Anyway, another group of annoying insects soon join my meal, small mosquitoes. I decided to end my meal early, take away my dessert and left. Later I find out apparently using those racket to swap at flies is a common thing in Dubai as I saw someone did that in a supermarket. \n\nAs I have mentioned earlier, my first room had issues and a customer service manager quickly intervene to rectify the situation. A room change was arranged and I got a better room and also as an apology, I was presented with a nice plate of fruits and local tidbits presumably as a sign of apology. \n\nOther than the above issues, staff were generally responsive to service calls and polite. The house keeping did an excellent job to keep the room clean while any service requests were promptly attended to. And when issues did arise, the management was quick to intervene and perform service recovery. However, it would have been better if those issues did not arise in the first place. Most of the service issues were really down to communication. \n\nI should also single out the concierge team for praise. They were very quick in their communication and replying to my questions and often go out of the way to ensure I have a comfortable and trouble free visit. Example is their arrangement of hotel limos and drivers for my transportation needs despite me not asking so as they want to ensure my experience is seamless and troublefree. Particular outstanding are Mr Kajib and Mr William Ceasar. A big plus point to the overall service of the hotel. \n\nConclusion\n\nThe Kempinski should be regarded as a new hotel due to the change of management with still teething issues despite the physical building being in existence for a while and it shows. I supposed they will need time to iron them out. It has weak F&B and poor coordination between departments when come to guest benefits but service recoveries minimize and eradict any potential unpleasant experience. If one needs to be in downtown and/or have convenient access to the Dubai mall, the location is unbeatable. . Overall I rate it 4 out of 5. If one needs to be in downtown and/or have convenient access to the Dubai mall, the location is unbeatable.",
      "title": "Re : Many Issues but Overall Still Good",
      "trip_type": "Solo travel",
      "travel_date": "2024-04-30",
      "user": {
        "username": "BENLEE123",
        "user_location": {
          "id": "294265",
          "name": "Singapore"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/05/ad/41/e3/benlee123.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/05/ad/41/e3/benlee123.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/05/ad/41/e3/benlee123.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/05/ad/41/e3/benlee123.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/05/ad/41/e3/benlee123.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 945692964,
        "title": "Owner response",
        "text": "Dear BENLEE123,\n\nMarhaba from Kempinski Central Avenue Dubai.\n\nThank you for sharing your detailed feedback regarding your recent stay at our hotel. We sincerely apologize for the challenges you encountered during your time with us, and we appreciate your patience and understanding as we address these issues.\n\nWe extend our sincerest apologies for any inconvenience you experienced during your stay. Immediate action has been taken to ensure this won't repeat in the future. We are glad to have promptly addressed the issue to ensure your comfort. Regarding communication, we are actively working to enhance our processes to prevent similar issues from arising in the future. Your feedback is highly valued and appreciated.\n\nWe are pleased to hear that our concierge team, particularly Mr. Kajib and Mr. William Ceasar, provided exceptional service and made efforts to enhance your experience. We will commend them for their outstanding dedication to ensuring your comfort and satisfaction.\n\nOnce again, we apologize for the shortcomings you encountered and thank you for bringing them to our attention. We hope to have the opportunity to welcome you back in the future and provide you with a truly exceptional experience that reflects the true essence of Kempinski hospitality.\n\nBest Regards, \n\nSity Nurhayati\nManagement Office\n",
        "lang": "en",
        "author": "Sity Nurhayati",
        "published_date": "2024-04-07T09:06:31Z"
      }
    },
    {
      "id": 945581540,
      "lang": "en",
      "location_id": 1599623,
      "published_date": "2024-04-06T11:39:47Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d1599623-r945581540-Reviews-Kempinski_Central_Avenue_Dubai-Dubai_Emirate_of_Dubai.html?m=66827#review945581540",
      "text": "Absolutely lovely experience at Iftar buffet! Amazing food selection and quality in a fantastic ambiance. Service is exceptional and need to give a shout out to Stehfanny and Rathish who, along with their colleagues, did a wonderful job of looking after us. Islam also did a great job ensuring we were well taken care of. Would rank this as one of the best iftars in town by far.",
      "title": "Top notch Iftar in Dubai - highly recommended",
      "trip_type": "Couples",
      "travel_date": "2024-04-30",
      "user": {
        "username": "dinasabra",
        "user_location": {
          "id": "295424",
          "name": "Dubai, Emirate of Dubai"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f0/48/default-avatar-2020-15.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f0/48/default-avatar-2020-15.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f0/48/default-avatar-2020-15.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f0/48/default-avatar-2020-15.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f0/48/default-avatar-2020-15.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 945688665,
        "title": "Owner response",
        "text": "Dear dinasabra,\n\nMarhaba from Kempinski Central Avenue Dubai.\n\nThank you for your glowing review of our Iftar buffet. We are thrilled to hear that you had an absolutely lovely experience and enjoyed the fantastic ambiance and food selection.\n\nIt is wonderful to know that our team, including Stehfanny, Rathish, and Eslam, provided exceptional service and ensured that you were well taken care of throughout your visit. We will be sure to pass on your kind words to them, as they will be delighted to hear of your appreciation.\n\nYour recommendation means a lot to us, and we are honored to be ranked as one of the best Iftars in town. We look forward to welcoming you back for more memorable experiences in the future.\n\nBest Regards, \n\nSity Nurhayati\nManagement Office\n",
        "lang": "en",
        "author": "Sity Nurhayati",
        "published_date": "2024-04-07T08:31:01Z"
      }
    },
    {
      "id": 945491710,
      "lang": "en",
      "location_id": 1599623,
      "published_date": "2024-04-05T16:16:45Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d1599623-r945491710-Reviews-Kempinski_Central_Avenue_Dubai-Dubai_Emirate_of_Dubai.html?m=66827#review945491710",
      "text": "I have been in this place it so beautiful and nice for meeting for all kind of business \nThae cafe is giving a wonderful service specially a waitress called Hte she always smaily I suggest this place to all of my friends and I will bring more business partners",
      "title": "Customer services",
      "trip_type": "Business",
      "travel_date": "2024-03-31",
      "user": {
        "username": "abdulqaderr2024",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e3/1f/default-avatar-2020-46.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e3/1f/default-avatar-2020-46.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e3/1f/default-avatar-2020-46.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e3/1f/default-avatar-2020-46.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e3/1f/default-avatar-2020-46.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 945688526,
        "title": "Owner response",
        "text": "Dear abdulqaderr2024,\n\nMarhaba from Kempinski Central Avenue Dubai.\n\nThank you for your kind words about your recent experience at our establishment. We are delighted to hear that you found our venue to be beautiful and suitable for all kinds of business meetings.\n\nWe are especially grateful for your commendation of Htet's exceptional service. Providing a welcoming and attentive experience for our guests is a top priority for us, and we are pleased to hear that Htet's efforts contributed to your enjoyment.\n\nYour recommendation means the world to us, and we look forward to welcoming you back along with your friends and business partners for more memorable experiences in the future.\n\nBest Regards, \n\nSity Nurhayati\nManagement Office\n \n",
        "lang": "en",
        "author": "Sity Nurhayati",
        "published_date": "2024-04-07T08:29:56Z"
      }
    },
    {
      "id": 945460784,
      "lang": "en",
      "location_id": 1599623,
      "published_date": "2024-04-05T11:32:37Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d1599623-r945460784-Reviews-Kempinski_Central_Avenue_Dubai-Dubai_Emirate_of_Dubai.html?m=66827#review945460784",
      "text": "I like the atmosphere and place is so pretty with lots of decorations and staff are so helpful with their service . Lakshmi and lailae was the best ladies took care of me and my family . Please visit here you will definitely love the environment",
      "title": "Iftar",
      "trip_type": "Family",
      "travel_date": "2024-04-30",
      "user": {
        "username": "Binthani",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e5/66/default-avatar-2020-53.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e5/66/default-avatar-2020-53.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e5/66/default-avatar-2020-53.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e5/66/default-avatar-2020-53.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e5/66/default-avatar-2020-53.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "3": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 945687918,
        "title": "Owner response",
        "text": "Dear Binthani,\n\nMarhaba from Kempinski Central Avenue Dubai.\n\nThank you for taking the time to share your experience of our Iftar event. We are thrilled to hear that you enjoyed the atmosphere and ambiance of our venue, as well as the attentive service provided by our staff.\n\nYour kind words about Lakshmi and Laila are greatly appreciated, and we will be sure to pass on your compliments to them. It warms our hearts to know that they went above and beyond to take care of you and your family during your visit.\n\nWe are delighted that you found our environment to be enjoyable and inviting, and we hope to have the pleasure of welcoming you back for another memorable experience in the near future.\n\nBest Regards, \n\nSity Nurhayati\nManagement Office\n",
        "lang": "en",
        "author": "Sity Nurhayati",
        "published_date": "2024-04-07T08:24:38Z"
      }
    }
  ]
}