{
  "data": [
    {
      "id": 935906964,
      "lang": "en",
      "location_id": 1804015,
      "published_date": "2024-01-29T03:43:00Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d1804015-r935906964-Reviews-Emirates_Grand_Hotel-Dubai_Emirate_of_Dubai.html?m=66827#review935906964",
      "text": "Worst hotel experience I have ever seen . The room has cockroaches . A lot of issues like tub broken , so bad behaviour of manager named HAMAD. I have never seen a behaviour of a manager like this in my life . After doing a mail to the hotel  they denied cancellation even after the cockroaches are there in hotel rooms . Attached mail done to the hotel and reply received",
      "title": "Worst hotel ever stayed in life",
      "trip_type": "Business",
      "travel_date": "2024-01-31",
      "user": {
        "username": "RaghavK185",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e4/a9/default-avatar-2020-50.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e4/a9/default-avatar-2020-50.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e4/a9/default-avatar-2020-50.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e4/a9/default-avatar-2020-50.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e4/a9/default-avatar-2020-50.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 933856110,
      "lang": "en",
      "location_id": 1804015,
      "published_date": "2024-01-12T22:51:45Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d1804015-r933856110-Reviews-Emirates_Grand_Hotel-Dubai_Emirate_of_Dubai.html?m=66827#review933856110",
      "text": "In my visit of Emirates grand hotel. My experience was not superb but it was good . Special problem was receptionist rude behavior and lift issue but otherwise everything was perfect specially housekeeping service and their young attendant Noor and her partner Qymddin . They both were superb and fast . Her attitude and behavior towards the guest was very polite and gentle . I'm amazed by them . Will see again for stay ....",
      "title": "Rooms",
      "trip_type": "Business",
      "travel_date": "2024-01-31",
      "user": {
        "username": "manahili2024",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ea/b2/default-avatar-2020-69.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ea/b2/default-avatar-2020-69.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ea/b2/default-avatar-2020-69.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ea/b2/default-avatar-2020-69.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ea/b2/default-avatar-2020-69.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 923799111,
      "lang": "en",
      "location_id": 1804015,
      "published_date": "2023-10-31T08:25:55Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d1804015-r923799111-Reviews-Emirates_Grand_Hotel-Dubai_Emirate_of_Dubai.html?m=66827#review923799111",
      "text": "Respected reader,\n\nMyself Bhargavi Mahesh and I had stayed at the emirates grand hotel during 7th oct to 12th oct 2023.\nI would like to bring in to your notice that this is the worst experience me and my family had.\nI am sorry to say this but couple of time they disappointed us.\nWe will definitely recommend a NO NO for anybody who wants to choose this place for their stay.\nBelow are the concerns we had and I am really unsure on what basis the general manager is trained or validated their staff.\n1) Mr Anshuman is UNFIT to be serving in the hospitality industry Itself, he doesn’t even look at the guest while speaking and he allotted us a room with full of sanitary smell and we had requested a change which he denied later saying there are no rooms available , this was despite we requesting him multiple times because we had a six month baby along with us and we were worried about infections.\n2) We had asked for a bath mat which was not provided three days . the housekeeping says their is no stock of mats which is very dishonouring to hear.\n3) The TV was not working in the room and when asked the team says IT team is not available and they fixed it only after second day.\n4) The person who was offering welcome drink didn’t even bother to provide it to us and he was busy on his phone\n5) And the most disgusting is how Amaila speaks when we told her the concerns she was least bothered and said you can talk to housekeeping that’s it . she was not bothered about the guest . I guess these guys are not trained well.\n6) Lastly some person in front desk changed our room and then we were shifted from 310 to 1605 when we were headed out on my birthday they again delayed it and asked us to pack so that they will shift the luggage but unfortunately when we came back around 2am to hotel their was no luggage shifted so careless the staff is and my baby was hungry and we had to wait for an hour which was the most worst condition for any parent which would give them extra stress on a vacation.\n7) A visitor friend of mine had left two small gift bags which had a doll and chocolate for my infant which was never handed over to us while we were checking out.  Ramesh is unorganised and did not bother to check as well.\nWhen we again went back to it hotel to collect the parcel from all the way from Marina ,post asking twice they said only one bag and they missed the other one and confirmed very confidently that it’s just a single package.\nWhen we informed our friend regarding same They went back to collect the bag as we had left for Abu dabi and the staff  said the we did not ask for the bag at reception are these guys so ignorant that the basic information is not passed to the guest or no proper mechanism is followed during check out. Nor the second time.\nThe WORST stay we had .\nThey lag behind in everything.\nMost wontedly they do not answer the reception calls at all even if you call them 100 times \nYou can try this from number displayed on their website\nThey spoilt our vacation and my birthday evening which can never be forgiven.\nI would like to know why the GM is not active and talking to guests on Floor randomly or may be even he is leisure this way.\n\nOverall I would like to conclude giving them negative marks for the pathetic service and hospitality.\nThey spoiled my special day!\n",
      "title": "I would never recommend this hotel to any one . Worst front dusk team, unfit to be in hospitality ",
      "trip_type": "Family",
      "travel_date": "2023-10-31",
      "user": {
        "username": "Fearless15758277607",
        "user_location": {
          "id": "297628",
          "name": "Bengaluru, Bangalore District, Karnataka"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f2/59/default-avatar-2020-24.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f2/59/default-avatar-2020-24.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f2/59/default-avatar-2020-24.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f2/59/default-avatar-2020-24.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f2/59/default-avatar-2020-24.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 922392360,
      "lang": "en",
      "location_id": 1804015,
      "published_date": "2023-10-22T03:49:40Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d1804015-r922392360-Reviews-Emirates_Grand_Hotel-Dubai_Emirate_of_Dubai.html?m=66827#review922392360",
      "text": "We had a great time staying here...the staff was helpful specially Rex, he helped us a lot during our stay.. although the room service needs to be taken care of... Room cleanliness was good...view from the room and access to metro is good",
      "title": "Very good",
      "trip_type": "Family",
      "travel_date": "2023-10-31",
      "user": {
        "username": "TrailBlazer824908",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ed/00/default-avatar-2020-4.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ed/00/default-avatar-2020-4.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ed/00/default-avatar-2020-4.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ed/00/default-avatar-2020-4.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ed/00/default-avatar-2020-4.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 921019723,
      "lang": "en",
      "location_id": 1804015,
      "published_date": "2023-10-12T20:00:15Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d1804015-r921019723-Reviews-Emirates_Grand_Hotel-Dubai_Emirate_of_Dubai.html?m=66827#review921019723",
      "text": "This complaint is especially for Ramesh at Reception, Arif at Security and Ahmed, the duty manager for night of 12/10/2023.\nI was in a group of 3 heading to the hotel to celebrate the Bday of the guest staying at the their hotel. \nWhen arrived at the the hotel, there was no one who did the greeting or assisting with the directions. We headed to the elevators where we had met a female Security officer on the phone ignoring us and the other guests at that moment. The Security lady then had noticed us and requested in why we had visited the location, once informed she told us to go the counter and register prior going upstairs to the room.\nOnce we had reached the counter, the receptionist, Ramesh was so misogynistic and rude and treated people like trash. He spoke to us and other guest like a king. When we had provided the ID. He had no smile or communication with us. He asked for the room number and told to give all three ID. Then when proceeding to provide the ID, 2 hard copies and 1 soft copy was presented. The soft copy was rejected because that was not acceptable. We requested that how come it is acceptable that hookers and talabat driver are going inside the lift and to room while visitors who are here to celebrate a bday had to scan the ID.\nThe Security supervisor, Arif was called downstairs and told to explain the situation. He is so unprofessional and had a pathetic attitude and reply about valid proof that we had provided for his against our concern in the matter. When told that prostitutes, delivery drivers and other in-house guests were bringing people in without scanning to the rooms whilst there Security was on the phone, and asked the question, how is this allowed? Arif had replied by saying I DONT KNOW. I don't know who made him supervisor but this is the worst leader I might have seen in my life.\n\nThen we had to call our friend from the room where she had come down to let know of the situation and take responsibility on the matter. Even then Ramesh and Arif were arguing and showing attitude to us, at this point, arif had called the duty manager, Ahmed, who had listened to the conversation and gave no solution and when brought up with the same evidence regarding prostitutes, delivery drivers and other in-house guests  bringing people in without scanning to the rooms. Ahmed had replied we will check CCTV and let us know.\n\nThen after spending 1 hour of transport and traffic, we had gotten the physical ID and proceeded upstairs. Whilst doing so, there was a another individual who hadn't scanned any thing and walked in to the hotel and to the elevators and proceeded.\n\nI need to know does this rule only exist for some guests??\n\nMost importantly, I will be highlighting Ramesh from Reception and Arif from Security. These two individuals are worst hoteliers I have ever met in my entire life and am ashamed that the hotel would even hire them and keep them working there.\n\nAlso when requested for glasses at the room. The operator had declined our call 3 times and after getting through to her to bring 6 glasses to the room. She had claimed that she inform housekeeping to bring it up. After 1 and half hours, the cups are still not here and I had to call 4 times more to follow up on the matter. When the glasses had arrived. It was 3 alokozay tea cups and tall glass. The hotel didn't even have enough glasses to provide us. Also I was told from the friend who is staying at the hotel that last night they had delivered paper cups which is given when getting chai from shops in dubai.\n\nThis is absolutely and the worst hotel that I have ever experienced in dubai. I hope that no one has to stay here and experience this kind rotten service.",
      "title": "The worst experience of my life",
      "trip_type": "Friends getaway",
      "travel_date": "2023-09-30",
      "user": {
        "username": "shizank2023",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e9/60/default-avatar-2020-64.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e9/60/default-avatar-2020-64.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e9/60/default-avatar-2020-64.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e9/60/default-avatar-2020-64.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e9/60/default-avatar-2020-64.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Service"
        }
      }
    }
  ]
}