{
  "data": [
    {
      "id": 945709271,
      "lang": "en",
      "location_id": 206921,
      "published_date": "2024-04-07T11:11:40Z",
      "rating": 5,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d206921-r945709271-Reviews-NH_Collection_Barcelona_Gran_Hotel_Calderon-Barcelona_Catalonia.html?m=66827#review945709271",
      "text": "Had an absolutely amazing Easter long weekend break in Barcelona, and staying in this hotel really made it for us (I had some anxiety after booking as read some reviews) but what made it was the location, room and friendliness of the staff. \n\nOur room wasn’t ready at approx 12.30 but that’s understandable as checkin not until 3. Cases stored safely and we got checked in still and when we came back at approx 6pm the cases had been taken upto the room (how excellent!) the room was very big clean and I loved how the bathroom (also big) was outside of the bedroom area as was the closet. Also a lovely double bed not two singles pushed together! Also at last a huge glam wall mirror with nothing in front of it! Coffee facilities a fridge and Alexa! Also an Easter treat. \n\nWe went upto the rooftop bar before heading back out and wow wow wow!! This was the icing on the cake for us. It didn’t immediately look like it but lots of stools around the side with views over the city , sagrada familia even! And the Tibidabi church on the very top of the mountain straight in front, at night all lit up! But the best of all were the drinks and the service from Andrea and his team who we got to know. \n\nWe’ve been to many bars all over some lovely rooftops etc but this was the most friendly bar we had been too for a very very long time and it was really appreciated to have been genuinely taken care of. Please take time to speak with the guys they are doing an amazing job and can give lots of great tips on places to go. The reception and front of house were also very good and took us up to see the pool as we couldn’t find it due to some renovations which didnt affect our stay at all. The pool looked amazing but whilst sunny not quite warm enough for a dip yet. So sorry I didn’t have cash to tip the guy that showed us and took care of our cases but he was also amazing and we saw him dashing around out front getting guests cabs. The hotel is in a very nice spot very close to all shops from Gucci to Zara to Primark. Very good tapas restaurants bars nearby the area and surrounding streets are very nice yet so central. Easily walk to metros, open top bus etc etc We very easily got to cable car, using metro, parc guell and sagrada familia. 2 Gaudì houses are just up and around the block. Go to the port and beach for a walk along prom, and gothic quarter and all the small streets. Just so much to do. So sad that before we went and whilst there , many warned us of pick pockets. We didn’t see anything bad, the streets were continually being cleaned and spotless. Like anywhere in the world you have to have your senses about you. We felt the airport lacked direction to the metro and we wasted well over an hour getting to the hotel. Got a cab back to airport took less than 20 mins and approx 23 euros so I wouldn’t waste your time doing the metro from airport. We landed in terminal 2c and it was quite a walk  to the station and very hard to find, the signs were not good and no one around to ask outside. Then we had to change and it wasnt like London a quick change over, so get a cab to and from airport to hotel or we noticed a bus ran outside terminals. \n\nBack to hotel make sure you say hello to the rooftop bar team they are doing an amazing job and hope they are getting fabulous recognition from NH Hotels as they throughly deserve it! All the best guys hope to be back some day!",
      "title": "Fab location, clean friendly and best Rooftop bar/service",
      "trip_type": "Couples",
      "travel_date": "2024-03-31",
      "user": {
        "username": "274lcl",
        "user_location": {
          "id": "186216",
          "name": "United Kingdom"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/01/2e/70/7f/avatar066.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/01/2e/70/7f/avatar066.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/01/2e/70/7f/avatar066.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 944306600,
      "lang": "en",
      "location_id": 206921,
      "published_date": "2024-03-28T17:46:31Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d206921-r944306600-Reviews-NH_Collection_Barcelona_Gran_Hotel_Calderon-Barcelona_Catalonia.html?m=66827#review944306600",
      "text": "Stayed at the hotel Calderone for three nights. The room was nice and large, we had a great view, and the breakfast was the best of all the hotels in Spain that we stayed at. A great location for seeing the sites in Barcelona.\n\nI took off one star due to the lighting in the room, especially the bathroom. It was very dark in the bathroom. \n\nOverall, I would recommend this hotel. It was very comfortable and enjoyable.",
      "title": "Nice hotel!",
      "trip_type": "Couples",
      "travel_date": "2024-03-31",
      "user": {
        "username": "ih8hiplaces",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e9/ef/default-avatar-2020-66.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e9/ef/default-avatar-2020-66.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e9/ef/default-avatar-2020-66.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e9/ef/default-avatar-2020-66.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e9/ef/default-avatar-2020-66.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 944362794,
        "title": "Owner response",
        "text": "Dear Guest,\n\nThank you for choosing NH Collection Gran Hotel Calderón in your recent visit to Barcelona and for taking the time to share the comments about your stay.\nIt is a great pleasure to know that you enjoyed your stay with us. Thank you for your kind words about our breakfast buffet.\nWe hope to welcome you back in the near future.\nBest Regards,\n\nJavier Morales\nGuest Relations \nNH Collection Gran Hotel Calderón\n\n",
        "lang": "en",
        "author": "Laura Palomeras",
        "published_date": "2024-03-29T07:35:09Z"
      }
    },
    {
      "id": 943565053,
      "lang": "en",
      "location_id": 206921,
      "published_date": "2024-03-23T22:07:58Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d206921-r943565053-Reviews-NH_Collection_Barcelona_Gran_Hotel_Calderon-Barcelona_Catalonia.html?m=66827#review943565053",
      "text": "on a high floor, 2 beds and it comes with Culinary amenity upon arrival .\nWe arrived after over 24 hrs of traveling and after we checked in at the front desk and they collected the deposit they informed me that the room is not ready so we waited and no one came or called to let us know that the room is ready .. we found out 1.5 hr later when I went again to the front desk to check the status!\nThe high floor was the 3rd floor .. horrible views to a construction site , instead of going to relax after the long flight, we had to hear the construction noise and the construction workers screaming the whole time.\nSheets were so dirty and have holes all over. \nWeed smell in the hallway.\nThey left a small chocolate as the (Culinary amenity upon arrival) \nI informed the front desk of all the complaints and showed them pictures of dirty sheets. They had me meet with the manager and all she could help with was to separate the beds in the room to have 2 beds or DOWNGRADE my room .\nI agreed to separate the beds and refused the downgrade and her offer to give me a voucher for a free drink at one of the restaurants at the hotel to compensate for all the dirty sheets, construction noise and everything else that was going wrong .\nBeen 3 days and I'm still waiting for the beds to be separated!! Been sleeping on the dirts very uncomfortable pull-out sofa .\nWill never book in NH hotel ever again.",
      "title": "Dirty sheets/ noise",
      "trip_type": "Friends getaway",
      "travel_date": "2024-03-31",
      "user": {
        "username": "694fayj",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ee/68/default-avatar-2020-9.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ee/68/default-avatar-2020-9.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ee/68/default-avatar-2020-9.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ee/68/default-avatar-2020-9.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ee/68/default-avatar-2020-9.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 944269539,
        "title": "Owner response",
        "text": "Dear Fayj,\n\nThank you for choosing NH Collection Gran Hotel Calderón and for sharing a review, this is very useful for us to improve our service and facilities for future guests.\n\nHowever, we certainly regret the situation encountered with the room. Please, accept our most sincere apologies in case of any inconvenience caused.\nOur objective is to exceed guests' expectations and we are deeply sorry to know that unfortunately this time have not meet.\n\nWe hope to have the opportunity to welcome you back to recover your trust with NH Collection Gran Hotel Calderón.\n\nBest Regards,\n\nJavier Morales\nGuest Relations\nNH Collection Gran Hotel Calderón\n\n",
        "lang": "en",
        "author": "Laura Palomeras",
        "published_date": "2024-03-28T12:02:42Z"
      }
    },
    {
      "id": 943331641,
      "lang": "en",
      "location_id": 206921,
      "published_date": "2024-03-21T23:24:47Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d206921-r943331641-Reviews-NH_Collection_Barcelona_Gran_Hotel_Calderon-Barcelona_Catalonia.html?m=66827#review943331641",
      "text": "Our experience both from the city and the hotel were memorable and really one of the kind. The services from this hotel are exceptional and ones that trully characterize a five stars classificitation. \nFirst of all the room was spacious and organized to the gratest detail. I was really impressed with the personal Alexa assistance, available in the room and fully equiped to offer us any detail for our stay.\nThe breakfast was the best and it included everything necessary for us to boost our day and explore the city with great energy. \nThe environment and the decoration of the hotel was magical.\nAnd last but not least the staff of the loby, the reception, as well as of the breakfast area, were really kind and available to assist us in any possible way. I would like to especially thank Giorgia, who was really kind to offer us any insight of the city we would ask and even arranged for us a table booking to an amazing restaurant that some friends told us about. Giorgia we really apreciate all of your assistance and we would be happy to see you in Greece.",
      "title": "A memorable experience",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "G_kolokythas",
        "user_location": {
          "id": "262046",
          "name": "Kallithea, Attica"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ea/b2/default-avatar-2020-69.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ea/b2/default-avatar-2020-69.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ea/b2/default-avatar-2020-69.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ea/b2/default-avatar-2020-69.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ea/b2/default-avatar-2020-69.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 944269422,
        "title": "Owner response",
        "text": "Dear Kolokythas\n\nThank you very much for sharing such a nice review about your recent visit at NH Collection Gran Hotel Calderón.\nWe are pleased to know that you enjoyed your stay with us. Thank you for your kind words about the service and the staff. We will certainly pass your compliments to them. Thank you for your kind words about our breakfast buffet.\nHere you have your home away from home every time you decide to visit Barcelona.\nWe look forward to welcome you again.\n\nBest Regards,\nJavier Morales\nGuest Relations \nNH Collection Gran Hotel Calderón\n\n",
        "lang": "en",
        "author": "Laura Palomeras",
        "published_date": "2024-03-28T12:01:25Z"
      }
    },
    {
      "id": 942726471,
      "lang": "en",
      "location_id": 206921,
      "published_date": "2024-03-18T03:03:40Z",
      "rating": 3,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d206921-r942726471-Reviews-NH_Collection_Barcelona_Gran_Hotel_Calderon-Barcelona_Catalonia.html?m=66827#review942726471",
      "text": "The reception staff were great\nBreakfast was average with a good selection \nRooms were quiet and very clean\nIt was my friends birthday and they did the room nice for that\nFantastic location\n\nSadly the pool was closed and this was very disappointing as we specifically booked this hotel because it had a pool but we were unable to use it.  It would have been good if they let us know this before our stay",
      "title": "The Pool Was Closed",
      "trip_type": "Friends getaway",
      "travel_date": "2024-03-31",
      "user": {
        "username": "spimsy",
        "user_location": {
          "id": "616285",
          "name": "Newtown, Powys, Wales"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/24/1d/5b/81/spimsy.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/24/1d/5b/81/spimsy.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/24/1d/5b/81/spimsy.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/24/1d/5b/81/spimsy.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-m/1280/24/1d/5b/81/spimsy.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 942793910,
        "title": "Owner response",
        "text": "Dear Guest,\n\nThank you for choosing NH Collection Gran Hotel Calderón in your recent visit to Barcelona and for taking the time to share the comments about your stay.\n\nIt is a great pleasure to know that you enjoyed your stay with us. Thank you for your kind words about our breakfast buffet, the service and the staff. We will certainly pass your compliments to them. \n\nAs you mention, the hotel has a great location in the heart of Barcelona, close to the most important attractions, shops, restaurants and public transport. We are truly delighted you enjoyed your stay in Barcelona\n\nWe hope to welcome you back again and that you can have the opportunity to enjoy our pool. \n\nBest Regards,\n\nLidia Olmedo\nGuest Relations \nNH Collection Gran Hotel Calderón",
        "lang": "en",
        "author": "Nicola Herzberg",
        "published_date": "2024-03-18T12:50:40Z"
      }
    }
  ]
}