{
  "data": [
    {
      "id": 944218293,
      "lang": "en",
      "location_id": 228544,
      "published_date": "2024-03-28T03:36:00Z",
      "rating": 3,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d228544-r944218293-Reviews-Catalonia_Sagrada_Familia-Barcelona_Catalonia.html?m=66827#review944218293",
      "text": "Hotel is in a great location, within walking distance of the Sagrada Familia. Staff are really helpful and friendly, always smiling. The room was basic and a bit shabby, but the beds were very comfortable and the shower was great. We didn’t have a balcony, but the window opened nice and wide to let some cool air in, which was welcome as there was no A/C.",
      "title": "Okay hotel, super comfy beds!",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "Jaysee1980",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1d/53/cb/f0/jaysee1980.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1d/53/cb/f0/jaysee1980.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1d/53/cb/f0/jaysee1980.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/1d/53/cb/f0/jaysee1980.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 943346878,
      "lang": "en",
      "location_id": 228544,
      "published_date": "2024-03-22T04:01:07Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d228544-r943346878-Reviews-Catalonia_Sagrada_Familia-Barcelona_Catalonia.html?m=66827#review943346878",
      "text": "Checked in earlier than expected, only to be given a double bed instead of a twin. (I had emailed a couple of weeks prior to be told we'll get what we get)\nWe then were issued a twin room. It was small, beds pushed together (?) So after a small re arrangement settled in. The room was very warm and no aircon available until end of April. \nDesk and chair plus a luggage stand. Double wardrobe with a safe.\nHad a small balcony with a table and chairs.\nNice sized bathroom with shower over the bath, large vanity unit and triple mirror. No ventilation though so got very steamy. \nShower was excellent but the shower door isn't long enough so care needed to be taken getting out.\nComplimentary shower gel, shampoo, soap, tissues and a shoe horn.\nLovely bright white fresh towels of a decent size.\nBeds were very comfortable with fresh linen.\nExpect noise from the streets so bring ear plugs!! This city never sleeps as to be expected.  Trash bins are emptied at gone 10pm and are very noisy. \nHotel is situated between Encants and Clot metro stations, very close by.\nIf you are like us and don't like house keeping every day, the use of the \"do not disturb \" sign is ignored. (We've had issues with thefts in other hotels before so inly like housekeeping to come once per week. Even after speaking to Reception they still entered. \nAll in all, we'd recommend this hotel. \nThere is no kettle un the standard room, Jet2 do advertise this but we had lovely coffee from The Catalan Sandwich on the other side of the street each morning.",
      "title": "Not too bad at all",
      "trip_type": "Friends getaway",
      "travel_date": "2024-03-31",
      "user": {
        "username": "joolsw726",
        "user_location": {
          "id": "1526974",
          "name": "Yorkshire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/2b/ad/3a/a5/caption.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/2b/ad/3a/a5/caption.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/2b/ad/3a/a5/caption.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/2b/ad/3a/a5/caption.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/2b/ad/3a/a5/caption.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 945844586,
        "title": "Owner response",
        "text": "Dear Jools W,\nThank you for the time spent sharing the experience of your stay at the Catalonia Sagrada Familia Hotel. Comments like yours are very constructive for the establishment and very useful for our future visitors.\nWe are pleased to know that you were able to check in earlier than expected, it is a facility that if occupancy allows it we can offer our guests.\nWe will review your advice regarding kettles as they are always available in our Superior Premium rooms.\nReading that you recommend us is the best feedback we can have, we love it, we hope you can visit us again on another occasion.\nKing regards",
        "lang": "en",
        "author": "Antonio Sánchez",
        "published_date": "2024-04-08T10:56:14Z"
      }
    },
    {
      "id": 942323717,
      "lang": "en",
      "location_id": 228544,
      "published_date": "2024-03-14T16:43:14Z",
      "rating": 3,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d228544-r942323717-Reviews-Catalonia_Sagrada_Familia-Barcelona_Catalonia.html?m=66827#review942323717",
      "text": "Recently spent 4 days at the hotel, the location is possibly the main advantage, it’s a 10/15 min walk to the Sagrada Familia & it’s main metro is less than a 5 min walk, also taxis outside everyday if needed. The room was very outdated - browns & creams with no character at all, they do need an upgrade, no tea/coffee facilities in the room either - we never had breakfast as it was 16 euros each, when across the road facing the hotel you can get a breakfast deal including coffee for 4 euros. My main annoyance was the cleaners level of noise - it woke us up 3 times, it sounded like furniture was being moved - the hoover was being banged against everything in the rooms & the loudness was just disrespectful in my opinion - people have signs to do not disturb for a reason and the level of noise was ridiculous, it really could have been prevented. I’ve seen a lot of complaints about the cleaners & a lot of responses from the hotel - I highly doubt all these people are wrong, just a thought. The other staff were pleasant enough, the man on reception who greeted us was so helpful and drew on the map places to try/avoid & must see - I wish we got his name, he had a ring that said Barcelona… :) bar staff very nice. Two men at night were no help to anyone, swearing at each other and really just being unhelpful and uninterested to help anyone. We wouldn’t choose to return, purely because you go away to have a good sleep a good breakfast and expect some regard of respect & this hotel doesn’t cater for this, apart from a very small amount of staff - which again is wrote on most peoples reviews.",
      "title": "Better hotels in the city",
      "trip_type": "Couples",
      "travel_date": "2024-03-31",
      "user": {
        "username": "travelbuggin1689",
        "user_location": {
          "id": "186534",
          "name": "Glasgow, Scotland"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/2b/a1/4d/20/caption.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/2b/a1/4d/20/caption.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/2b/a1/4d/20/caption.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/2b/a1/4d/20/caption.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-m/1280/2b/a1/4d/20/caption.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 944958648,
        "title": "Owner response",
        "text": "Dear travelbuggin1689,\nThank you for sharing the experience of your stay through the Tripadvisor traveler website. This website is very useful for advising future visitors about our facilities.\nRegarding the decoration of the room, this is chosen by an entire image team of our chain and for them the combination and range of colors seemed characterful and appropriate and the average score for these rooms in terms of decoration is a 9, we are sorry that it was not completely to your liking.\nThe ketel in this hotel is offered in superior premium rooms which of course have a different price but there is a management order to obtain it expressly in case a client requires it as an exception. In your case there has been no such request in the 4 days that you were here.\nRegarding the price of breakfast, we have nothing to say, it is a Buffet breakfast that is made up of more than 200 product references, of great quality and freshness and the price is what is considered by the catering department of Catalonia hotels. Logically, in the bar across the street, like in bars anywhere, you can find a coffee and a croissant for €4.\nWe want to clarify that the maids' hours are from 9:30 a.m. to 3:00 p.m. to clean both clients and departure rooms. To ensure that the client who enters that day can occupy the room before 3:00 p.m. If you have heard noises from the maids, we understand that you were sleeping after 09:30 in the morning with the bad luck that the maid has started working next to your room, as has surely happened to the clients that you say they have made similar reviews. We are very sorry for the inconvenience reported but it is inevitable that the rooms must be cleaned in the morning.\nRegarding your references to the staff, the daily work is to ensure that each of our guests is attended to, your indication will help us improve the service in this sense to offer the greatest possible excellence.\nWe are very sorry that with all the positive things you have said about our establishment they are not enough to outweigh the negative ones and that therefore you will not return to our establishment. For our part, we would be delighted to welcome you again and make you feel perfect with us.\nBest regards",
        "lang": "en",
        "author": "Antonio Sánchez",
        "published_date": "2024-04-02T13:03:01Z"
      }
    },
    {
      "id": 940998541,
      "lang": "en",
      "location_id": 228544,
      "published_date": "2024-03-06T05:44:26Z",
      "rating": 3,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d228544-r940998541-Reviews-Catalonia_Sagrada_Familia-Barcelona_Catalonia.html?m=66827#review940998541",
      "text": "We stayed one night at Catalonia Sagrada familia hotel, forgot my phone charger plugged in the wall, curiously it had disappeared when I called the next day! \nI will not stay there again! Hotel comfortable but very expensive breakfast not worth it there are plenty of excellent breakfast bars in the streets around the hotel.",
      "title": "Don't leave anything small valuable in the rooms!",
      "trip_type": "Couples",
      "travel_date": "2024-03-31",
      "user": {
        "username": "fran_oisv976",
        "user_location": {
          "id": "644129",
          "name": "Brignoles, Var, Provence-Alpes-Cote d'Azur"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e6/ea/default-avatar-2020-54.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e6/ea/default-avatar-2020-54.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e6/ea/default-avatar-2020-54.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e6/ea/default-avatar-2020-54.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e6/ea/default-avatar-2020-54.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 942876810,
        "title": "Owner response",
        "text": "Dear fran_oisv976,\nThank you for sharing the experience of your stay through the Tripadvisor website.\nWe are deeply sorry that you have not found your charger. We confirm that the hotel follows certain protocols, which are also controlled by a quality department, where each of the forgotten objects is managed electronically. For this reason, it is very difficult for forgetfulness to go uncontrolled. We highly doubt that you have forgotten it at the hotel and we believe it is more than unfair that you also accuse us in this open way.\nAs for the quality/price breakfast, we have one of the best breakfasts in the city of Barcelona, according to our surveys and web ranking. We offer Premium Buffet breakfast, with show cooking, fresh orange juice, a wide variety of sweet and savory products, seasonal fruit, etc.\nFor our part, we would be delighted to welcome you again on another occasion so that you could enjoy our stay.\nKing regards",
        "lang": "en",
        "author": "Antonio Sánchez",
        "published_date": "2024-03-19T06:46:40Z"
      }
    },
    {
      "id": 937772659,
      "lang": "en",
      "location_id": 228544,
      "published_date": "2024-02-11T13:31:35Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d228544-r937772659-Reviews-Catalonia_Sagrada_Familia-Barcelona_Catalonia.html?m=66827#review937772659",
      "text": "Location, fantastic, tube or metro just two block from the hotel, great Mall shopping center just 12 minutes walk, breakfast 5 star 🌟,,  room was clean, decent size, everyday we got fresh towels, staff was fine, I didn’t expect they laughing all the time , just been professional and they were on point, great beer 🍺 at the bar super cold 🥶,, \nDefinitely I will be back",
      "title": "Just a good holiday at Catalonia hotel",
      "trip_type": "Couples",
      "travel_date": "2024-02-29",
      "user": {
        "username": "manog357",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e5/2b/default-avatar-2020-52.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e5/2b/default-avatar-2020-52.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e5/2b/default-avatar-2020-52.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e5/2b/default-avatar-2020-52.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e5/2b/default-avatar-2020-52.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 938717495,
        "title": "Owner response",
        "text": "Dear manog357,\nThank you very much for sharing the experience of your stay at the Hotel Catalonia Sagrada Familia.\nWe are very pleased to know that we have met your expectations. Your instructions help us to continue in the same line of work.\nWe offer Premium Buffet breakfast with show cooking, with a great variety of fresh products, show cooking, fresh orange juice, etc. We love that you enjoyed it.\nWe hope to have the opportunity to welcome you again in the near future,\nKing regards",
        "lang": "en",
        "author": "Antonio Sánchez",
        "published_date": "2024-02-18T04:24:08Z"
      }
    }
  ]
}