{
  "data": [
    {
      "id": 923265938,
      "lang": "en",
      "location_id": 291367,
      "published_date": "2023-10-27T23:16:37Z",
      "rating": 4,
      "helpful_votes": 3,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635614-d291367-r923265938-Reviews-Belair_Beach_Hotel-Ialyssos_Rhodes_Dodecanese_South_Aegean.html?m=66827#review923265938",
      "text": "We are at the end of our stay in Rhodes and chose this hotel based on previous reviews and location. Very close to Rhodes with a 10 min taxi for around 12E or 20 min bus which run every 30 min for 5E one way for two. (You can buy day or week travel passes) the hotel is ideally situated so that you can plan trips and days out with ease. Remember that your on the northern side of the island so its stone beaches and tides but still beautiful. Rooms are split into the older building with family room options and the newer building with their exec suits. Regardless they are clean and spacious. Our room overlooked the pool with ocean view. We where shocked at first as this the first hotel we stayed in where you got tea and coffee making facilities but no actual drinks. This was soon remedied with a quick trip to the local shop but fir the cost and hype of being an exec room I would have expected management to have gone that extra mile as its often the little things like waking up and making your own coffee that make a difference. Aside from this the staff like Kiki in the restaurant and the pool and bar staff are what make your stay enjoyable. Always friendly, willing ro help, and happy to serve. The food is adequate and if your not in the restaurant at the start times then cannister be cold so get there quick if you want hot food otherwise good choice and remember they are in wind down mode at the end of Oct. These folks have worked all season from April to Oct and just want a break so done expect bells and whistles. We did the standard day trips and the boat trip to marmaris Turkey was well worth it. Also great to visit two countries and locations in one holiday. The South side of the island is stunning with main destinations being faliraki and Lindos but we also ventured into amazing villages off the beaten track which was just perfect. The bar in the hotel needs some desperate rethinking but that's up to management. If you like a doctors waiting room then bland pure white no character style bar will be your cup of tea and reminded us of a bust station more than a bar. Although situated close to the main road and the seating area is also right out front (I guess to attract passers by) they really need to rethink their design on that one.  Again hotel in general great, staff amazing, location perfect but with some effort this could be a superb outstanding hotel. \n ",
      "title": "End of season winner",
      "trip_type": "Family",
      "travel_date": "2023-10-31",
      "user": {
        "username": "diablopablo123",
        "user_location": {
          "id": "186402",
          "name": "Birmingham, West Midlands, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f0/9f/default-avatar-2020-16.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 923076277,
      "lang": "en",
      "location_id": 291367,
      "published_date": "2023-10-26T13:34:29Z",
      "rating": 5,
      "helpful_votes": 2,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635614-d291367-r923076277-Reviews-Belair_Beach_Hotel-Ialyssos_Rhodes_Dodecanese_South_Aegean.html?m=66827#review923076277",
      "text": "Just back from a 10 night stay at Belair, we had such a wonderful time. Me, my husband and our little girl. The staff were all so lovely and helpful. The snack bar staff were amazing, especially with our daughter. She couldn't stay away from there. The entertainment team made sure to get all involved around the pool for darts, water polo etc and we had a laugh every day. Lifeguard was so friendly. Pool area was great, rooms always cleaned, wonderful views, plenty of food choice.\nWould definitely recommend and we are sad to be back home. X",
      "title": "Lovely holiday ",
      "trip_type": "Family",
      "travel_date": "2023-10-31",
      "user": {
        "username": "E8242LVvickyw",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f2/11/default-avatar-2020-23.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f2/11/default-avatar-2020-23.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f2/11/default-avatar-2020-23.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f2/11/default-avatar-2020-23.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f2/11/default-avatar-2020-23.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 922430997,
      "lang": "en",
      "location_id": 291367,
      "published_date": "2023-10-22T09:21:21Z",
      "rating": 5,
      "helpful_votes": 2,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635614-d291367-r922430997-Reviews-Belair_Beach_Hotel-Ialyssos_Rhodes_Dodecanese_South_Aegean.html?m=66827#review922430997",
      "text": "Just returned from a 2 week stay at the Belair beach hotel in Ixia. This is a truly great hotel which we would highly recommend.  We had an executive room with sea view. When we opened the curtains the view over the pool left us staring at the sea. The room was clean and bright , the bathroom the same.  Cleaners came in with fresh towels every day and beds changed every 2 days. The reception staff were always friendly and looking to help. Like all the staff at the hotel they were always smiling.we were half board and found the food to be of a good standard. Yes aimed at all inclusive  clients but with a fair choice for all dietary requirements. Now special praise for a member of staff,Kiki, a really friendly person for whom nothing was too much trouble . I don't  know where she gets her energy from but she just never stops! Bar staff also smiling and friendly. The hotel is situated about a 1 hour walk from Rhodes town whis a really must see especially the old town. A regular bus service runs from right outside the hotel and is inexpensive. Ther is also a \"quiet \" pool if you do not want the main pool. Entertainment is a bit limited but with a outside stage Tommy and Willy do there best. Don't want to get boring now , suffice to say a revisit is a certainty. ",
      "title": "Can't  understand negative comments about this hotel.",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "880michaelf",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e2/11/default-avatar-2020-41.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e2/11/default-avatar-2020-41.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e2/11/default-avatar-2020-41.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e2/11/default-avatar-2020-41.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e2/11/default-avatar-2020-41.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 922052112,
      "lang": "en",
      "location_id": 291367,
      "published_date": "2023-10-19T16:20:21Z",
      "rating": 5,
      "helpful_votes": 2,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635614-d291367-r922052112-Reviews-Belair_Beach_Hotel-Ialyssos_Rhodes_Dodecanese_South_Aegean.html?m=66827#review922052112",
      "text": "Perfect location with excellent sea views. \nStaff were extremely friendly and helpful, especially Irene in reception and all the wonderful staff in the restaurant. \nFood was of excellent quality, pizza was freshly made and delicious. \nWe upgraded to the executive type room in the new building which had a modern and fresh feel with amazing views. \nAir conditioning worked really well and the main swimming pool was beautiful. \nWould definitely choose this hotel again as it was incredible value for money. \nThank you to all the hard working staff.",
      "title": "Incredible value and a great stay!",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "MikeR221",
        "user_location": {
          "id": "186466",
          "name": "Swansea, Swansea County, South Wales, Wales"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/06/8e/c0/4c/mike-r.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/06/8e/c0/4c/mike-r.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/06/8e/c0/4c/mike-r.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/06/8e/c0/4c/mike-r.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 921868761,
      "lang": "en",
      "location_id": 291367,
      "published_date": "2023-10-18T11:20:08Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635614-d291367-r921868761-Reviews-Belair_Beach_Hotel-Ialyssos_Rhodes_Dodecanese_South_Aegean.html?m=66827#review921868761",
      "text": "Have arrived back home from the Belair Beach Hotel in Rhodes after a lovely week there in the 1st week of October. And if I’m honest we were a bit sceptical after reading some of the reviews.\n\nWeather was windy on the 1st day we were there but then no wind at all for the rest of the week & I don’t think it went below 29 degrees in the day & dropped to around 25 degrees at night.\nThe hotel was spotlessly clean and rooms were cleaned daily and fresh clean towels towels every day. We stayed in the executive sea view rooms and the view and sunsets were amazing.\nPeople have said how rude reception staff were, but I can honestly say that we couldn’t have had a more warmer welcome.After arriving late at the hotel we were greeted by Bill (yamas Bill) who was very pleasant & shared a joke with us whilst still being professional . He advised us of the restaurant opening times and advised us that there were sandwiches waiting for us in our rooms, which although we didn’t eat them as we were to tired from travelling they did look really nice..\n\nThe restaurant was the normal buffet style you get in any hotel. Now I am a fussy eater and there was plenty on offer for the likes of me. Breakfast was a array of different foods for different nationalities, and it was the same in the evenings  there was even different roast meats,roast potatoes & vegatables at least 3 of  the nights we were there obviously they were cooked slightly different than you would do at home but remember you are in Greece & not the uk. We would normally check the restaurant food out & then go out for meals if we didn’t like the choices there, but we ate there every night.\n\nOn talking to some guests around the pool they did complain of their rooms being dated and on the small side, on this I can’t comment on as we didn’t see them .we stayed in the Executive sea view rooms on the 5th floor room numbers 567 & 571 they were both identical to one another large bright & airy and as the balcony glass was clear you could sit and see the pool & the sea it was lovely.\n\nThe bar staff around the pool were really lovely & friendly nothing was too much trouble for them & they worked so hard so we made sure we gave them a tip before leaving.\nIf I had to be really picky about the belair beach hotel it would be the pool area, although it is a beautiful area, you had people dashing down to get their towels on the sun beds, although the man was there to stop them before 7.30am , (he even removed some towels off the beds if they were already on before 7.30 but the sign says no towels before 8am) and he made people que if they were down too early. Being the time of year we went we always got a sun bed but I bet it’s a different story in the main season.\nThe sun umbrella’s may as well not be there as when you put them up you put the people behind you in the shade and you are still in full sun, and as they are bolted into the floor you can’t move them around an they don’t tilt either which is my reason for giving 4* .\nI would highly recommend this hotel & would not hesitate to stay there again if I were to return to Rhodes .\n\n",
      "title": "Great stay at the Belair Beach Hotel Aixia Rhodes",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "Adventure576391",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e9/60/default-avatar-2020-64.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e9/60/default-avatar-2020-64.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e9/60/default-avatar-2020-64.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e9/60/default-avatar-2020-64.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e9/60/default-avatar-2020-64.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      }
    }
  ]
}