{
  "data": [
    {
      "id": 934529647,
      "lang": "en",
      "location_id": 296796,
      "published_date": "2024-01-17T19:18:20Z",
      "rating": 3,
      "helpful_votes": 4,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g25352701-d296796-r934529647-Reviews-Blue_Sea_Resort_Collection-Ammoudes_Rhodes_Dodecanese_South_Aegean.html?m=66827#review934529647",
      "text": "The hotel itself is nice, decent rooms, decent showers and on the beach. Quick and cheap taxis into Faliraki and not too far from the airport. Food is poor, some days we didn’t eat in the hotel at all, although we had paid for all inclusive and staff were very pleasant. \n\nHOWEVER! The majority of the guests are Russian and EXTREMELY unfriendly. If you are black or from a minority ethnic background my recommendation is that you avoid this hotel unless you want to be constantly stared at as if you have 8 heads and 4 arms. I can only say I’m very happy it was a couples holiday and my children did not have to experience what we did as a black couple. I am 30 years old and I’ve heard about the racist aura but I’ve never experienced it until we stayed at this hotel. Constant staring and not a smile in sight from the majority of guests. Very uncomfortable feeling, X’s CNN each vs £ so we therefore spent as much time out of the hotel as physically possible. My husband seconds everything I am saying.\n\nThe reason for late review is that we are here chatting many months later and began discussing our holiday and the hotel came up. My husband stressed the importance of us sharing our experience as black people to help others not have to experience what we did. Especially families, because it was really not nice! It was 2023 not 1903! I would never return to this hotel and that’s unfortunate because as I said the locals, the staff and the hotel itself were lovely.",
      "title": "Nice Hotel, Terrible Food, Horrendous Guests! Not a great choice for black people.",
      "trip_type": "Couples",
      "travel_date": "2023-05-31",
      "user": {
        "username": "MissC2712",
        "user_location": {
          "id": "186338",
          "name": "London, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e2/e6/default-avatar-2020-45.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e2/e6/default-avatar-2020-45.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e2/e6/default-avatar-2020-45.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e2/e6/default-avatar-2020-45.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e2/e6/default-avatar-2020-45.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 932889244,
      "lang": "en",
      "location_id": 296796,
      "published_date": "2024-01-08T15:56:02Z",
      "rating": 3,
      "helpful_votes": 2,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g25352701-d296796-r932889244-Reviews-Blue_Sea_Resort_Collection-Ammoudes_Rhodes_Dodecanese_South_Aegean.html?m=66827#review932889244",
      "text": "We stayed for a week at this hotel in October 2023. Unfortunately, quite a few negatives which made our stay average...\n\n- We were first shown to a room that felt like a maze to get there. We had to go up a small wooden spiral staircase to get to - room was nothing like the pictures we had seen, with only 1 light working and the clip to hold the shower was broken. We approached reception to enquire about moving rooms and were told to return the next day to discuss, which we did. Upon approaching reception the next day, we were told yet again to return the following day to sort this. This conversation occurred once more. After wasting 3 days of our holiday, waiting around for reception staff to do something about our room and being told \"your room is really nice\", we were eventually moved to a new room in the modern area of the hotel. This new room was exactly what was advertised and definitely improved our experience. Unfortunately, the reception staff did not deal with this well and we found that they were incredibly contradicting in what they were saying: rude, lying, being promised multiple times for it to be sorted, management ignoring us and talking through staff instead of addressing us directly. Upon talking to other guests, we found we were not the only ones with such issues.\n- We had a bottle (not a water bottle) in the bathroom for hygiene purposes, which was thrown out by cleaners in the room.\n- We found that bar staff were inconsistent. We often asked for cocktails to be made as 'mocktails' due to neither of us drinking alcohol. This was ignored once, causing us to drink alcohol which was frustrating as we do not do so for religious reasons. I do not remember her name but one member of the team was incredibly rude. When we asked for a specific cocktail with no alcohol, being told \"this is an all inclusive hotel; there is alcohol\". We felt this was very rude, inconsistent and unnecessary. I'm unsure how difficult it is to make a cocktail without alcohol? It ultimately is just fruit juice so it was odd how she was so rude about this.\n- I found a pin from the notice board on the floor by the pool area, which could have been nasty if stood on.\n- One of our party was incredibly sick one night. This was a 24 hour bug after eating some dodgy fish, we believe.\n- WiFi was intermittent and often didn't work for me.\n- Walls fairly thin and often could hear flushing in other rooms.\n- Gym old and dated.\n- Pools cold.\n- Chicken burger in the burger bar tasted and looked like beef. I was challenged massively by staff when I brought this up.\n- We got quite a few bites whilst in our room but rarely had our balcony door open.\n- A la carte restaurant was an added bonus. However, due to religious reasons, we do not eat pork. We asked for this not to be brought to the table, as it would be wasted, but we were ignored and staff were quite pushy with bringing food, despite us asking for it not to be brought to the table.\n\nThankfully there were a handful of positives to note...\n- Entertainment team and activities were really good. We particularly enjoyed the interactive (music and movie) quiz one evening.\n- Shops/market next to hotel, good for souvenirs. \n- Spa nice & staff. We weren't aware we had to book hot tub as no signs which made it confusing, and difficult when we had booked and others were using the hot tub during our booked slot. Although spa staff were good at monitoring. We found them really friendly and enjoyed going to the inside pool/spa area most days.",
      "title": "Average stay",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "Arc_202",
        "user_location": {
          "id": "186250",
          "name": "Devon, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/df/2b/default-avatar-2020-39.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/df/2b/default-avatar-2020-39.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/df/2b/default-avatar-2020-39.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/df/2b/default-avatar-2020-39.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/df/2b/default-avatar-2020-39.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
          "value": 2,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 926544662,
      "lang": "en",
      "location_id": 296796,
      "published_date": "2023-11-19T11:09:30Z",
      "rating": 3,
      "helpful_votes": 2,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g25352701-d296796-r926544662-Reviews-Blue_Sea_Resort_Collection-Ammoudes_Rhodes_Dodecanese_South_Aegean.html?m=66827#review926544662",
      "text": "This hotel is located in Faliraki, about a 20-minute drive from the airport. The location of the hotel makes it a nice place to start exploring Rhodes. Arriving at the hotel late at night, our first experience was a positive one. This was our first time going to an all-inclusive resort, and despite us arriving past the closing time of the restaurants, the staff offered us the chance to still get a free dinner. \n\nThe hotel buildings look a bit dated in several places, but we were satisfied with the nice and tidy look of our room. The room was also pretty spacious, and the bathroom was very nice and clean. We also spent quite some time relaxing on the balcony. Speaking about the rooms, we do unfortunately have a complaint, namely that they are quite noisy, which became a problem when a family with young children moved into the room next to ours, although the noise was mostly limited to one or two occurences. \n\nThis brings me to another point of criticism. Before visiting this hotel, we had been happily travelling exclusively to adults only-hotels for many years. However, travelling outside of the peak holiday season, we expected our experience in the Blue Sea Beach Resort to not be too different from our experiences in adults only-hotels. Unfortunately, it was very different in some ways detrimental to this hotel. Even travelling outside peak holiday season, the hotel was very busy with both adolescents and families with young children. This was a nuisance especially around the swimming pool and beach areas.\n\nWe had high expectations of the restaurants at the resort, this being our first time at an all inclusive hotel. Unfortunately, mainly looking at the main buffet restaurant, we were a bit disappointed with what was offered. The buffet is almost completely the same every day, offering a selection of food that feels a bit generic and limited. I will say that we were satisfied with the food at the burger restaurant, which was very nice, but since this restaurant is located at the beach bar, it does not really have the atmosphere you would expect of a restaurant. Unfortunately we were unable to visit the à la carte-restaurant since this had to be booked many days in advance.\n\nThe main point that improves my rating for this hotel, is that we were delighted with the staff and their service. Many members of the staff, including Eva, Socratis, Giorgios, Epithimia and Michalis, really did everything they could to make our holiday as pleasant as possible. The staff deserves high marks for their service, which is in large part why we are, in general, positive about our stay in this hotel, although we will be going to an adults only-hotel again during our next holiday,\n",
      "title": "An average experience greatly improved by the great staff",
      "trip_type": "Couples",
      "travel_date": "2023-06-30",
      "user": {
        "username": "VRomeijn",
        "user_location": {
          "id": "188590",
          "name": "Amsterdam, North Holland Province"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/2a/d8/fa/cf/vromeijn.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/2a/d8/fa/cf/vromeijn.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/2a/d8/fa/cf/vromeijn.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/2a/d8/fa/cf/vromeijn.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/2a/d8/fa/cf/vromeijn.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 924672911,
      "lang": "en",
      "location_id": 296796,
      "published_date": "2023-11-05T12:05:39Z",
      "rating": 4,
      "helpful_votes": 3,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g25352701-d296796-r924672911-Reviews-Blue_Sea_Resort_Collection-Ammoudes_Rhodes_Dodecanese_South_Aegean.html?m=66827#review924672911",
      "text": "Stunning Hotel and grounds.\nPools look lovely which they are just a shame they are soo cold but didnt stop us going in.\nFood was a fab variety and the drinks are lovely.\nMy favourite was the Coffee Liqueor 🥰\nOur room felt like it needed alittle updating to what others had but tbh I feel its just a room you sleep in.\nThe maids came every day with fresh towels and bedding which was fab.\n",
      "title": "Relaxing Rhodes",
      "trip_type": "Family",
      "travel_date": "2023-10-31",
      "user": {
        "username": "lucybU2801IM",
        "user_location": {
          "id": "504128",
          "name": "Frome, Somerset, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/19/d3/1e/d9/avatar.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/19/d3/1e/d9/avatar.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/19/d3/1e/d9/avatar.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/19/d3/1e/d9/avatar.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 925135416,
        "title": "Owner response",
        "text": "Dear Valued Guest,\n\nThank you very much for choosing Blue Sea Beach Resort for your stay in . We are delighted to hear that you enjoyed your stay at Blue Sea Beach Resort and that our hotel was a positive part in your experience. Once again, thank you for your excellent review and we look forward to welcoming you again soon at Blue Sea Beach Resort.\n\nKind Regards,\nBlue Sea Team",
        "lang": "en",
        "author": "Blue Sea Resort Collection",
        "published_date": "2023-11-09T03:10:32Z"
      }
    },
    {
      "id": 923630789,
      "lang": "en",
      "location_id": 296796,
      "published_date": "2023-10-30T07:57:34Z",
      "rating": 5,
      "helpful_votes": 2,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g25352701-d296796-r923630789-Reviews-Blue_Sea_Resort_Collection-Ammoudes_Rhodes_Dodecanese_South_Aegean.html?m=66827#review923630789",
      "text": "First family holiday abroad and this place made it perfect. \nLovely clean hotel in a great location with really friendly staff and a good variety of tasty food and drinks on offer.  \nThe beach was clean with plenty of sun beds and the sea was beautiful, clear and warm.\nEntertainment was suitable for all ages and the evening entertainment was brilliant fun. There were lots of activities to do on site and surrounding even during the last week of the season.\nWe will definitely be going back. Loved it!!",
      "title": "Very clean and friendly with a good variety of food, activities and entertainment. Beautiful beach in a good location. ",
      "trip_type": "Family",
      "travel_date": "2023-10-31",
      "user": {
        "username": "Quest25959003814",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e5/66/default-avatar-2020-53.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e5/66/default-avatar-2020-53.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e5/66/default-avatar-2020-53.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e5/66/default-avatar-2020-53.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e5/66/default-avatar-2020-53.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 925135361,
        "title": "Owner response",
        "text": "Dear Valued Guest,\n\nLet us thank you for recommending Blue Sea Beach Resort after the experience you had with us! We are very glad to receive your compliments about location, food, staff, hotel, holiday and beach. We would love to have the chance to welcome you back in  for another stay.\n\nKind Regards,\nBlue Sea Team\n",
        "lang": "en",
        "author": "Blue Sea Resort Collection",
        "published_date": "2023-11-09T03:09:58Z"
      }
    }
  ]
}