{
  "data": [
    {
      "id": 927153298,
      "lang": "en",
      "location_id": 298838,
      "published_date": "2023-11-24T03:09:10Z",
      "rating": 1,
      "helpful_votes": 3,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g298661-d298838-r927153298-Reviews-Royal_Asarlik_Beach-Gumbet_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review927153298",
      "text": "Dirty hotel although the staff tried to clean once we complained, but the saying “you can’t polish a turd” is very apt! \nEverything was dirty, broken, ripped, old.\nShocking entertainment, broken chairs in entertainment area. \nAwful food. \nGuests (not English) arguing with other guests, fighting for tables at breakfast lunch etc. \nIce cream parlour and waffle machine was the dirtiest of them all.\nThe quiet pool was also dirty. \nThe bar staff tried their hardest.\nLock on the door to the balcony was broken. \nChain on door was broken.\nMould everywhere. \nThis is an honest review, This place is falsely advertised by tui, tui didn’t want to know about our complaint. We came home to a £250 phone bill where we phoned Tui on numerous occasions asking to be moved to another hotel, after 3 days we were offered another hotel for the additional cost of £1800 🤣🤣\nThe only good thing was, we met more lovely people on this holiday then any other holiday, I think it was because we were all in the same boat staying in a dirty hotel. We went out every night and there was more than 20 of us on our last night. \nWe didn’t unpack our cases. \n",
      "title": "Dirty Dirty Dirty",
      "trip_type": "Family",
      "travel_date": "2023-08-31",
      "user": {
        "username": "Mytch72",
        "user_location": {
          "id": "186298",
          "name": "Portsmouth, Hampshire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ed/7b/default-avatar-2020-6.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ed/7b/default-avatar-2020-6.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ed/7b/default-avatar-2020-6.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ed/7b/default-avatar-2020-6.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ed/7b/default-avatar-2020-6.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
          "value": 2,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 923205088,
      "lang": "en",
      "location_id": 298838,
      "published_date": "2023-10-27T11:52:46Z",
      "rating": 3,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g298661-d298838-r923205088-Reviews-Royal_Asarlik_Beach-Gumbet_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review923205088",
      "text": "We we're very disappointed in the hotel the rooms we're average and the food was very disappointing. The pool area was nice and staff were friendly. Over all for what we paid was not worth it.  Will not be returning.",
      "title": "Very disappointed ",
      "trip_type": "Family",
      "travel_date": "2023-10-31",
      "user": {
        "username": "karentZ3150CZ",
        "user_location": {
          "id": "503960",
          "name": "Melton Mowbray, Leicestershire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ea/2e/default-avatar-2020-67.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ea/2e/default-avatar-2020-67.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ea/2e/default-avatar-2020-67.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ea/2e/default-avatar-2020-67.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ea/2e/default-avatar-2020-67.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 921398457,
      "lang": "en",
      "location_id": 298838,
      "published_date": "2023-10-15T10:32:47Z",
      "rating": 1,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g298661-d298838-r921398457-Reviews-Royal_Asarlik_Beach-Gumbet_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review921398457",
      "text": "To start on a positive note the staff were mostly fine especially Sahin at the relax bar. Sadly its downhill from here, the rooms were filthy not cleaned during the whole stay just the bedding and towels changed. The room had loose electric wires hanging down. Slippers were provided in the rooms ( probably to save time on cleaning the dirty floors) An unpleasant smell most of the time in the bathroom. The food is the next problem, unless you got there as it opened the food in the evening was limited and not hot. Breakfast seemed to be leftovers from the night before. Drinks from all the bars was of poor quality, white and red wine almost undrinkable. \n\nWe stayed at this hotel 12 years ago and are extremely disappointed as to how much it has declined.\n\nWe cannot recommend this hotel to anyone. Its advertised as a 5 star but probably a 2/3 star at most. ",
      "title": "Avoid this Hotel",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "greener111",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ef/9c/default-avatar-2020-14.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ef/9c/default-avatar-2020-14.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ef/9c/default-avatar-2020-14.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ef/9c/default-avatar-2020-14.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ef/9c/default-avatar-2020-14.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 922261382,
        "title": "Owner response",
        "text": "Dear Guest\nThank you for taking the time to submit your detailed review of our hotel following your stay. \nWe have noted your points and have passed the message to the Management.\n",
        "lang": "en",
        "author": "Guest  Relations",
        "published_date": "2023-10-21T06:24:41Z"
      }
    },
    {
      "id": 921261112,
      "lang": "en",
      "location_id": 298838,
      "published_date": "2023-10-14T12:34:01Z",
      "rating": 3,
      "helpful_votes": 2,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g298661-d298838-r921261112-Reviews-Royal_Asarlik_Beach-Gumbet_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review921261112",
      "text": "I really don’t like giving poor reviews but although there were some good points with this All inclusive 5star hotel there were quite a few negatives. We arrived at 4am due to flight being delayed and first (tired ) impressions were reasonable. Fairly quick check in and shown to our (sea view) room. Bed was comfortable. We got up about 9:30 and noticed our room was what could only be described as grubby. Dirty looking marks all over and yellowing on all white surfaces(walls and wardrobes). We did have a sea view but it was over some other accommodation so a distant view. Overall food was reasonable,decent choice and well cooked. Problem was there was never enough cutlery and I was just amazed that the problem wasn’t solved after a the first day of problems. If I had been the restaurant manager then I would have bought another 500 hundred sets myself rather than have the embarrassment of keep saying sorry to guests night after night. Same thing with the fruit juice machines, always empty with only half the guests thirst quenched. Never known anything like it, even in 2 star hotels. Beach was lovely and was always crowded with the pool areas staying empty. Pool bars and snack bar excellent as was the beach bar. Lobby bar was a lovely place to st and have a drink in the evening but after 9 pm it was only paper cups as although they kept collecting empty glasses no one ever washe them up 😂. Beds were made every morning though the rooms were never cleaned and toilet rolls seemed to be a scarcity and a couple times the dirty towels were taken away without leaving replacements though quickly rectified by a call to reception. Don’t expect your free drinks in your fridge to be replenished either. Most staff were ok though a few were excellent and a few were grumpy. All in all we had a good break but wasn’t the 5 star luxury we were expecting. Maybe 3 star +   Disappointing overall is how I’m remembering it. I just remembered that we were WhatsApped by a guy named Bülent on our first morning and asked to go to a meeting with him at midday. We got there and all the new guests were present and he started off giving good info about hotel but it turned into a hard sell of attractions. We paid 30 euros each for a spa and massage experience away from the hotel and were promised it would be excellent but it wasn’t, it was dirty and awful backstreet sauna that no one was comfortable with. We also paid 50euros each for a boat trip that was amazing but if you book from the guys down the beach it was only 25 euros 😞. Don’t be fooled by Bülent, he is not your friend. ",
      "title": "Disappointing",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "E4688TDmarkp",
        "user_location": {
          "id": "187045",
          "name": "Peterborough, Cambridgeshire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ea/2e/default-avatar-2020-67.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ea/2e/default-avatar-2020-67.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ea/2e/default-avatar-2020-67.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ea/2e/default-avatar-2020-67.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ea/2e/default-avatar-2020-67.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
          "value": 2,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 922264541,
        "title": "Owner response",
        "text": "Dear Guest\nMany Thanks for your review\nI am sorry to hear you didn't have a good stay with us - I assure you our team are looking into this as we take your feedback seriously.\nWe have noted all points and will fix it till your next visit. Hope to see you once again with only positive memories. \n",
        "lang": "en",
        "author": "Guest  Relations",
        "published_date": "2023-10-21T06:51:42Z"
      }
    },
    {
      "id": 921111828,
      "lang": "en",
      "location_id": 298838,
      "published_date": "2023-10-13T11:52:55Z",
      "rating": 2,
      "helpful_votes": 2,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g298661-d298838-r921111828-Reviews-Royal_Asarlik_Beach-Gumbet_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review921111828",
      "text": "I've just recently returned, from a 9 day stay here, and its the worst all inclusive hotel ive been to.\nWhen we booked this, thru Love Holidays, the reviews were all 5 out of 5, but the couple of weeks leading up to going, they were awful, it was too late for us to change.\nWhen we arrived, our room wasn't ready, which can't always be helped, reception said to go and get something to eat, the restaurant being on the 6th floor, when we got up there, it was disgusting, dirty tables, little to no choice of food, as this was mid afternoon, i could forgive this, as they had had the main lunchtime rush, so choice was limited, i asked a young female member of staff, where the cutlery was kept and she just looked at me and said 'huh'!  rude from the start, no staff around the restaurant, checking on people, felt like a truckers canteen not  5* . \nIt didn't get much better after that, we got shown to our room, no drinks in the fridge, which was mentioned in the booking, it was hot to touch and badly stained, along with the bath, a piece of skirting board fell off, one of the curtains was hanging down, really poor and basic, we didn't bother to ask about changing, as we had seen previous reviews, and the choices didn't seem much better.\n The first night, we went upstairs to have dinner, the food was stone cold, no staff around to monitor this, people were taking plates of food out of the restaurant, despite a sign saying not too. We hoped breakfast would be better, no chance?? onion rings and chips, mixed veg, clearly left over from the night before!! people were stacking their plates, high full of food, and so much waste, people also putting food in their bags. I basically had fruit every morning and that was only tinned. \nWe did get an ice cream each day from the patisserie, but all their cakes were left out in the open, the place was a mess, people just barging in no manners.\nWe went to the Seafood al la carte, food already on the tables ready, lots of flies around, cats everywhere, the food was gross and we left.\nStaff in general were rude, only really helpful member of staff was Berkant on reception, shame more didn't follow suit.\nWe spoke with our rep Bulent, only interested, if you wanted to do an excursion, we explained about the issues, staff, room, food, his reply to cold food, was you can always put it in the microwave!!! so that's why we paid extra money for 'all inclusive' ?? so rude. oh, and apparently he told us they had upgraded our room, from promo to standard, I hate to think what that would have looked like.\n He said, if we wanted to move hotels, we had to ring love holidays, both myself and my friend couldn't get thru on the number given, he didn't care one bit, he went over and spoke to reception and they said , they can leave if they want to! Great customer service! \nSo we basically ate out every night after that, its really reasonable, ive previously been to this resort, on a self catering basis, and would highly recommend you do the same. \nIn the past, you used to get hassled to go into shops and have people hassling on the beaches, this has stopped, so it was really good fun to go out and about.\nThe concept of the pools is weird, the activity pool should be the relax one in my opinion, as there's more beds, great views and apart from afternoon pool activity, its very clean and chilled out, but the relax pools were manic, food left everywhere, jacuzzi not working, big groups of people huddled around together, talking on their phones, not very relaxing. \nThe beach areas, again, they seem to have got these round the wrong way too, some areas smelt of drains and full of litter, lots of cats and dogs roaming around, and dog mess.\nBeach towels are like hand towels, id suggest getting them the night before, as most days, we were told to come back as they weren't set up ready.\nAny good points, good location to town, lots of fridges with bottled water, sea lovely to get into and swim, lovely views, nice coastal walk that has bars and restaurants.\nThat im afraid is it! i would happily go back to the resort, but not this hotel. It saddens me to leave, such a negative review, but we made the best of bad job under the circumstances. Hope you have a better experience and lovely holiday.    ",
      "title": "massive disappointment!",
      "trip_type": "Friends getaway",
      "travel_date": "2023-10-31",
      "user": {
        "username": "chicken010",
        "user_location": {
          "id": "190730",
          "name": "Taunton, Somerset, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f4/5d/default-avatar-2020-32.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f4/5d/default-avatar-2020-32.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f4/5d/default-avatar-2020-32.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f4/5d/default-avatar-2020-32.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f4/5d/default-avatar-2020-32.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 922267027,
        "title": "Owner response",
        "text": "Dear guest, \n\nthank you for spending your time and leaving a review. We are sorry that your holiday was overshadowed and you encountered circumstances that were unexpected for you.\nUnfortunately, some aspects remain under our control, such as the noise around the pools created by other guests.\nAll your comments regarding cleanliness and order will be taken into account and we will do everything possible to ensure that your next stay at our hotel exceeds all your expectations.",
        "lang": "en",
        "author": "Guest  Relations",
        "published_date": "2023-10-21T07:14:07Z"
      }
    }
  ]
}