{
  "data": [
    {
      "id": 945788336,
      "lang": "en",
      "location_id": 301880,
      "published_date": "2024-04-08T02:41:56Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d301880-r945788336-Reviews-Four_Seasons_Resort_Sharm_El_Sheikh-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review945788336",
      "text": "Just visited the Four Seasons Sharm el Sheikh for an 11 night stay. The rooms are newly refurbished and stunning. We had the Four Seasons suite overlooking the Luna pool with a backdrop of the Red Sea. The resort itself is breathtaking. The landscaping is out of this world. It’s beautifully designed, and I’ve never seen such well-kept gardens at any other Four Seasons. The staff couldn’t do more for you. We were greeted by Joseph in reception, who was so welcoming, had the warmest smile, and was so amazing with my kids. The staff are all wonderful and incredibly kind. I wish I could remember everyone’s names! They tried so hard to make us happy despite me complaining about niggly bits and constantly wanting to provide feedback. They welcomed us each day at the pool by name, they knew what we wanted to order, constantly going back and forth replenishing our drinks and ice buckets. Morcos was a star, and we are so grateful he looked after us so well at Luna. Ivram and Ahmed at the Waha pool also went above and beyond for us. Breakfast at Zeitouni was far more pleasant than breakfast at Arabesque. It’s less crowded and service was excellent. Emad, Hamada, and Kirellos were amazing and looked after us so well at breakfast. We tried every restaurant in the hotel. Simone, the food and beverage manager, was so wonderful to our family and would always swing by during meals to make sure we were happy. Gaber and Rhea did a fantastic job at organising all our dinners. Our best meal was Yatai. I just wish it was open on a daily basis. We also loved the vibe in Bullona. Tapas night on the beach was also fantastic, the food was excellent. Water sports were another highlight of our trip. We rented snorkels and went tubing, which was so much fun. The variety of sealife to be found even within the hotel’s beach, which boasts it’s own coral reef, was truly breathtaking and not to be missed. Missing the resort already and would visit again in a heartbeat.",
      "title": "Fabulous escape",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "Evolia19",
        "user_location": {
          "id": "186338",
          "name": "London, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1b/c1/39/78/caption.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1b/c1/39/78/caption.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1b/c1/39/78/caption.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/1b/c1/39/78/caption.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 943924996,
      "lang": "en",
      "location_id": 301880,
      "published_date": "2024-03-26T15:14:53Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d301880-r943924996-Reviews-Four_Seasons_Resort_Sharm_El_Sheikh-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review943924996",
      "text": "Staying at the Four Seasons Resort Sharm El Sheikh is like being treated as royalty, yes it’s expensive in compassion to other resorts, especially those offering all inclusive, but if you are looking for that something special, a first class excellent service, the quality of the food, the ambience of your surroundings, then this is place for you. It’s impressive.\n\nWe booked a 5 night stay via BA holidays opting for business class flights and transfers on a B&B basis. The superior Garden room was more of a suite, with large separate lounge, dressing room and bathroom, comprising of both walk-in power shower and bath. Top name toilettes by Gypsy water were in abundance, as were the Egyptian towels.\n\nThe room was extremely comfortable with ample seating, both inside and outside in the small but private garden. A nice touch was the adapter plugs in case you forget yours. You are supplied daily with water and they appear more than happy to leave more on request. There is room service both in the morning and early evening turn down, which we declined.\n\nWe had breakfast at the Arabesque restaurant just below reception looking out over the vast gardens and Red Sea beyond, they are happy to offer you full service breakfast dinning or as we preferred, to get our own from the buffet a few steps inside. Fresh juice, tea or coffee is served to your table. There is both inside and out dinning areas.\n\nThe grounds are huge and on arrival took a walk around with the aid of the map to locate the various pools, bars and restaurants on the property. They offer a buggy service door to door if you can’t manage the walk, there are also two Funicular trams running during the day.\n\nThere are 3 large pools each of which with oversized sun beds, and towels. Few hotels I have stayed at offer mini ice boxes with bottled bottle. Again there are plenty of friendly staff around should you want drinks. There are loads of sun beds all over the property so need to get up at 6.00am to bag one, you are spoilt for choice here. The hotel has it’s own dive centre.\n\nThere are various restaurants on the property each with a different theme serving its unique cuisine.\n\nThe staff are wonderful, extremely helpful, well trained and friendly, which is more than I can say for the Immigration staff at Sharm El Sheikh airport which were truly some for the rudest people I have come across.\n\nNOTE ON ENTERING Sharm El Sheikh Airport\n\nHaving queued to 30 minutes we were then told we needed to fill immigration forms in, why weren’t we given these in the first place. Then being made to queue all over again. A great way to put tourist off.\n\nOther than that, the Four Seasons far exceeded our expectations A first class Luxurious Resort where nothing is too much trouble.",
      "title": "Absolutely Fabulous True Luxury",
      "trip_type": "Couples",
      "travel_date": "2024-03-31",
      "user": {
        "username": "Dubaidick",
        "user_location": {
          "id": "227062",
          "name": "Broxbourne, Hertfordshire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/19/d2/b0/dc/dubaidick.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/19/d2/b0/dc/dubaidick.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/19/d2/b0/dc/dubaidick.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/19/d2/b0/dc/dubaidick.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-m/1280/19/d2/b0/dc/dubaidick.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 944910983,
        "title": "Owner response",
        "text": "\nDear esteemed guest,\n\nThank you immensely for sharing your glowing review following your recent stay at Four Seasons Resort Sharm El Sheikh. Your words are truly uplifting and reinforce our dedication to providing unparalleled luxury experiences to our cherished guests.\n\nIt brings us immense joy to learn that you found your stay akin to royalty treatment, and that our resort left an indelible mark on your memory. We are delighted that you appreciated the meticulous attention to detail, from the spacious accommodations to the quality of service and cuisine offered throughout the property.\n\nYour detailed descriptions of our amenities, including the expansive grounds, pools, and diverse dining options, are truly heartening. We strive to create an environment where every guest feels pampered and catered to, and we are thrilled to have succeeded in exceeding your expectations.\n\nFurthermore, your kind words about our dedicated and friendly staff are deeply appreciated. We are committed to upholding the highest standards of hospitality, and it is gratifying to know that our team's efforts resonated with you.\n\nOnce again, thank you for choosing Four Seasons Resort Sharm El Sheikh for your luxurious getaway. It was our utmost pleasure to serve you, and we eagerly anticipate the opportunity to welcome you back for another exceptional stay in the near future.\n\nWarmest regards,\n\nLeon Baum\nGeneral Manager\nFour Seasons Resort Sharm El Sheikh",
        "lang": "en",
        "author": "mariam wahba",
        "published_date": "2024-04-02T06:21:29Z"
      }
    },
    {
      "id": 943896316,
      "lang": "en",
      "location_id": 301880,
      "published_date": "2024-03-26T10:57:01Z",
      "rating": 5,
      "helpful_votes": 2,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d301880-r943896316-Reviews-Four_Seasons_Resort_Sharm_El_Sheikh-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review943896316",
      "text": "After a break of over a decade we returned as direct flights from London had recommenced; plus the resort had been extended & refreshed. So how was it? Did the new extension match the hype? Had it got too big? Well we had a long two week stay and so had amply opportunity to see for ourselves. What did we find?\n\nWe decided to stay in the new half. We found the gardens magnificent throughout and colour runs riot with flowering Bougainvillea literally everywhere, complementing what we were told was over 3,000 mature palms. \n\nOur room was lighter, fresher, and bigger yet the architectural design manages to maintain the style that runs throughout the. So the accommodation was a real winner. Also it had a great view of the ocean from its veranda.\n\nWhen you go to the Four Seasons you expect great service; which we got in spades. From the restaurant staff, thorough to the guys at the pool, all the way through to the housekeeping - everyone was great. Literally nothing was too much trouble. Can we have Mexican food only available at lunchtime served in the Italian restaurant tonight for dinner? Sure! Can we have  Indian dishes not on the menu as room service tonight? Again, no problem.\n\nSo it’s now clearly a much bigger resort, but it has more pools, more restaurants, more staff; basically more of everything. \n\nWe had a blast. Planning next year’s visit already.",
      "title": "We had a blast!!",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "alanc949",
        "user_location": {
          "id": "186418",
          "name": "Maidenhead, Windsor and Maidenhead, Berkshire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/06/15/8a/53/alan-c.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/06/15/8a/53/alan-c.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/06/15/8a/53/alan-c.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/06/15/8a/53/alan-c.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/06/15/8a/53/alan-c.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 944911180,
        "title": "Owner response",
        "text": "\nDear Alanc,\n\nThank you so much for sharing your delightful experience at Four Seasons Resort Sharm El Sheikh with us. We are thrilled to hear that you had an exceptional two-week stay and that our recent extension and refreshment exceeded your expectations.\n\nIt warms our hearts to know that you found the new half of the resort to be magnificent, with lush gardens and stunning views of the Red Sea from your terrace. We take great pride in maintaining our signature style while continuously enhancing our facilities to provide an even more luxurious experience for our guests.\n\nWe are delighted that our dedicated team members contributed to making your stay truly memorable with their impeccable service. It brings us joy to know that they went above and beyond to accommodate your requests and ensure that every aspect of your visit was perfect.\n\nAs we continue to grow and expand, we remain committed to upholding the highest standards of hospitality and providing our guests with unforgettable experiences. We are thrilled to hear that you are already planning your next visit, and we cannot wait to welcome you back for another incredible stay.\n\nThank you once again for choosing Four Seasons Resort Sharm El Sheikh, and we look forward to hosting you again soon.\n\nWarmest regards,\nLeon Baum\nGeneral Manager\nFour Seasons Resort Sharm El Sheikh",
        "lang": "en",
        "author": "mariam wahba",
        "published_date": "2024-04-02T06:23:18Z"
      }
    },
    {
      "id": 943721071,
      "lang": "en",
      "location_id": 301880,
      "published_date": "2024-03-25T04:29:23Z",
      "rating": 5,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d301880-r943721071-Reviews-Four_Seasons_Resort_Sharm_El_Sheikh-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review943721071",
      "text": "Fabulous room, pool and restaurants. Great place to chill out and not many kids so good for a quiet break.\nStaff are friendly and helpful. Now that it’s got more rooms and restaurants I’m glad we were put in the original buildings as the new ones feel too touristy",
      "title": "Love this place so much",
      "trip_type": "Couples",
      "travel_date": "2023-09-30",
      "user": {
        "username": "RoRo500",
        "user_location": {
          "id": "186338",
          "name": "London, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/28/97/2c/88/ro-o.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/28/97/2c/88/ro-o.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/28/97/2c/88/ro-o.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/28/97/2c/88/ro-o.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-w/28/97/2c/88/ro-o.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 944911418,
        "title": "Owner response",
        "text": "\nDear Roro,\n\nThank you for taking the time to share your feedback with us. We are thrilled to hear that you thoroughly enjoyed your stay at Four Seasons Resort Sharm El Sheikh and that you found our accommodations, pool, and restaurants to be fabulous.\n\nWe are pleased to know that you appreciated the tranquil atmosphere and the opportunity to relax without the hustle and bustle typically associated with family resorts. Providing a serene environment for our guests to unwind and enjoy a quiet break is one of our top priorities.\n\nYour kind words about our friendly and helpful staff are greatly appreciated. We take pride in delivering exceptional service to all our guests, and it is wonderful to hear that our team members made a positive impression on you during your stay.\n\nOnce again, thank you for choosing Four Seasons Resort Sharm El Sheikh, and we hope to have the pleasure of welcoming you back for another memorable stay in the future.\n\nWarm regards,\n\nLeon Baum\nGeneral Manager\nFour Seasons Resort Sharm El Sheikh",
        "lang": "en",
        "author": "mariam wahba",
        "published_date": "2024-04-02T06:25:30Z"
      }
    },
    {
      "id": 943315749,
      "lang": "en",
      "location_id": 301880,
      "published_date": "2024-03-21T18:29:06Z",
      "rating": 5,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d301880-r943315749-Reviews-Four_Seasons_Resort_Sharm_El_Sheikh-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review943315749",
      "text": "This hotel is clearly the most beautiful of any I have experienced around the world.  The grounds, staff, amenities, location and food are unmatched.  The waters of the Red Sea are also unmatched offering great swimming, snorkling and scuba.",
      "title": "Heaven on Earth",
      "trip_type": "NONE",
      "travel_date": "2024-03-31",
      "user": {
        "username": "markwG1538ZS",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ea/2e/default-avatar-2020-67.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ea/2e/default-avatar-2020-67.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ea/2e/default-avatar-2020-67.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ea/2e/default-avatar-2020-67.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ea/2e/default-avatar-2020-67.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 943717016,
        "title": "Owner response",
        "text": "\nDear Mark,\n\nThank you for your wonderful review of your recent stay at Four Seasons Resort Sharm El Sheikh. We are thrilled to hear that you found our property to be the most beautiful you have experienced worldwide.\n\nYour compliments regarding our grounds, staff, amenities, location, and food are truly appreciated. We take great pride in providing exceptional service and creating unforgettable experiences for our guests.\n\nWe are delighted that you enjoyed the unparalleled beauty of the Red Sea and the various water activities it offers.\n\nYour praise serves as a great motivation for our team, and we look forward to welcoming you back for another memorable stay.\n\nWarm regards,\n\nLeon Baum\nGeneral Manager\nFour Seasons Resort Sharm El Sheikh",
        "lang": "en",
        "author": "mariam wahba",
        "published_date": "2024-03-25T03:48:22Z"
      }
    }
  ]
}