{
  "data": [
    {
      "id": 944618089,
      "lang": "en",
      "location_id": 304493,
      "published_date": "2024-03-31T05:50:27Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d304493-r944618089-Reviews-Sheraton_Jumeirah_Beach_Resort-Dubai_Emirate_of_Dubai.html?m=66827#review944618089",
      "text": "I attended the Iftar due to multiple positive comments, however I didn’t feel it’s proper buffet at all, not clean, no variety, arabic dishes very less, and the ice cream gallons throughout behind like in bad way, no kids menu like very basic thinks, fries, pizza nagets etc, and the most think I didn’t like it that we paid for tea and coffee, doesn’t worth the money we paid,",
      "title": "Not a good Iftar like we heard",
      "trip_type": "Couples",
      "travel_date": "2024-03-31",
      "user": {
        "username": "Salimmojgghfhmvh",
        "user_location": {
          "id": "295424",
          "name": "Dubai, Emirate of Dubai"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/07/3f/cf/c2/mohamed-s.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/07/3f/cf/c2/mohamed-s.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/07/3f/cf/c2/mohamed-s.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/07/3f/cf/c2/mohamed-s.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 944694519,
        "title": "Owner response",
        "text": "Dear Salimmojgghfhmvh,\n\nWe extend our sincerest apologies for the unfortunate experience you encountered during your visit to us for our iftar tent.\n\nWe are sorry to hear that you were not completely satisfied with our iftar tent buffet, and we do apologize if we came short of meeting your expectations on this particular occasion. \n\nOne of the major purposes of online reviews is to highlight areas for improvement and your feedback provides our hotel with valuable information that we can review to improve on for the future. \n\nWe really do hope that this experience on this particular visit will not hinder you from visiting us again and that we will have the opportunity to be of service in the near future. \n\nKind regards,\n\nNaleem Ariff \nMulti-Property General Manager\n",
        "lang": "en",
        "author": "Naleem Ariff",
        "published_date": "2024-03-31T15:53:02Z"
      }
    },
    {
      "id": 944207090,
      "lang": "en",
      "location_id": 304493,
      "published_date": "2024-03-28T00:21:19Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d304493-r944207090-Reviews-Sheraton_Jumeirah_Beach_Resort-Dubai_Emirate_of_Dubai.html?m=66827#review944207090",
      "text": "What a fantastic evening we had! \nI reserved the place for the iftar buffet on my company's behalf. It held  500 people.  Nicely decorated space with soothing live Arabic music and a comfortable atmosphere. \nThe level of service was flawless. Anything we asked, it was immediately served at the table. Great job F&B service Team! \nEven in the chilly, windy conditions, the chefs undoubtedly did a fantastic job served  us hot, delicious food. Chefs, we all staff put our hands together for you guys. \nEvery employee appreciated the hospitality \nRahul, thank you for making our experience very remarkable. \nI heartily suggest this venue for get-togethers and fun times.",
      "title": "Iftar Gathering",
      "trip_type": "Business",
      "travel_date": "2024-03-31",
      "user": {
        "username": "761lalitg",
        "user_location": {
          "id": "295424",
          "name": "Dubai, Emirate of Dubai"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/15/41/7b/02/lalit-g.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/15/41/7b/02/lalit-g.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/15/41/7b/02/lalit-g.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/15/41/7b/02/lalit-g.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/15/41/7b/02/lalit-g.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 944337527,
        "title": "Owner response",
        "text": "Dear 761lalitg,\n\nThank you so much for your wonderful feedback! We are absolutely pleased to hear that you had a fantastic evening at our iftar buffet.\n\nIt brings us great joy to know that you and your company enjoyed the ambiance, the live Arabic music, and the overall atmosphere of our venue. Our team works tirelessly to create a welcoming and comfortable environment for our guests, so it's fantastic to hear that you felt well taken care of.\n\nOur Food & Beverage service team takes great pride in delivering flawless service, and we're delighted that they were able to exceed your expectations. We will be sure to pass along your kind words to them.\n\nOur chefs are indeed culinary wizards, and they're thrilled to hear that you enjoyed the hot and delicious food despite the chilly weather. Your appreciation means the world to them.\n\nRahul is a valuable member of our team, and we're so glad that he played a part in making your experience remarkable. We'll be sure to share your gratitude with him.\n\nThank you for recommending our venue for get-togethers and fun times. We look forward to welcoming you and your company back for more memorable moments in the future.\n\nKind regards,\n\nNaleem Ariff\nMulti-Property General Manager",
        "lang": "en",
        "author": "Naleem  Ariff ",
        "published_date": "2024-03-29T02:40:23Z"
      }
    },
    {
      "id": 943981625,
      "lang": "en",
      "location_id": 304493,
      "published_date": "2024-03-27T05:15:50Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d304493-r943981625-Reviews-Sheraton_Jumeirah_Beach_Resort-Dubai_Emirate_of_Dubai.html?m=66827#review943981625",
      "text": "This amazing hotel on the JBR has the best staff we ever experienced!\nShahrees, kanna, Arkar, Fernan, Rimzan, Bilal, Dila, Cyril, Jimee,AnjanPalai, Hussain, Shoki, sreehja, Lodgi, Mahid, Kranthi, Dinusha ishan, Tracy, Esther, Lijesh,Areeya, Demi, Abdul, Arshad made our vacation wonderful! I hope the new German manager can keep this wonderful team together! We come back! Reinier ans Manon.",
      "title": "Best team from JBR",
      "trip_type": "Family",
      "travel_date": "2024-02-29",
      "user": {
        "username": "Rene-mestreech",
        "user_location": {
          "id": "188575",
          "name": "Maastricht, Limburg Province"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1c/bc/33/ec/rene-v.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1c/bc/33/ec/rene-v.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1c/bc/33/ec/rene-v.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1c/bc/33/ec/rene-v.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1c/bc/33/ec/rene-v.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 944337351,
        "title": "Owner response",
        "text": "Dear Reinier and Manon,\n\nThank you so much for your glowing review! We are pleased to hear that you had such an incredible experience with us at our hotel on JBR. Your kind words mean the world to us.\n\nWe couldn't agree more about our exceptional team members. Shahrees, Kanna, Arkar, Fernan, Rimzan, Bilal, Dila, Cyril, Jimee, Anjan Palai, Hussain, Shoki, Sreehja, Lodgi, Mahid, Kranthi, Dinusha Ishan, Tracy, Esther, Lijesh, Areeya, Demi, Abdul, Arshad, and all of our associates are dedicated to providing the best service possible, and we're delighted that they made your vacation wonderful.\n\nWe are looking forward to welcoming you back in the future and providing you with another unforgettable experience.\n\nKind regards,\n\nNaleem Ariff\nMulti-Property General Manager",
        "lang": "en",
        "author": "Naleem  Ariff ",
        "published_date": "2024-03-29T02:37:58Z"
      }
    },
    {
      "id": 943369578,
      "lang": "en",
      "location_id": 304493,
      "published_date": "2024-03-22T08:30:09Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d304493-r943369578-Reviews-Sheraton_Jumeirah_Beach_Resort-Dubai_Emirate_of_Dubai.html?m=66827#review943369578",
      "text": "Despite the renovation work our stay at the Sheraton Jumeirah Beach Resort was as always outstanding,fantastic and full of positive surprises.This hotel is our go to place for so many years….is the best in town for us.The ambiance is at this hotel always inviting and comfortable.The entire staff is very friendly, highly skilled, everything is very smooth and quick starting on the concierge with Mr. Jimmy , Mr.Fernan …than on the reception the very helpful Mr.Ali,Mr.Logie and Emma..the housekeeping …the room are  always very clean and well equipped by Mr.Jahfahr and Mr.Mahid….the recreation under the very friendly Mr.Soud with his great pool team Mr.Sasee,Mr.Bala, Mr. Budika..always nearby and  always helpful  and customer oriented.We are always completely impressed from the professionalism of their customer service and this in all sections of the hotel.During this time was Ramadan and we were able to enjoy the excellent cuisine, food from 1000 and one nights conjured up by the gods of kitchen around chef Raj …his entire team did cook every evening live…live cooking …wow…a 100% committed and above all customer oriented.The food quality is always consistently outstanding exceeding our expectations.We would like to mention Mr.Essam chef executive  who was always asking how we were doing , whether everything was Okay…a wonderful boss with great charisma that he passed on his employees and on us guests.\nWe want also to thank Mr.Jojo restaurant manager and his entire team from Palm Gardens, Mrs.Farzana,Mr.Veedu,Tracy,Steffany,Esther,Mr.Phio,Mr.Jahor,Mr.Kanan, Arkhar,Bernadette,Rakeshia,Anita..Mrs.Sharees from Hadid…all did a very good job and this every day.We highly recommend this hotel to anyone planing a vacation in Dubai..but also for business people.\n\nThis hotel offers you the best of all …the best location, great pool , the beach, the nearby walk, the Ain of Dubai, the nearby Marina, the Metro Station only minutes away…100 Points.   The Sheraton Jumeirah Beach resort means to us family.\n\nThanks again for the lovely time in your hotel…..will be back for sure.\n\nMonika and Erwin Kraemer/Germany, Room 201 , March 9 to March 23.2024",
      "title": "Great location,very friendly and helpful  staff, best food ….simply great",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "343erwink",
        "user_location": {
          "id": "562765",
          "name": "Gerlingen, Baden-Württemberg"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/2a/ce/12/5c/caption.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/2a/ce/12/5c/caption.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/2a/ce/12/5c/caption.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/2a/ce/12/5c/caption.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-m/1280/2a/ce/12/5c/caption.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 943868496,
        "title": "Owner response",
        "text": "Dear 343erwink,\n\nThank you immensely for your heartfelt feedback! We are thrilled to hear that your stay at Sheraton Jumeirah Beach Resort was outstanding, as always. Your kind words about our associates, amenities, and cuisine truly warm our hearts.\n\nWe can't wait to welcome you back for another fantastic stay with us! Your loyalty means the world to us, and we look forward to creating more unforgettable memories together.\n\n Kind regards,\n\nNaleem Ariff\nMulti-Property General Manager\n ",
        "lang": "en",
        "author": "Naleem  Ariff ",
        "published_date": "2024-03-26T06:43:01Z"
      }
    },
    {
      "id": 943335779,
      "lang": "en",
      "location_id": 304493,
      "published_date": "2024-03-22T00:53:12Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d304493-r943335779-Reviews-Sheraton_Jumeirah_Beach_Resort-Dubai_Emirate_of_Dubai.html?m=66827#review943335779",
      "text": "I'm currently staying here, when we checked in we were given a double room instead of a twin room , they said they will be able to accommodate us the following night in a twin. \n\nOur double room was on the opposite side to the renovated side (they are renovating the sea view rooms) \n\nThey were able to put is in a sea view room the following day (upgrade) which was very nice of them, however the drilling from 9am is too much, lucky we don't really spend any time in the room but my mum suffers from Tinitus and this unfortunately sets it off., so we probably should have stayed in the other room, or had a twin on the other side, without the sea view \n\nThey do say if it starts before 9am then call, our first 2 mornings they were banging at 730, so we called down to reception. \nThe pros of the hotel are definitely the staff, they are so welcoming and even remembered my name the 2nd time they saw me, Tracey and Bernadette are great in the buffet restaurant, even gave me a birthday cake at breakfast which was lovely!\nLuigo and Seyra from reception(I know I've spelt your name wrong, I'm sorry :( they were great and very helpful.\nLocation of this hotel is amazing, you step off the beach side of the hotel turn right and you have the whole of JBR right there.\nJavid from black sheep was  very nice and welcomed us. \n\nCons: \nThe all inclusive package is very minimal I feel compared to what the menu would be if we were paying, the buffet restaurant is open for breakfast, lunch and dinner (however it's closed for dinner during Ramadan and you have the Iftar buffet outside)\nYou have the Black Goose which offers a huge menu if you are paying, however for us all inclusive there is a limited menu of 2 starters 3 mains and 2 desserts, for both lunch and dinner (only 1 veggie option which is a bean burger) \n\nThey have the Lebanese restaurant that has more to choose from, plus drinks and shisha (shisha not included in AI package) \n\nThey have a taco bar and 3 separate bars by the beach that is not included in the AL package, which is a shame as the view would be great and its not nice to have to keep going to each bar asking if they are included in the AI, the whole point of AI is that you get to enjoy all of the food and drink like the other guests, but its all paid for in advance, so in the evening there are only 2 bars that offer drinks. \n\nThey have a beach bar that you can start ordering alcoholic drinks from 12:30,  on the AI or earlier if you're paying, again the food menu differs, the main menu is very big and you can order all day up until 6pm when it closes, however for the AI guests the menu limits down to around 6 options and is only served between 4-5:30 (very limited timing) \n\nThe drinks menu is okay, they have branded alcohol which is nice to see on an AI package and a few cocktails, they only have bottled Corona and Budwiser, so some of our party are paying for the Peroni here as they have this on draft. \n\nThey have an ice cream parlour which used to be included but now has been taken off the AI package. \n\nAll in all, I would probably stay here again after the renovations and not on the AI package. ",
      "title": "Would stay again but not all inclusive ",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "KAC1991",
        "user_location": {
          "id": "477981",
          "name": "Staines, Surrey, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ed/ce/default-avatar-2020-7.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ed/ce/default-avatar-2020-7.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ed/ce/default-avatar-2020-7.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ed/ce/default-avatar-2020-7.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ed/ce/default-avatar-2020-7.jpg"
        }
      },
      "subratings": {}
    }
  ]
}