{
  "data": [
    {
      "id": 201629999,
      "lang": "en",
      "location_id": 3161341,
      "published_date": "2014-04-18T03:03:52Z",
      "rating": 1,
      "helpful_votes": 9,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g298006-d3161341-r201629999-Reviews-Algani_Residence-Izmir_Izmir_Province_Turkish_Aegean_Coast.html?m=66827#review201629999",
      "text": "I have travelled to numerous countries, stayed in 1 star hostels to 5 star hotels, seen pretty much every kind of room possible....but this 'hotel' definitely was the worst hotel I've ever stayed in. \n\nWe checked in and the staff were pretty unhelpful and barely spoke English. I don't even mind the fact that they didn't speak English, but they didn't even make an attempt to explain anything or even help us out. They left us to walk up the stairs with our luggage (no elevator) and didn't even bother showing us the room. We both got the sense that they could care less about us being there.\n\nWhen we got to our room, It was dirty from front to back, the walls had grime on them, it looked about 20 years outdated and the paint hadn't been redone in years for starters. Secondly, it had a half shower--no tub, glass etc., no wifi (which it says there is), stained couches, broken doors and MOLDY BREAD in the kitchen cupboards. Not one piece, but about 4 or 5 pieces which shows they definitely do not clean it properly. We were grossed out from the start.\n\nLong story short, we checked out before even spending one of the 2 nights we booked. It was that uncomfortable. When we went to check out and tell them why, they again could care less and just kept saying to us \"expedia.com\"....we headed over to the IBIS hotel just around the corner which was the same price and felt like the Ritz compared to that dump of a place Algani Residence.\n\nI'm pretty sure the reviews in Turkish are done by the hotel themself or friends because anyone who has ever travelled knows that that place is a scam. I strongly advise anyone even remotely looking into this place to find somewhere else like the IBIS hotel which is the same price and much better. Hope this helps.\n\n",
      "title": "Worst hotel I've ever stayed in",
      "trip_type": "Couples",
      "travel_date": "2014-04-30",
      "user": {
        "username": "AnthonyDeGiorgio",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e4/a9/default-avatar-2020-50.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e4/a9/default-avatar-2020-50.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e4/a9/default-avatar-2020-50.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e4/a9/default-avatar-2020-50.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e4/a9/default-avatar-2020-50.jpg"
        }
      },
      "subratings": {}
    }
  ]
}