{
  "data": [
    {
      "id": 939782975,
      "lang": "en",
      "location_id": 3700591,
      "published_date": "2024-02-25T18:36:03Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g298663-d3700591-r939782975-Reviews-Vogue_Hotel_Supreme-Torba_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review939782975",
      "text": "Lovely hotel and stunning beach which is very close. We stayed in villas which were spacious and not very far. Food was delicious and my children enjoyed the candy land. Shows were high quantity and drinks were delicious.we loved every minute and we will definitely be back.",
      "title": "Great hotel and kids loved Candyland",
      "trip_type": "Family",
      "travel_date": "2023-08-31",
      "user": {
        "username": "Marianna1002",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/eb/e3/default-avatar-2020-59.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/eb/e3/default-avatar-2020-59.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/eb/e3/default-avatar-2020-59.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/eb/e3/default-avatar-2020-59.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/eb/e3/default-avatar-2020-59.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 941279664,
        "title": "Owner response",
        "text": "Dear valued guest,\n\nFirst and foremost, we would like to express our sincere gratitude for taking the time to share your heartfelt and valuable comments with us, and for giving us the opportunity to host you.\n\nWe will share your motivating and kind comments with our team members.\n\nWe hope to have the pleasure of welcoming you back to the exclusive atmosphere of Vogue Hotel Supreme very soon.\n\nWith deepest regards,",
        "lang": "en",
        "author": "Vogue Hotel Supreme Bodrum",
        "published_date": "2024-03-07T05:28:31Z"
      }
    },
    {
      "id": 939420624,
      "lang": "en",
      "location_id": 3700591,
      "published_date": "2024-02-22T18:20:20Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g298663-d3700591-r939420624-Reviews-Vogue_Hotel_Supreme-Torba_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review939420624",
      "text": "Stayed here for 11 nights in a superior garden view room with family and had a really good holiday apart from our last day… read on.\n\nHotel: very clean, rooms cleaned everyday, grounds immaculate, staff even sweeping and mopping water from the paths outside to keep grounds clean and tidy.\n\nStaff: don’t really engage with guests, don’t go out their way to help or make sure guests are ok. If you have a question and approach reception they will speak but won’t go out of their way. Had to figure a lot of the hotel out on our own, most hotels we visit reception usually give you a few pointers when you check in of where to go etc. and where you will find entertainment and restaurants etc but there was none of this. A map or something on check in would be helpful. The service from the barman in hotel lobby was amazing though (guy with bandana) he was so friendly and would make his version of any cocktail you asked for!\n\nFood: loads of choice, something different every night. They have a theme every night which is good so you don’t get dishes repeating so often. You get 1 visit to the a la carte restaurant during your stay, we opted for the Turkish restaurant which was outstanding. (You have to book your table at 9am on the day you want to go). Impressed with the drink selection too, all inclusive drinks are served in cans and bottles.\n\nPools: we spent most of our time at the large pool next to cabanas in front of hotel. There was also a little shallow pool next to this one for children with sand surrounding it. And you also have the beach just in front with plenty of sun loungers, we never had an issue trying to get sun loungers around the pool at anytime of the day which was good.\n\nEntertainment: we spent our evenings after dinner visiting the kids disco up at candy town, there’s a shuttle bus outside of hotel that runs you up and down or you can walk (steep hill, 5/10 min walk) the same shuttle bus runs you back and forth to candyland water park during the day right next to candy town. Candyland water park is brilliant, so much to do! Food and drink served here is also included in your all inclusive. \n\nBodrum town: staff can call you a taxi outside the front of hotel costs about €20. We went here one night which was so busy and went for a visit during the day too. Full of restaurants and shops with a lovely marina.\n\nLast day: we asked at reception if we could keep one room on as our flight was later at night so we paid around £70 for this. We were a party of 4 adults and 2 children. The plan was to move myself and my fiancés luggage into my sister and her family’s room before checkout so we could all go and spend our last day at the pool etc. we done this and handed our key in for the room we had finished with. Fast forward to 4pm when myself and my fiancé went to the room to have showers to get ready for leaving for the airport. My sister and her family stayed at the pool to give us space to get ready. When we got into the room we noticed the maids had been in and made the bed and emptied the bins etc. I was gathering my clothes together that I would be wearing to travel home in and noticed my trainers were missing? We searched all over the room and couldn’t find them, behind suitcases in wardrobe etc. nothing. Went and had a shower, got ready then searched again. Still nothing, strange as they had been next to everyone else’s footwear on the unit under the mirror out on show for us putting on for departure. My sister reported this to reception as we felt they had been taken from our room that day. No one wanted to help. They just said something along the lines of they would make a note of it? Fast forward to us ready to leave for the airport and my sister happened to glance over from the other side of the room and spotted my trainers under the unit pushed flush against the back wall, they were obviously placed here in the hopes of us checking out without finding them so when we had left staff could take these as we were now gone. My sister also had flashbacks of throughout the stay that snacks that she had purchased from the overpriced shop int the hotel for the kids and kept in the room fridge were missing when going back to the room but she didn’t think much of it at the time. Wanted to explain this as it seems like a plan they had in place to be able to steal personal belongings. Left us feeling angry on our final day, definitely wouldn’t return for this reason.",
      "title": "Clean hotel with lots to do! Keep an eye on personal belongings in your room…",
      "trip_type": "Family",
      "travel_date": "2023-09-30",
      "user": {
        "username": "Erinn1990",
        "user_location": {
          "id": "186529",
          "name": "Fife, Scotland"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/2b/79/7d/c2/caption.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/2b/79/7d/c2/caption.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/2b/79/7d/c2/caption.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/2b/79/7d/c2/caption.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-m/1280/2b/79/7d/c2/caption.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 941278802,
        "title": "Owner response",
        "text": "\nDear Guest,\n\nWe are here to make you happy and feel special, and we are extremely happy to have achieved this goal. Making you feel at home from the moment you step into the hotel is our top priority. The positive feedback we receive from you shows us that we are on the right track and motivates us. We are looking forward to welcoming you again and eagerly await the opportunity to create even more special moments for you.\n\nWith love and respect,",
        "lang": "en",
        "author": "Vogue Hotel Supreme Bodrum",
        "published_date": "2024-03-07T05:18:10Z"
      }
    },
    {
      "id": 936061093,
      "lang": "en",
      "location_id": 3700591,
      "published_date": "2024-01-30T09:54:00Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g298663-d3700591-r936061093-Reviews-Vogue_Hotel_Supreme-Torba_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review936061093",
      "text": "AWFUL AWFUL AWFUL… Rude staff who call me unprofessional when I’m trying to book a room at the price they Emailed me 2 days ago!\nThe hotels looks wonderful on their website but he was rude with no manners, talking over me… if this is the calibre of employee that works at this hotel… then I understand the awful reviews I’ve just read and will steer clear. Lots more to choose from 😡",
      "title": "Awful rude staff",
      "trip_type": "Family",
      "travel_date": "2024-01-31",
      "user": {
        "username": "Road59938396151",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ee/db/default-avatar-2020-10.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ee/db/default-avatar-2020-10.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ee/db/default-avatar-2020-10.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ee/db/default-avatar-2020-10.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ee/db/default-avatar-2020-10.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 935451014,
      "lang": "en",
      "location_id": 3700591,
      "published_date": "2024-01-24T17:27:21Z",
      "rating": 1,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g298663-d3700591-r935451014-Reviews-Vogue_Hotel_Supreme-Torba_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review935451014",
      "text": "I had previously written this review but was last August but was contacted by the hotel’s guest relations manager, Gokhan Acun, and he reluctantly asked me to remove the review and that in return I would get a free stay at their hotel this year so I removed it last November. I asked over and over about him being certain and he promised that he would get us confirmation letters sent straight away. \n\nHowever… It all turned out to be a big lie. \nNow he’s not answering any calls or texts and I’m getting blunt replies from the hotel telling me he doesn’t work there anymore, and after me explaining and showing them the messages, they are supposedly giving me a discount, which works out to be more expensive than what I paid last year 🤦🏽‍♂️\n\nLUCKILY, although they are in Turkish, I have WhatsApp messages to prove it so I have attached them to this review. Ealsily get them translated to see the BS I was provided with. \n\nAll in all, we had the worst holiday experience followed by a tail of lies just so they can cover the crap. \n\nSo I will now continue with my previous review, and PLEASE READ CAREFULLY as it could potentially save you from a holiday nightmare which you will regret!!\n\n‘I really don’t know where to start.. \nwe paid £7000 for 10 nights for a room in the main building but when we arrived, I had to pay another £1200 as we were given an annex room miles away and I couldn’t afford to take that as I have 2 small kids. When I asked why I was told differently, the receptionist just stared. \n\nI had to change rooms 4 times on the first night as the rooms were smelling and you couldn’t see the sea although we paid a sea view room. \n\nWe waited 3 hours for the baby cots, and the worst thing is I literally had to walk to reception 6 times as they would not pick up the phone. I started to shout at them and again, they would just stare. And without any exaggeration, there were at least another 8 people complaining. \n\nThe Wi-Fi is absolutely terrible! For a class of this hotel sort I was very surprised. \nWe had to go to Bodrum centre and buy SIM cards just for that reason. Every time I complained they would give a different excuse. Main reason was electricity cut out. \n\nAnother issue was the air conditioning in the room which was apparently linked to the electricity cutting out. We constantly had to get up and switch it on during the night. \n\nA hotel of this standard shouldn’t have problems like electricity for all I know. There must be a way to prevent it. I have been to almost all the hotels in that region and around the world and I can say with confidence that this was the worst experience. We really got to the point of giving up and didn’t complain anymore as nothing was being done about it. \n\nI was told by the staff that the hotel was over capacity of roughly 1000 guests therefore short staffed all around. Breakfast, bar, cafe, restaurant, even trying to get a towel at the beach, there are massive cues because there is not enough staff. \n\nStaff were friendly and helpful but only so much they could do. \n\nThe main restaurant opened for dinner at 7pm and every night, 100’s of guests would get ready to barge because there was not enough tables to 100’s of guests standing watching the others eat. \n\nThese are petty things that you really shouldn’t encounter at a 5 star hotel, and there is only so much I can write here, but it was really a terrible experience. \n\nTherefore as nasty as it may sound, try and avoid this hotel.’",
      "title": "Absolutely conned!! Avoid at all costs!!",
      "trip_type": "Family",
      "travel_date": "2023-07-31",
      "user": {
        "username": "Uga9",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e2/4a/default-avatar-2020-42.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e2/4a/default-avatar-2020-42.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e2/4a/default-avatar-2020-42.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e2/4a/default-avatar-2020-42.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e2/4a/default-avatar-2020-42.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Service"
        }
      }
    },
    {
      "id": 934140416,
      "lang": "en",
      "location_id": 3700591,
      "published_date": "2024-01-15T12:26:37Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g298663-d3700591-r934140416-Reviews-Vogue_Hotel_Supreme-Torba_Bodrum_District_Mugla_Province_Turkish_Aegean_Coast.html?m=66827#review934140416",
      "text": "Wonderful experience! The best UAL food we have ever had and especially the deserts. Plenty of pools and leisure activities for both adults and kids. The sea is crystal clear and the private beach is sandy and large enough to accommodate all guests. We will return next summer, already booked.",
      "title": "Best UAL hotel by far",
      "trip_type": "Family",
      "travel_date": "2023-06-30",
      "user": {
        "username": "Asya_Stoyanova",
        "user_location": {
          "id": "294452",
          "name": "Sofia, Sofia Region"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/03/5d/fc/73/amandajukova.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/03/5d/fc/73/amandajukova.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/03/5d/fc/73/amandajukova.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/03/5d/fc/73/amandajukova.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/03/5d/fc/73/amandajukova.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 941280042,
        "title": "Owner response",
        "text": "Dear valued guest,\n\nFirst and foremost, we would like to express our sincere gratitude for taking the time to share your heartfelt and valuable comments with us, and for giving us the opportunity to host you.\n\nWe will share your motivating and kind comments with our team members.\n\nWe hope to have the pleasure of welcoming you back to the exclusive atmosphere of Vogue Hotel Supreme very soon.\n\nWith deepest regards,",
        "lang": "en",
        "author": "Vogue Hotel Supreme Bodrum",
        "published_date": "2024-03-07T05:32:59Z"
      }
    }
  ]
}