{
  "data": [
    {
      "id": 945614293,
      "lang": "en",
      "location_id": 506195,
      "published_date": "2024-04-06T16:26:36Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d506195-r945614293-Reviews-Jumeirah_Dar_Al_Masyaf-Dubai_Emirate_of_Dubai.html?m=66827#review945614293",
      "text": "Another great stay at this hotel- will be remembered for the little things including the service which goes far beyond expectations. A huge thank you to Vijaya the abra boat driver who always served with a smile and took excellent photos- memories we will cherish!",
      "title": "Wonderful stay",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "833deepap",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/eb/6d/default-avatar-2020-19.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/eb/6d/default-avatar-2020-19.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/eb/6d/default-avatar-2020-19.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/eb/6d/default-avatar-2020-19.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/eb/6d/default-avatar-2020-19.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 945934278,
        "title": "Owner response",
        "text": "Dear 833deepap,\n\nThank you so much for your kind words and for choosing to stay with us once again. We're thrilled to hear that you had another great stay at our hotel and that you appreciated the exceptional service provided by our team.\n\nVijaya, our abra boat driver, will be delighted to hear that he made a positive impact on your stay. We're glad to hear that his warm smile and excellent service contributed to creating cherished memories for you during your time with us.\n\nAt our hotel, we strive to go above and beyond to exceed our guests' expectations, and it's incredibly rewarding to hear that our efforts were noticed and appreciated by you.\n\nThank you once again for your wonderful feedback. We look forward to welcoming you back for another memorable stay in the future.\n\nBest Regards,\n\nRodolphe Pialat\nHotel Manager\nJumeirah Al Qasr & Dar Al Masyaf  \n",
        "lang": "en",
        "author": "Madinat  J",
        "published_date": "2024-04-09T06:02:02Z"
      }
    },
    {
      "id": 945546175,
      "lang": "en",
      "location_id": 506195,
      "published_date": "2024-04-06T06:06:28Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d506195-r945546175-Reviews-Jumeirah_Dar_Al_Masyaf-Dubai_Emirate_of_Dubai.html?m=66827#review945546175",
      "text": "Although check-in was not a nice experience at all with a snobbish lady and could sometimes take longer as expected due to just 2 staff at rush hour the resort itself is wonderfully decorated and arranged with all the lagoons, palms and flowers. We visited during Easter so hotel was at full capacity and therefore very hectic at breakfast but this comes with such a huge hotel complex as Al Qasr and Al Masyaf share one breakfast spot (we did not muse French Riviera since a La carte was expected to take longer for our 1YO). Pool staff was very attentive. Room was very comfortable and big in size. We opted for a suite which was the right choice for us. The resort is perfect for families and there is so much to do so you literally don’t need to exit the resort. Perfect scenery if you just have a few days. Food and all restaurants we tried were very good. We felt the One & Only Royal Mirage a bit more luxurious and staff very definitely more attentive there however we want to particularly express our gratitude and thank you to Ashis our butler at villa 3 as well as Sabina and Rhoneza from housekeeping. They did the best job and we leave now with good memory overall of this stay mainly because of them",
      "title": "A wonderful stay over all",
      "trip_type": "Family",
      "travel_date": "2024-04-30",
      "user": {
        "username": "Flo284",
        "user_location": {
          "id": "187275",
          "name": "Germany"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/df/2b/default-avatar-2020-39.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/df/2b/default-avatar-2020-39.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/df/2b/default-avatar-2020-39.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/df/2b/default-avatar-2020-39.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/df/2b/default-avatar-2020-39.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 945935466,
        "title": "Owner response",
        "text": "Dear Flo284,\n\nThank you for sharing your feedback regarding your recent stay at our resort. While we are delighted to hear that you enjoyed the overall experience and found the resort wonderfully decorated and family-friendly, we apologize for any inconvenience you experienced during the check-in process.\n\nWe regret to hear about your encounter with our team member, and we assure you that your feedback will be addressed internally to ensure that all guests are treated with the utmost respect and professionalism at all times.\n\nIt's heartening to know that you found the pool staff to be attentive and that you had a comfortable and enjoyable stay in our suite. We're thrilled that you appreciated the variety of activities available within the resort and that you enjoyed the dining options at our restaurants.\n\nWe greatly appreciate your recognition of Ashis, Sabina, and Rhoneza for their exceptional service. We will be sure to pass on your kind words to them as they exemplify the level of service, we strive to provide to all our guests.\n\nYour feedback is invaluable to us as we continuously work to improve our services and offerings. We hope to have the pleasure of welcoming you back for another memorable stay in the future.\n\nBest Regards,\n\nRodolphe Pialat\nHotel Manager\nJumeirah Al Qasr & Dar Al Masyaf  ",
        "lang": "en",
        "author": "Madinat  J",
        "published_date": "2024-04-09T06:15:00Z"
      }
    },
    {
      "id": 945505158,
      "lang": "en",
      "location_id": 506195,
      "published_date": "2024-04-05T18:47:10Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d506195-r945505158-Reviews-Jumeirah_Dar_Al_Masyaf-Dubai_Emirate_of_Dubai.html?m=66827#review945505158",
      "text": "We stayed here for four nights in February 2024.  We booked as part of a package with BA and the hotel was approximately £500 per night.  On this occasion BA did not award any Tier Points for the hotel component.\n\nIf you are new to Dubai, the Jumeirah Beach complex stretches for miles along the beach between Dubai and Abu Dhabi and comprises a great many hotels of varying quality and prices.  At the top of the tree is the 6-star Burg al Arab; the Dar Al Masyaf is one under the al Arab and is, in fact, the villa-only section of the Jumeirah Al Qasr.  Confused?  I was and am still not sure I understand all the options.\n\nCheck in is at the Al Qasr (taxi drivers are unlikely to have heard of the Dar Al Masyaf) and from there a golf cart takes you to your villa.  There are eight villas in each complex and a shared swimming pool for each group of three complexes.  The rooms are vast and decorated with an understated yet luxurious Moorish influence.  The bathroom sports his 'n' hers basins, a huge whirlpool tub and separate shower and loo.  The courtesy sets are proprietary and smell suitably exotic.  There is ample room to hang clothes and each villa has a private balcony.  Happy hour is served each afternoon.\n\nAnything you might need (including restaurant reservations, a gold cart, and taxis) is just a quick call to your concierge away.  The butler service was non-existant (or perhaps we didn't request an available service but pressing clothes is not part of the deal).\n\nThe private pool not only has a lifeguard but also a call bell by each lounger with three different buzzers depending on your requirement.  The hut sports three types of suncream, chilled drinks and even wipes for your sunnies!  There is also a lifeguard!  This seemed superfluous but I suppose it allows parents to doze off knowing that the kiddies are safe.\n\nBreakfast is in the Al Qasr main building which is (depending on where you are) a 10-minute walk along winding paths or a quick golf-cart journey.  Lavish is an understatement, for this is a tennis-court size breakfast buffet to cater for every possible global morning ritual.  From Japan to America via Turkey and Scandinavia, it is all here.  Don't miss it!\n\nIn terms of dining, your Dar Al Masyaf room key gets you access to any one of more than dozen restos representing a broad spectrum of options including Greek (really very good despite the naff name 'Shimmers'), Italian, Thai, Indian, Steakhouse, French, Casual dining and no doubt many more I can't remember.  The only slight criticism relates to the half-board option we had chosen:  it is neither a credit nor a set menu but a series of menu options which appeared to make little financial sense.  Given that you can pay with a credit card (or your room key) everywhere we would opt for Bed and Breakfast next time.\n\nIn summary, the understated luxury and astonishingly good level of service took my breath away.  I cannot imagine ever needing more hotel.  It was equally easy to find a quiet spot for sundowners or a noisy bar for cocktails.  The beaches are glorious and the public spaces opulently decorated and meticulously maintained.  The staff were couteous, welcoming and always seemed to be on hand when you needed them and never when you didn't.  We loved it.\n\nHaving said all that, it isn't possible to mention Dubai without discussing the appalling traffic.  For a small city it takes absolutely ages to get anywhere and public transport is limited.  In fairness, there is little reason to leave an oasis of this calibre but even a trip to the Burg Kalifa, the gold market or any of the malls seemed to take forever.\n\nYou may also want to spare a thought for the small army of workers who make your stay so enjoyable.  If modern day slavery concerns you then you ought to know that the UAE ranks 7th in the world with an estimated 132,000 individuals working under the Kafala system.  Having listened to both sides of the argument, you'll need to make up your own mind.  Harvard has published a balanced review entitled 'Taken Hostage in Dubai'.\n\nNone of which takes anything away from the Jumeirah Dar Al Masyaf, unquestionably one of the world's finest hotels.",
      "title": "All the hotel one could want",
      "trip_type": "Couples",
      "travel_date": "2024-02-29",
      "user": {
        "username": "L3917AVmichaelp",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/2a/e7/27/a1/michael-p.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/2a/e7/27/a1/michael-p.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/2a/e7/27/a1/michael-p.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/2a/e7/27/a1/michael-p.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-m/1280/2a/e7/27/a1/michael-p.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 945935085,
        "title": "Owner response",
        "text": "Dear L3917AVmichaelp,\n\nThank you immensely for taking the time to provide such a detailed and insightful review of your recent stay at Jumeirah Dar Al Masyaf. We truly appreciate your thorough assessment and are delighted to hear that you enjoyed various aspects of your experience with us.\n\nWe're thrilled to hear that you found our villas to be luxurious with their Moorish influence and appreciated the amenities provided. It's delightful to know that you had a memorable breakfast experience at Al Qasr and that you found our dining options to be diverse and satisfying. Your feedback regarding the half-board option is duly noted, and we will review it for improvement.\n\nMoreover, we are pleased to hear that you found our service to be astonishingly good and that our staff was courteous and welcoming. Your recognition of their efforts means a lot to us, and we will certainly pass on your compliments to the team.\n\nRegarding your mention of Dubai's traffic and concerns about labor practices, we understand the importance of these issues and encourage open dialogue. We strive to uphold the highest standards of ethical conduct and social responsibility in all aspects of our operations.\n\nOnce again, we thank you for choosing Jumeirah Dar Al Masyaf, and we hope to have the pleasure of welcoming you back for another exceptional stay in the future.\n\nBest Regards,\nRodolphe Pialat\nHotel Manager\nJumeirah Al Qasr & Dar Al Masyaf ",
        "lang": "en",
        "author": "Madinat  J",
        "published_date": "2024-04-09T06:11:15Z"
      }
    },
    {
      "id": 944775746,
      "lang": "en",
      "location_id": 506195,
      "published_date": "2024-04-01T07:57:45Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d506195-r944775746-Reviews-Jumeirah_Dar_Al_Masyaf-Dubai_Emirate_of_Dubai.html?m=66827#review944775746",
      "text": "What used to be a great family hotel has started to be average due to lack of efficient management. Although admittedly we visited during the peak of high season, the mess between Reservations, Reception and bad communication resulted in us spending three days (out of ten of our total holiday), packing and unpacking. Not ideal to say the least. To compensate, the management removed approximately a night’s charge from the bill. But, time is the true luxury in life,  and if you can afford a 1,000gbp per night room, a financial compensation makes little sense. Time lost, in our case three days, is much more valuable than a few pounds. The restaurants are still good, the beach beautiful, and the kids club super kind. Also, good luck if you are a  woman alone and you need to board an abra to go to your room. Overall, what used to be a great family hotel with excellent service 10 years ago, is now catering to a more mass tourism audience. It will most probably always be full, but not for the discerning traveller.",
      "title": "Not what it used to be",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "Quest549795",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f0/48/default-avatar-2020-15.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f0/48/default-avatar-2020-15.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f0/48/default-avatar-2020-15.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f0/48/default-avatar-2020-15.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f0/48/default-avatar-2020-15.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 944888229,
        "title": "Owner response",
        "text": "Dear Quest,\n\nThank you for sharing your feedback with us regarding your recent stay at our hotel. We truly value all feedback from our guests as it helps us identify areas for improvement and ensures that we continue to provide the best possible experience for everyone.\n\nI am sincerely sorry to hear about the challenges you experienced during your stay, particularly with regards to the issues you encountered with reservations, reception, and communication. Your time is indeed precious, and I completely understand how frustrating it must have been to spend three days of your holiday dealing with packing and unpacking due to these issues. Please accept my apologies for the inconvenience this caused you and your family.\n\nWe are committed to continuously improving our services and facilities to meet the evolving needs and expectations of our guests. Your feedback will be shared with our management team for further review and action.\n\nOnce again, I apologize for the inconveniences you experienced during your stay. We sincerely hope to have the opportunity to welcome you back in the future and provide you with a much-improved experience that exceeds your expectations.\n\nWith best regards, \nRodolphe Pialat \nHotel Manager \nJumeirah Al Qasr & Dar Al Masyaf\n",
        "lang": "en",
        "author": "Madinat  Jumeirah ",
        "published_date": "2024-04-02T02:42:12Z"
      }
    },
    {
      "id": 944257612,
      "lang": "en",
      "location_id": 506195,
      "published_date": "2024-03-28T10:17:35Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d506195-r944257612-Reviews-Jumeirah_Dar_Al_Masyaf-Dubai_Emirate_of_Dubai.html?m=66827#review944257612",
      "text": "From the butler in the Villa (Ashis) for whom nothing was too much, to the Abra drivers, golf cart drivers everything was amazing.\n5 days with an amazing view of the beach left us both full recharged.\nDuluth Guyan was the perfect manager as well, ensuring everything was 5 stars.\nAtrangi - try the tasting menu! You won’t forget it easily.\nAnd The Meat Co - a wagyu steak I’ll always remember for flavour, texture….\nTortuga for a casual Mexican meal. \nSo many great choices of food, so many things to do, you don’t have to leave the resort if you don’t want!!!",
      "title": "The Perfect Recharge Break",
      "trip_type": "Couples",
      "travel_date": "2024-03-31",
      "user": {
        "username": "nicolasmG2172EL",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/13/07/b4/e3/nicolas-m.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/13/07/b4/e3/nicolas-m.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/13/07/b4/e3/nicolas-m.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/13/07/b4/e3/nicolas-m.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 944887942,
        "title": "Owner response",
        "text": "Dear Nicolas,\n\nThank you immensely for taking the time to share your feedback with us. Your kind words truly brightened our day and reaffirmed our commitment to providing exceptional service and experiences to our guests.\n\nI'm thrilled to hear that your stay at the villa was nothing short of amazing. It's heartwarming to know that Ashis, our butler, and the rest of the team, including the Abra drivers and golf cart drivers, contributed to making your experience memorable. Your satisfaction and relaxation are our top priorities, and I'm delighted that you felt fully recharged after your five days with us.\n\nI will personally pass on your compliments to Duluth Guyan, our manager. It's fantastic to hear that his efforts in ensuring everything was of five-star quality did not go unnoticed.\n\nOnce again, thank you for your glowing feedback. We sincerely appreciate your support, and we look forward to welcoming you back for another unforgettable experience at our resort.\n\nWith best regards, \nRodolphe Pialat \nHotel Manager \nJumeirah Al Qasr & Dar Al Masyaf\n\n",
        "lang": "en",
        "author": "Madinat  Jumeirah ",
        "published_date": "2024-04-02T02:38:50Z"
      }
    }
  ]
}