{
  "data": [
    {
      "id": 945941734,
      "lang": "en",
      "location_id": 568401,
      "published_date": "2024-04-09T07:20:39Z",
      "rating": 5,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g20116893-d568401-r945941734-Reviews-Liberty_Hotels_Lara-Kemeragzi_Antalya_Turkish_Mediterranean_Coast.html?m=66827#review945941734",
      "text": "Well what can we say from start to finish we had a great Easter family get away we returned after our first trip at Christmas and this hotel just keeps getting better the food and drinks are great rooms spotless and spacious the hotel and grounds are keep immaculate staff and service are great especially omer and Baker from the entertainment team Mustafa from guest relations they are such a credit to the hotel it truly does feel like a home away from home that we will keep returning to for many years to come thank you so much if we had one slight concern it would be sunbeds and the fact they are constantly being reserved so early even though signs were out asking people not to the signs were ignored \n\nA little review from our daughters Thea aged 9 kiayah aged 13 and Cheyenne aged 14\n\nThe drinks and food are amazing there was lots for us to do and we were never bored thank you for keeping the pool by the restaurant heated through out our stay we really enjoyed it and wish it was heated at Christmas so we could have enjoyed our Christmas stay even more from our point of view (from the 13 and 14 year old) it would be great to see more activities for older teens to go maybe a space where teenagers could relax with with games consoles or something WiFi is great BTW we really enjoyed being able to keep in contact with friends back home we really enjoyed the ice cream and waffle stations wish they were open longer in the evenings or late afternoons it would be so great to maybe have a film on or something with popcorn and candyfloss we loved our return turn stay thank you to all the staff for all their hard work this is definitely one of the best hotels our parents have taken us to we look forward to seeing you all again very soon from Cheyenne Kiayah and Thea ",
      "title": "Another stay at this true gem perfect Easter break ",
      "trip_type": "Family",
      "travel_date": "2024-04-30",
      "user": {
        "username": "599candij",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/17/4c/e0/94/avatar.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/17/4c/e0/94/avatar.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/17/4c/e0/94/avatar.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/17/4c/e0/94/avatar.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-m/1280/17/4c/e0/94/avatar.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 945886519,
      "lang": "en",
      "location_id": 568401,
      "published_date": "2024-04-08T17:14:13Z",
      "rating": 5,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g20116893-d568401-r945886519-Reviews-Liberty_Hotels_Lara-Kemeragzi_Antalya_Turkish_Mediterranean_Coast.html?m=66827#review945886519",
      "text": "WOWWW what a fab hotel, which we cannot fault and certainly enjoyed our 10night visit.      \n\nThis hotel thrives itself no keeping its customers happy and they certainly did that, thank you to the staff, as mentioned in previous reviews this is down to good management.    \n\nThe reception area is impressive on arrival , it looks like the inside of a cruise ship.  \n\nThe main restaurant was self-service and offered so much food, it would take too long to write about, but know if you go to this hotel, you will not go hungry.     The selection of fruits and cakes is astounding and hard to choose (the baclava was amazing by the way).   The salad bar has many options which go well with the fresh food which is cooked outside on the BBQ area or to dishes prepared.\n\nWhilst there we also experienced the turkish and italian al la carte restaurants, which were both yummy.   The Balbura snack bar was only open for our last 2 days (Thank goodness as the food was yummier and hard to pick from) which was a freshly cooked food which you ordered from a menu with waiter service.     If you love pizzas, make sure you try the Kalynda Snack house, they are made in front of you after you have chosen the toppings.  You can eat them in the seating area there or take back to you sun lounger. \n\nThere is  a coffee hut opened during the day which offers yummy coffee (I found a new love for iced coffee thanks to this hut) and then from 1300hrs nearby is a waffle and ice cream area which is dangerous to walk by as you get drawned to try the cake selections.     \n\nThe hotel provides you with pool towels, which you can get from 0830hrs, there are those who wake early to save their sun loungers, but we went down about 0900--0930 and were able to find loungers by the bigger pool.   The heated pool was more popular, especially with children.     There are those who leave towels at dawn and are not seen till afternoon (which are so annoying).  \n\nAs you chill staff are walking around getting you drinks, which is such a great touch, or you get them yourselves. \n\nThe only fault I have with the pool area is the temperature of the main pool (this time of year) it was very cold, sadly too cold to enjoy for long periods.   We used the slides a couple of times, but again, the pool temperature effected the usage. \n\nThe private beach is close by, a little stony and when the sun has warmed up the sand it is very hot to walk on.. so be prepared.   \n\nThere are entertainment staff walking around during the day to  tell you about the days events and they are not forceful in getting you to get involved.     Near the lifts on each floor there is a poster displaying the evening entertainment.   Whilst there it was mostly in the Tlos bar, which was a tad cramped.   We had one night of being at the outside Apollon bar which was fun and better due to the size of the location.  \n\nWe had many a cocktails in the main bar, playing Uno enjoying the relaxed atmosphere and bowls of nuts or crisps which are provided for you.   \n\nWe obtained help from Guest Services and Emrah went out of his way to help us with booking a restaurant,  getting a taxi into town and advising where to go and where to avoid.   He made us feel important to him, credit to the team.   \n\nI would highly recommend this hotel,  the staff were friendly, helpful and accommodating.  I  was impressed with how many languages some of the staff spoke, English, Dutch, Russian, German and Turkish.    \n\nA 5 star hotel which provides 5 star service and food which makes you feel 5 star.  Thank you for a such a lovely visit.",
      "title": "You Won't Be Disappointed",
      "trip_type": "Family",
      "travel_date": "2024-04-30",
      "user": {
        "username": "louisee601",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ee/db/default-avatar-2020-10.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ee/db/default-avatar-2020-10.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ee/db/default-avatar-2020-10.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ee/db/default-avatar-2020-10.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ee/db/default-avatar-2020-10.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 945912537,
        "title": "Owner response",
        "text": "Thank you so much for your glowing review!\nWe're thrilled to hear that you had such a fantastic experience during your 10-night stay at our hotel. It's wonderful to know that you enjoyed our wide range of dining options, including the main restaurant and our specialty restaurants, as well as the delicious snacks available at the various bars.\nWe're glad that you found our pool area enjoyable, although we apologize for any inconvenience caused by the temperature of the main pool. We'll certainly take your feedback into consideration to see how we can improve in the future.\nIt's also heartening to hear that our entertainment options and guest services team, especially Emrah, exceeded your expectations and helped make your stay memorable.\nThank you for recommending our hotel and for highlighting the friendliness and multilingual abilities of our staff. We strive to provide top-notch service to all our guests, and we're delighted that we were able to meet your expectations.\nWe hope to have the pleasure of welcoming you back for another 5-star experience in the future!\n\nBest regards,",
        "lang": "en",
        "author": "Güney Şakar",
        "published_date": "2024-04-09T01:49:38Z"
      }
    },
    {
      "id": 945449537,
      "lang": "en",
      "location_id": 568401,
      "published_date": "2024-04-05T09:49:49Z",
      "rating": 5,
      "helpful_votes": 2,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g20116893-d568401-r945449537-Reviews-Liberty_Hotels_Lara-Kemeragzi_Antalya_Turkish_Mediterranean_Coast.html?m=66827#review945449537",
      "text": "I stayed in this hotel from March 28 to April 3.\nFirst of all, I have to say that I have stayed in many 5 star hotels in Kemer, Belek and Antalya.\nAs a person who has many years of management experience, I must say  congratulations to the management and owners of this hotel.👌\nFor this reason, I send this main greeting to them, because I know very well that without a strong and efficient management and customer-oriented thinking, the possibility of what I saw would never have existed.  💯🌺\nTherefore, I honestly try to state the strengths and weaknesses. \n\nThe strengths of this hotel are : Excellen location, very good sandy beach, very responsible and warm-hearted staff, very varied and excellent meals according to each person's taste. \nVery high quality drinks, excellent cleanliness and cleanliness in all parts of the hotel. \nVery beautiful and appropriate swimming pools and the possibility of using a very good water slide with the possibility of using very excellent private beach facilities. \nVery clean drinking bars & restaurants with the principles of cleanliness even during the busiest service hours.\nPlayfulness and lack of stinginess in providing all the essential needs of passengers. \nResponding to the hotel's customer service desk. \nCleaning the rooms on time and charging the mini bar every day. \n\nBut the weaknesses :\nDue to the special design of the hotel and glazing, the Unconventional voices of the passengers penetrates inside the rooms, especially at the end of the nights , this is very annoying and prevent you from sleeping especially after a busy day when you need to rest . \nIn this case, I suggest that in order to eliminate this big flaw, the intelligent and generous management of the hotel should use the design and complete the windows of the each floors up to the upper floor in order to prevent the penetration of sound into the floors and rooms!! .\n Of course, this work will be helpful in terms of energy consumption, and since glass should be used, it has no effect on lighting the corridors in terms of lighting.\n\nThe second disadvantage, in my opinion, is that the space inside the rooms is a little smaller than hotels of the same category. \nThe last point is the weakness of the hotel's nightly entertainment programs, which were not up to the mark and, in my opinion, were very, very weak and I kindly suggest to strong management of the hotel,, think more  about it ! \nOf course, during these days, the hotel was almost full and we had to spend a relatively long time in the elevator queue to move between the floors, which may be justified. \n\nIn the end, considering all the details I said, I think that despite the mentioned flaws, the hotel was acceptable as a whole and I will probably try to stay there again.  Greetings and thanks to all its kind and hardworking employees. 🙏🌺🌺🌺\n",
      "title": "Excellent Hotel! ",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "30khalilr",
        "user_location": {
          "id": "293999",
          "name": "Tehran, Tehran Province"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f2/11/default-avatar-2020-23.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f2/11/default-avatar-2020-23.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f2/11/default-avatar-2020-23.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f2/11/default-avatar-2020-23.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f2/11/default-avatar-2020-23.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 945527071,
        "title": "Owner response",
        "text": "Dear valued guest,\n\nThank you for taking the time to share your detailed feedback regarding your recent stay at our hotel. We are honored to have had the opportunity to host you, and we truly appreciate your insightful comments.\n\nFirstly, we are delighted that you found numerous strengths in our hotel, including our excellent location, beautiful sandy beach, responsible and warm-hearted staff, varied and excellent meals, high-quality drinks, cleanliness throughout the hotel, well-maintained swimming pools and water slide, clean dining areas, and prompt room cleaning service with daily minibar restocking. Your recognition of these aspects of our hotel experience means a lot to us, and we are thrilled that we were able to meet your expectations in so many areas.\n\nHowever, we also value your constructive criticism regarding the weaknesses you identified. We apologize for any inconvenience caused by noise penetration into the rooms, particularly during the night. Your suggestion regarding upgrading the windows to prevent sound penetration is duly noted, and we will certainly consider it as part of our ongoing efforts to enhance guest comfort. Additionally, we appreciate your feedback regarding the size of the rooms and the quality of our nightly entertainment programs. Rest assured, we will take your comments into account as we continue to evaluate and improve our services and facilities.\n\nWe are grateful for your kind words and recognition of our hardworking employees. They are the heart of our hotel, and we will be sure to pass on your appreciation to them.\n\nOnce again, thank you for choosing to stay with us, and we hope to have the opportunity to welcome you back for another enjoyable stay in the future.\n\nWarm regards,",
        "lang": "en",
        "author": "Güney Şakar",
        "published_date": "2024-04-06T02:13:19Z"
      }
    },
    {
      "id": 945447679,
      "lang": "en",
      "location_id": 568401,
      "published_date": "2024-04-05T09:32:46Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g20116893-d568401-r945447679-Reviews-Liberty_Hotels_Lara-Kemeragzi_Antalya_Turkish_Mediterranean_Coast.html?m=66827#review945447679",
      "text": "Just returned from 10 days at the Liberty, an outstanding experience from start to finish.\nFrom the pre-arrival correspondence with Emin the reception manager who dealt with questions promptly, and whilst there, who was always willing to speak however busy such a nice helpful guy.\nFrom the moment you arrive its clear the No 1 focus is on customer service and the desire to make sure everything is just right.\nStep beyond the hotel's building and you will be amazed at the pool areas and grounds leading to the beach. They are stunning, spacious and so relaxing and when you couple that with the effort to serve you wherever you are they were ideal. \nJan the rollerblading waiter was amazing, funny, chatty and just a complete one off guy flying around with a tray of drinks.\nJust everything was aimed at looking after guests and when you saw the number of staff on duty to do that its clear management have thought about what is needed to make it happen.\nThe buffet restaurant did an amazing job through all the servings with so much choice and when you added in the outdoor barbecue and live Tai cooking station plus outdoor poolside dining it was delightful. The daytime Pizza station near the beach covered any casual eating if you didn't want to venture to the dining room.\nThe included visit to the a-la-carte restaurant  ( the Turkish) was top quality, a six course multi menu serving by attentive staff.\nAll the bars were well staffed with only short waits for table service with a vast choice of inclusive drinks both inside the hotel and around the pools.\nOur housekeeping star, Sibel Sew, kept our room spotless and what a delight to see her smiling face daily greeting us.\nIts hard to single out staff when so many of them looked after us but these guys were the ones who we came into contact with most.\nEmin on reception so hardworking and humble in wanting to answer all questions.\nHilal in the dining room so efficient, no empty wine glasses here, and a standout guy.\nGuney a waiter who popped up everywhere, so happy and pleasant, working so hard but always found time to chat.\nNur in the Tlos bar, her smiling welcome encouraged frequent visits.\nFinally Mustafa, Customer Relations Desk, just quite the most amazing chap you could wish to meet. Not the usual secondary, limited hours service, more a hands on dedicated man, so eloquent and interested in guests. He phoned our room to check all ok, visited the restaurant at night and did a table visit at the a-la-carte it felt all guests were special to him.\nGeneral comments, the rooms are very comfortable with free stocked mini bar and safe, they are showing minor upgrade items neede but nothing to cause an issue. Management are aware of the need to move forward whilst balancing that with shutting the hotel for works, on balance it's got far too many positives as it is so just carry on you will not be disappointed.\nEntertainment was provided on six nights, a bit mixed but it was slightly out of season so no big deal, we did see several quality singing groups though. \nGetting around, use the local buses with a contactless debit card, 18Tl equivalent to 44p single fare even to Antalya City, very frequent, quick and clean.\nAn exceptional holiday made perfect by the Liberty and its staff. Will definitely return.\n",
      "title": "An Exceptional Hotel",
      "trip_type": "Couples",
      "travel_date": "2024-03-31",
      "user": {
        "username": "grahamwT9386IH",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f1/42/default-avatar-2020-20.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 945526983,
        "title": "Owner response",
        "text": "Dear valued guest,\nWow! Thank you so much for your incredibly detailed and heartfelt review of your recent stay at Liberty Lara. We are truly delighted to hear that your experience with us was outstanding from start to finish.\nIt's fantastic to hear that our reception chef, Emin, provided excellent pre-arrival correspondence and was always available to assist you during your stay. We will be sure to pass on your kind words to him, as well as to the rest of our team.\nWe are thrilled that you enjoyed our pool areas, grounds, and beach access, finding them stunning, spacious, and relaxing. Jan, the rollerblading waiter, sounds like a real character, and we're pleased to hear that he added to your experience with his entertaining service.\nThank you for your kind words regarding our buffet restaurant, outdoor dining options, and the quality of our a-la-carte restaurant. We're delighted that you enjoyed the variety and quality of our food offerings throughout your stay.\nWe will certainly pass on your compliments to Sibel Sew and the rest of our housekeeping team, as well as to Emin, Hilal, Guney, Nur, and Mustafa. We're thrilled that they made such a positive impression on you and contributed to making your stay memorable.\nYour feedback regarding the rooms and entertainment is appreciated, and we will take it into consideration as we strive to continuously improve our services and facilities.\nThank you for the tip about using local buses, and we're pleased to hear that you found them convenient for getting around the area.\nOnce again, thank you for choosing Liberty Lara, and we look forward to welcoming you back for another exceptional stay in the future.\nWarm regards,",
        "lang": "en",
        "author": "Güney Şakar",
        "published_date": "2024-04-06T02:12:05Z"
      }
    },
    {
      "id": 945437606,
      "lang": "en",
      "location_id": 568401,
      "published_date": "2024-04-05T07:53:11Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g20116893-d568401-r945437606-Reviews-Liberty_Hotels_Lara-Kemeragzi_Antalya_Turkish_Mediterranean_Coast.html?m=66827#review945437606",
      "text": "It was a good experience for us. Although our vacation did not start very pleasantly because of our transfer, we started to feel good as soon as we entered the hotel. The food was good and the staff was friendly. Ms. Aslı from guest relations helped us a lot. Thank you to all Liberty and its team. Next year we can think of making our",
      "title": "Holiday",
      "trip_type": "Couples",
      "travel_date": "2024-04-30",
      "user": {
        "username": "ceren_940",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e2/11/default-avatar-2020-41.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e2/11/default-avatar-2020-41.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e2/11/default-avatar-2020-41.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e2/11/default-avatar-2020-41.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e2/11/default-avatar-2020-41.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 945526649,
        "title": "Owner response",
        "text": "\nDear Guest,\n\nThank you for sharing your experience with us. We are pleased to hear that despite a challenging start with your transfer, your stay at our hotel turned out to be enjoyable.\n\nIt's wonderful to know that you found our food to be good and our staff to be friendly. We will be sure to pass on your kind words to Ms. Aslı from guest relations, who assisted you during your stay.\n\nWe appreciate your feedback and thank you for choosing to stay with us at Liberty. We hope to have the pleasure of welcoming you back next year for another great experience.\n\nIf you have any further comments or if there's anything else we can assist you with, please don't hesitate to let us know.\n\nWarm regards,",
        "lang": "en",
        "author": "Güney Şakar",
        "published_date": "2024-04-06T02:07:14Z"
      }
    }
  ]
}