{
  "data": [
    {
      "id": 941708957,
      "lang": "en",
      "location_id": 581978,
      "published_date": "2024-03-10T19:37:17Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635612-d581978-r941708957-Reviews-Mitsis_Faliraki-Faliraki_Rhodes_Dodecanese_South_Aegean.html?m=66827#review941708957",
      "text": "In June 2023, I spent 11 nights here with my partner and had an outstanding experience. The hotel and its amenities are impressive, the food (especially at the themed restaurants) is fantastic, and the cocktails are delightful. The staff are friendly and eager to assist. The highlight of our holiday was the beach pods - available for an extra fee at reception - which includes a bottle of wine and a large seasonal fruit platter.\n\nMy only concern is that the pool near the sushi restaurant could benefit from better drainage due to a build-up of leaves, and there's a slight drain smell near the crepe bar, which was a bit unpleasant at times. However, considering all the positive aspects of the hotel, these are minor issues.\n\nWe had an amazing holiday and will definitely stay at a Mitsis hotel again in the future! 🏝️",
      "title": "Best hotel we have stayed at",
      "trip_type": "Couples",
      "travel_date": "2023-06-30",
      "user": {
        "username": "LisaGT6539ZL",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f2/7a/default-avatar-2020-25.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f2/7a/default-avatar-2020-25.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f2/7a/default-avatar-2020-25.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f2/7a/default-avatar-2020-25.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f2/7a/default-avatar-2020-25.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 942878803,
        "title": "Owner response",
        "text": "Hello Lisa,\n\nThank you for sharing your experience and to hear that you enjoyed our amenities, dining options, and the exceptional service provided by our staff.\n\nWe're delighted to hear that you particularly enjoyed the beach pods experience and found it to be a highlight of your holiday. Your satisfaction is our top priority, and we're glad we could contribute to making your stay memorable.\n\nThank you for choosing to stay with us, and we look forward to welcoming you back to a Mitsis hotel for another unforgettable experience in the future!\n\nWarm regards,\n\nMitsis Faliraki Team. ",
        "lang": "en",
        "author": "Sotiris Bilis",
        "published_date": "2024-03-19T07:08:32Z"
      }
    },
    {
      "id": 930032107,
      "lang": "en",
      "location_id": 581978,
      "published_date": "2023-12-17T04:52:56Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635612-d581978-r930032107-Reviews-Mitsis_Faliraki-Faliraki_Rhodes_Dodecanese_South_Aegean.html?m=66827#review930032107",
      "text": "This was our Third Mitsis Hotel and I'm sorry to say this will be the last. \n\nThe location is good, the beach is nice and its close to the town and bus and taxi stops for reaching other parts of the island. The staff by the pool bars work hard and service for drinks is prompt.\n\nThe hotel is dated and the rooms small but the food and how we have been treated by, and lied to by Mitsis staff is what has really let this hotel down. \n\nMy partner became really ill after eating in the Mexican a la carte. He was unable to leave the room from the Thursday until we left for home on the Saturday night, we had a do not disturb constantly on the room door. We had an awful journey home, he was off work for 3 weeks after we returned an is still not back to 100% even now. I notified the hotel on several occasions while we were there and also when we checked out about my partners illness. I spoke directly to both reception and the concierge as I had to cancel some a la carte bookings and also ask for water as we had no one in the room for 3 days due to the do not disturb and to ask if I was ok to take dry toast to the room for my partner to try and eat. The hotel kept telling us no one else was ill with sickness and diarrhoea, then when we checked out they moved us away from reception so no other guests could hear what we were saying and they told us it was a bug that always happens at the hotel in October. We had found out on the Friday that a number of other people at the hotel were also ill however when we mentioned this to the hotel they denied it. The other people who were ill had had also eaten in the a la carte's and the hotel had also told them that no one else was ill.\n\nUpon returning home I emailed the hotel who accepted no responsibility but offered us a discount if we wanted to return, after that they stopped replying to my emails so as our holiday was booked through EasyJet so we contacted them. Mitsis staff have blatantly lied to Easyjet telling them we did not make the hotel aware of my partners illness at the time of our stay and that no one else was ill at the hotel the time of our stay. Please see the Facebook pages  for evidence of this. It makes for very interesting reading as while we were there from 11/10/2023 to 21/10/2023 many people were ill after eating in the a la carte restaurants and contracted Salmonella during their stay. \n\nIf you eat in the a la carte or any other restaurant and your food is lukewarm PLEASE send it back, if you are unwell PLEASE report it to reception and WATCH THEM WRITE IT IN THE GUEST RELATION ENTRY BOOK as they did not enter our complaints into this book,  if you travel with EasyJet as soon as you are in the slightest bit unwell call the 24/7 holiday support line to notify them as without this you stand no chance of being able to raise a complaint with them.\n\nWe feel very let down by Mitsis, we appreciate that things can go wrong, the hotel just needed to take ownership of this and deal with it, however in this instance, Mitsis who are  a company that places so much emphasis on guest satisfaction have let their guests down dreadfully",
      "title": "third Mitsis hotel and will be the last - Food poisoning and lies from Mitsis hotel staff",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "HelenB1967",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/08/03/22/3c/mrshilly.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/08/03/22/3c/mrshilly.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/08/03/22/3c/mrshilly.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/08/03/22/3c/mrshilly.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 933386705,
        "title": "Owner response",
        "text": "Dear Helen,\n\nThank you for bringing your recent experience at Mitsis Hotel to our attention. We sincerely apologize for the challenges you faced during your stay, and we appreciate your detailed feedback.\n\nFirstly, we're glad to hear that you found the location convenient and enjoyed the beach. We also appreciate your positive comments about the hardworking staff by the pool bars and the prompt service for drinks.\n\nHowever, we deeply regret the issues you encountered, of your partner's illness. Your experience falls short of our standards, and we apologize for the impact it had on your vacation and your partner's health.\n\nWe take your concerns seriously. Our guests' well-being is our top priority, and we are committed to addressing and rectifying the issues you've outlined.\n\nOur Hotel is ISO certification in food safety, a globally recognized standard for maintaining the highest standards in food management systems. This certification reflects our dedication to ensuring the safety and quality of the food served at our hotel.\n\nWhat does this mean for you?\n\n    Stringent Standards: Our hotel adheres to rigorous standards set by the International Organization for Standardization (ISO), ensuring that our food safety management systems are of the highest quality.\n\n    Regular Audits: We undergo regular audits to verify our compliance with ISO standards. This ongoing commitment allows us to continuously improve our processes and maintain the highest level of food safety.\n\n    Trained Staff: Our culinary and service teams are extensively trained to uphold the principles of ISO certification, guaranteeing that every meal served meets the strictest food safety guidelines.\n\n    Guest Assurance: You can dine with confidence knowing that our hotel follows internationally recognized best practices in food safety, providing you with a secure and enjoyable culinary experience.\n\nOnce again, we apologize for the distressing experience you've had, and we genuinely hope to have the opportunity to restore your faith in Mitsis Hotel in the future.\n\nBest regards Mitsis Faliraki Team.",
        "lang": "en",
        "author": "Sotiris Bilis",
        "published_date": "2024-01-10T04:13:09Z"
      }
    },
    {
      "id": 926442392,
      "lang": "en",
      "location_id": 581978,
      "published_date": "2023-11-18T13:36:34Z",
      "rating": 2,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635612-d581978-r926442392-Reviews-Mitsis_Faliraki-Faliraki_Rhodes_Dodecanese_South_Aegean.html?m=66827#review926442392",
      "text": "The staff in this hotel are 5 star. Sadly our teenage boys ate chicken burgers half way through the holiday from the a la carte restaurant resulting in severe food poisoning and a stay in hospital on drips so half the holiday was ruined and it wasn’t cheap £6k. Had that not happened it would have been 4 stars dropped a star for the gym being outside impossible to train in 40c heat",
      "title": "A lovely hotel but sadly our boys got food poisoning ",
      "trip_type": "Family",
      "travel_date": "2023-07-31",
      "user": {
        "username": "barrysM6773VM",
        "user_location": {
          "id": "186222",
          "name": "Aylesbury, Aylesbury Vale, Buckinghamshire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ef/73/default-avatar-2020-13.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ef/73/default-avatar-2020-13.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ef/73/default-avatar-2020-13.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ef/73/default-avatar-2020-13.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ef/73/default-avatar-2020-13.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 929453720,
        "title": "Owner response",
        "text": "Dear host,\n\nThank you for taking the time to share your  experience with us.\nWe are deeply sorry to hear about the unfortunate incident that occurred during your stay. Our sincere apologies for the impact it had on your holiday. The well-being of our guests is of the utmost importance, and we take such matters very seriously.\nWe appreciate your acknowledgment of the 5-star service provided by our staff. Your feedback regarding the gym being outside in extreme heat is also duly noted.\nWe understand that this experience has affected your overall perception of our hotel, and we would be grateful for the opportunity to make amends. Please consider giving us another chance to provide you with the exceptional experience that reflects our usual standards.\nThank you.\nBest regards.\nMitsis Faliraki Team.",
        "lang": "en",
        "author": "Sotiris Bilis",
        "published_date": "2023-12-14T06:36:25Z"
      }
    },
    {
      "id": 925032635,
      "lang": "en",
      "location_id": 581978,
      "published_date": "2023-11-08T11:26:31Z",
      "rating": 5,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635612-d581978-r925032635-Reviews-Mitsis_Faliraki-Faliraki_Rhodes_Dodecanese_South_Aegean.html?m=66827#review925032635",
      "text": "Mitsis Faliraki beach hotel and spa is by far the best hotel I have ever stayed at. The whole experience was exceptional from start to finish. The staff were top class, always smiling and there to help wherever needed. The buffet was always stocked full with a variety of foods and the A La Carte Restaurants were out of this world. From the chefs to the cleaners, bar staff to the concierge, I have never experienced such exceptional staff. The entertainment each night was amazing, especially the Rock Band and the Drifter’s tribute band called the ‘Goldentones’. Everyone made us feel welcome. Our room was cleaned everyday and new towels provided. The beach huts were stunning and fairly priced. I cannot put into words how amazing the hotel was and I hope to return again next year. Thank you Mitsis team!",
      "title": "Out of this world! Highly recommend.",
      "trip_type": "Friends getaway",
      "travel_date": "2023-10-31",
      "user": {
        "username": "katiecV7534YG",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f0/48/default-avatar-2020-15.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f0/48/default-avatar-2020-15.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f0/48/default-avatar-2020-15.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f0/48/default-avatar-2020-15.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f0/48/default-avatar-2020-15.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 929453852,
        "title": "Owner response",
        "text": "Dear Katiec,\n\nThank you so much for your glowing review of Mitsis Faliraki ! We are thrilled to hear that your stay with us was the best you have ever experienced, and we truly appreciate your kind words.\nIt warms our hearts to know that you found the entire experience exceptional, from the top-class staff always ready to help to the diverse and delicious offerings in the buffet and A La Carte Restaurants. We are delighted that the entertainment, including the Rock Band and the Drifter's tribute band, added to your enjoyment, and that you felt a warm welcome from everyone.\nYour appreciation for the cleanliness of your room, the beach huts, and the overall atmosphere is truly gratifying. We are honored to have had the opportunity to make your stay memorable, and we look forward to the possibility of welcoming you back next year.\nThank you for choosing Mitsis Faliraki ! Your compliments mean the world to us.\nWarm regards,\nMitsis Faliraki  Team.",
        "lang": "en",
        "author": "Sotiris Bilis",
        "published_date": "2023-12-14T06:38:38Z"
      }
    },
    {
      "id": 924928360,
      "lang": "en",
      "location_id": 581978,
      "published_date": "2023-11-07T12:21:44Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g635612-d581978-r924928360-Reviews-Mitsis_Faliraki-Faliraki_Rhodes_Dodecanese_South_Aegean.html?m=66827#review924928360",
      "text": "As a family we have visited this hotel 9 times but I have to say since Sotoris, Etro and Giorgos and the rest of the new  team have joined the hotel has become a much more brighter environment with a much younger fresher atmosphere , every single team member has a smile and greeting/ well wish for the day, even the cleaners are friendly especially the lady with blond hair who has worked at the hotel for along time who greeted us by name every morning ,  always asking If everything is ok. \nThis year I booked directly with the hotel and Despina  was very professional and answered all my emails very quickly, I booked my Al La Carte reservations prior to departure  directly through Olga the Concierge, again all emails are very professional and responded quickly. \nUpon arrival in the airport we headed straight to the Mitsis desk which stood out and looked beautiful, the private transfer was amazing, a real V.I.P experience of a fully air conditioned Sprinter with very comfortable seats and lovely lighting. \nAs always the lovely Nikos greeted us and helped with the huge amount of luggage we had and gave my son a lovely gift. I checked in on the app again prior to departure making things much quicker as it was late when we arrived. The reception team   and Christina the Guest relations host recognised us and gave us a lovely return greeting making us feel extremely welcome, Nikos took all of our luggage up to a lovely clean spacious room with an amazing sea view ( we had an upgrade too) and a lovely surprise of balloons gifts and a personalised cake for my sons birthday, It really was a lovely touch and we are ever so thankful. \nAs always when we went to the brunch the next morning the lovely host Matila greeted us with her lovely smile and seated us where Zoe,  Gabriele and the others  took care of us, the service in the Al La Carte restaurants is excellent , even for my son who is Autistic and has sensory issues around food, Bagia the waitress  in the Italian ensured my wine glass was never empty. The twin who works in the Burger Pitta area is so attentive and even when sat at the end table made sure she did not  leave us waiting \nThe main restaurant is so cosy  unlike other hotels I have stayed in that can feel very cold and have a canteen like feeling, the food is varied for all nationalities and has specialist theme nights such as Mexican, Greek and Asian , you can either be seated  inside in the air conditioned area or   outside under a lovely shaded pergola, again the team recognised us and gave us a lovely welcome back greeting, Navila the captain is a real asset to the hotel it has been so lovely to watch her grow from a waitress to the captain, we are very proud of her, she has always cared for our son and ensured he is happy and ok.\nThe pool area is lovely and clean and every single chair around the bar area is always pushed in making it very tidy, ashtrays are constantly cleaned and empty glasses removed. The staff are very attentive and the cocktails are made fresh and quickly meaning no long bar ques, the crepes are lovely too my son had them daily. \nThe sunlounges are plentiful and very comfortable, we have never had to do the towel thing in all the time we have stayed there's enough for all the guests. Anna and the exercise team do daily aqua gym which is great fun. \nThe beach is kept to a very high standard, bins located everywhere and Michalis, Nikos and the others work so hard to ensure you are well hydrated and the lovely new toughened plastic glasses are a great new addition and much better for the environment. The boardwalks are great for hot days as the sand can get hot and again very lovely new comfortable sunlounges on beautiful new colours to match the new uniform, Michalis arranged for us to have one of the private sun tipi on the front of the beach with some fruit and sparking wine, it was so comfortable and partly shaded as the weather was particularly hot this year, a truly beautiful day. \nThe entertainment is varied to accommodate everyone from traditional Greek dancing, street dancing, groups of singers, acrobats and  of coarse the best Latin showman Pedro Santana and his team who really know how to get a party atmosphere, even the staff are part of the show with some great dancing together, he really brings joy to the evening.  \nWe had booked quite along stay so we took a few trips as the bus stop is outside the hotel to Rhodes Town  and the main area of Faliraki is just around the corner with the shops, bars and lovely restaurants, I have to say you hear no noise at all from the nightlife of Faliraki during the night at the hotel and the area is so much more cleaner that it used to be making it a lot nicer to visit, we took our son out who is 14 to a few of the bars and he lived it we felt very safe and at ease. We also took a day trip from the Port in Rhodes Town to Turkey, Marmaris for the day, there are many beautiful areas of Rhodes to visit. \nWe also booked an excursion through Melissa on the Concierge desk to the Monastery of Taxiarch Michael Panormitis and Symi Island, we where offered a packed lunch each from the hotel but the staff had recommended local tavernas and the dish of Symi island which was delicious,  again the fully airconditioned transfer collected us and took us to the Port in Rhodes, Manolis the rep greeted us and gave us our boat tickets, a map and the time he would be waiting to collected us, I would highly recommend this excursion The Monestary was very moving for me and symbolic,  booking directly through the hotel was very reasonably priced and ran very smoothly. \n\nWhat makes Mitsis Faliraki is its great central location,  food and drink to a very high standard and the lovely team who work so hard everyday to ensure everyone has a lovely holiday. We have stayed at other Mitsis hotels even the exclusive ones  but by bar Faliraki beach is the most friendly with a lovely atmosphere. \nThis year I allowed my son to stay in the room some evenings to call his friends etc and sleep in for a while and I felt he was very safe so I could enjoy a relaxing breakfast with my partner something we never get to do. \nThis is one of the main reasons why we always return, my son feels happy and safe and is very confident is the surroundings,  the staff they all treat him so well and have lots of patience with him even when he tries  to speak Greek. \nThe one recommendation we have is maybe more things for teenagers to do and maybe more variety of food options during the day around the pool/ beach area. \n\nI have already booked for season 2024   and look forward to another amazing holiday making fun filled special memories, thankyou to you all, have a very well deserved restful winter.",
      "title": "Honest review of a superb hotel with a team that`s more than 5 star!",
      "trip_type": "Family",
      "travel_date": "2023-10-31",
      "user": {
        "username": "L2911DYdebbiet",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e2/11/default-avatar-2020-41.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e2/11/default-avatar-2020-41.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e2/11/default-avatar-2020-41.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e2/11/default-avatar-2020-41.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e2/11/default-avatar-2020-41.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 929454111,
        "title": "Owner response",
        "text": "Dear Friends and Family,\n\nWe are truly touched by your comprehensive and heartfelt review of your experience at Mitsis Faliraki . It is a pleasure to read about the positive impact our dedicated team members, including Sotiris, Etro, Giorgos, Despina, Olga, Nikos, Matila, Zoe, Gabriele, Christina, Navila, Michalis, Anna, Pedro Santana, and many others, had on your stay.\nYour detailed account of the entire experience, from the warm greetings and professional service to the cleanliness of the facilities, is truly appreciated. We are thrilled that you found the hotel's central location, food and drink offerings, and the friendly atmosphere to be of a very high standard. It's heartening to know that your son felt safe and happy, and we are grateful for your trust in us.\nWe also appreciate your constructive feedback regarding more activities for teenagers and additional food options around the pool/beach area, which we will certainly take into consideration.\nThank you for choosing Mitsis Faliraki  for your family vacations repeatedly, and for already booking for the 2024 season. We are honored to be your preferred destination, and we look forward to welcoming you back for another amazing holiday filled with special memories.\nWishing you a wonderful and restful winter, and looking forward to seeing you again soon.\nWarm regards,\nMitsis Faliraki Beach Team.",
        "lang": "en",
        "author": "Sotiris Bilis",
        "published_date": "2023-12-14T06:42:24Z"
      }
    }
  ]
}