{
  "data": [
    {
      "id": 934112207,
      "lang": "en",
      "location_id": 587031,
      "published_date": "2024-01-15T07:58:24Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d587031-r934112207-Reviews-Delta_Sharm_Resort-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review934112207",
      "text": "DON'T BOOK.The worst apartment I have ever been to. We booked it because of its location near the beach and the location is not correct, the coordinates are wrong. Once we arrive at the apartment we realize that an adult cannot sleep on the sofa and that the bed is bad and hard, making it impossible to sleep. We called the owner to change our apartment and we told him that we would pay the difference. He told us that he had no more apartments. We told him that the sofa and bed were horrible and he did not give us any solution.\nWe also hire their services to pick us up from the airport and he charge us €20 for a €4 journey.\nHe also offered to exchange currency for us at a much worse exchange rate than the rest of the places.\nWe booked the excursions on our own and he insisted that we rent a car, even telling him that we did not want to drive in a country that was not ours.\nThe facilities are horrible, bad bed, bad sofa, old and rusty pipes and taps, barely any water comes out of the shower and a few cockroaches came to visit us during the time we stayed.\nWe considered making a complaint to Booking but we were afraid that they might break into us.\nWe attach all the photos so that if someone reads this comment they will never book this accommodation. In the delta sharm resort, which is where the apartment is actually located, there are much better places to book.",
      "title": "Delta Sharm Apartment 156 flat 102",
      "trip_type": "Friends getaway",
      "travel_date": "2023-12-31",
      "user": {
        "username": "E4180PEpatriciab",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ef/73/default-avatar-2020-13.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ef/73/default-avatar-2020-13.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ef/73/default-avatar-2020-13.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ef/73/default-avatar-2020-13.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ef/73/default-avatar-2020-13.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 893988345,
      "lang": "en",
      "location_id": 587031,
      "published_date": "2023-06-08T06:59:06Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d587031-r893988345-Reviews-Delta_Sharm_Resort-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review893988345",
      "text": "The costumer service are very bad ,\nThe attitude of the staff are so rude ,\nI don’t recommend it to anyone, bad reputation resort in Sharm El Sheikh ,\nI’ve tried to reach any of the responsible manager there and i even told them that i will post my review for this bad treatment and there answer was do whatever you want …",
      "title": "Rude and Valgar Staff with Unacceptable attitude by all levels .",
      "trip_type": "Solo travel",
      "travel_date": "2023-06-30",
      "user": {
        "username": "Massimo_Travel_fun",
        "user_location": {
          "id": "294200",
          "name": "Egypt"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/29/6b/01/99/mohamedf5905.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/29/6b/01/99/mohamedf5905.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/29/6b/01/99/mohamedf5905.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/29/6b/01/99/mohamedf5905.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/29/6b/01/99/mohamedf5905.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 855086451,
      "lang": "en",
      "location_id": 587031,
      "published_date": "2022-08-19T14:04:04Z",
      "rating": 1,
      "helpful_votes": 2,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d587031-r855086451-Reviews-Delta_Sharm_Resort-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review855086451",
      "text": "May-August 2022\n\nLocated on the main road (El Salam street) in from the Airport -  access to  Carrefour - across the road to the North and a local shopping area (elNoor) across the main road to the West.  \n\nDO take care when crossing the road! \n\nLocal transport \nTaxis & Public minibus services are available;\nIf you find a good, helpful, trustworthy (ie: doesn’t try to rip you off) taxi dirver, take his name/phone number - call him 10 minutes before you want to leave & get him to pick you up.   Sharm is tiny so you won’t have long to wait, if he’s available.  You can still use the meter but it allows you to decide how much you want to give as a tip.\n\nWe would recommend the minibus as it saves the hassle of trying to get the taxis to use the METER (instead of trying to rip you off haggling over the price of the fare).  Fellow passengers on the public bus are usually helpful in telling the driver exactly where you want to go.  Although the bus drivers do give change, it’s best to have lots of small denomination cash handy!\nThe public minibus service stops ANYWHERE you want it to or wherever you wave it down -(like in the middle of a roundabout?!) - Amazingly convenient!\nMake sure to tell the driver where you want to go & have the right change.  You will get the hang of it quickly .. if you don’t like being ripped off, be a quick learner.\nRemember to TELL the driver you want to get off at (your stop) as you are approaching.  Otherwise, it’s a long walk back to where you should have got off!!\n\nLiving in Delta Sharm:\n\nAlthough there are many swimming pools at Delta Sharm, it is VERY IRRITATING that some are restricted by an unwritten code of use .. especially petty rules about ACTUALLY SWIMMING IN THE POOLS.  Unfortunately, these petty new rules can be overlooked by applying a bit of grease to the right palm.\n\nVERY RUDE, POORLY TRAINED STAFF who do not know how to address their guests respectfully & with courtesy.   DS management simply don’t understand the concept that when you charge the customer 5 star prices - they EXPECT 5 STAR SERVICE!!\nStaff that interact with PAYING GUESTS - NEED TO BE TRAINED!  This OBVIOUS fact has simply been ignored or overlooked by DS management.     \n\nDelta Sharm is staffed by hundreds of workers - all pretending to be busy but NONE seem to have a clue about what should be done.   DS is 2 decades old - one would think that by now the management & staff would know how to keep the place clean, maintain the grounds & fauna, etc.  Nothing could be further from the truth.\n\nDespite the fact that the resort is “fogged” with insecticide to control mosquitos, guests who are susceptible to mosquito bites should seriously reconsider visiting - or bring bucketloads of insect repellant;\n\nStray cats everywhere - NOONE bothers to control (ie: neuter) the feral cats so they reproduce at will; as a result, the bloody cats are everywhere - knocking over and rummaging through the waste bins..  making a heck of a mess - and especially at feeding time (which seems to be any time of the day).   These moggies make themselves at home on your balcony furniture so you’re constantly having to chase them out - unless of course, you love being bitten by fleas.  We were warned by someone who has lived in Sharm for years,  that feral cats caused a rash on her legs which lasted weeks and required treatment with anti-biotic cream.   Fortunately, local pharmacists are very familiar with this type of rash.   ANYONE suffering from allergies SHOULD AVOID this place.  Speaking of feral pussy, apparently both varieties are available in Delta Sharm.\n\nif you’re unfortunate enough to have a ground floor unit with a herd of locals living in the unit above, you will live the full 3D Jumanji experience of a herd of elephants doing battle with a troupe of monkeys….incessant noise - shouting from the 1st floor windows to people below … especially annoying when it happens from midnight to 0400h in the morning.\n\nA “benefit” of living on the ground floor is that local residents eat (eg: ice cream, crisps) and simply discard the cup & wrapping on to the lawn below.  This also happens with pop cans which they throw from their balcony on to your lawn below.  I caught one of them in the act and demanded they come down immediately & clean up their mess - which they did.  This was a group in their early 20’s. It is incredible that the next generation has so little respect for their own country’s image or how their own behaviour reflects on them; \n\nAnother thing we experienced is that local residents love to stand in front of the entrance of your ground floor unit - smoking & chatting loudly - then LEAVE cigarette butts, paper wrappers, empty beer/pop bottles & cans, cigarette ash etc on your front door step or in the garden area, as they put out the cigarettes ON the step or on the floor mat at your front door. \nLocals of all ages, apparently think it is ok to discard wrappers ANYWHERE(!!?) -   Note: a disadvantage of ground floor units is that detritus & garbage from the floor above is simply thrown on to your garden/entrance. \nDespite the fact that there are bins every few meters along the pavement, I observed that they are simply too lazy to lift the lid & put rubbish IN the bin.  Far easier to throw it right next to the bin to create an eyesore for everyone!   \n\nOn another day, we were suddenly aware that a group of locals had simply parked themselves on our front lawn to have a picnic - while the feral kids came up to the front gate, pulled back the curtains to look inside your apartment?!!  (see photo)\nThis type of behaviour suggests some of the local residents need to be house trained.   It is hardly the behaviour that will create a good impression of the country or attract visitors to come back to visit.\n\nTotally unsanitary conditions encourage insects & vermin to breed - so you will need to buy a good supply of RAID insecticide which will need to be sprayed EVERYWHERE.  We even found flying cockroaches on the bed.\n\nDelta Sharm is premium priced and insanely hyped - especially when compared to other resorts / condos around.  Our experience (after staying for a number of months AND in different units in Delta Sharm) is that this premium is NOT justified.\n  \n\nOther points to note:\nBEFORE you make your reservation, look for  “does your unit have filtered water?”.    You will still have to boil the water before you use it for washing food/rinsing your mouth/brushing teeth but filtered water does offer you an additional layer of protection.  \nDO NOT CONSUME LOCAL TAP WATER IN ANY FORM OR UNDER ANY CIRCUMSTANCES. \n\nRemember the old Scout’s motto “ Be prepared “?  well, that was because they had prior experience with DS.   Common irritants are Internet, Water and/or Power failures - for 6 hours or more.   During our stay, we experienced a water outage of 7.5 hours - followed by 3 hours when brown stained water flowed - followed by another 3 hours without water.   Power failures are common - which can be incredibly annoying if you have been working on something on the computer.   Also, be aware that power usually surges when it is restarted and that has been known to fry the boards in electronic equipment.  Do take precautions to protect your electronics.\n\nNOT all accomodation units are equal - so be very careful when selecting - and look at EXACTLY what you are getting (read the fine print .. a bit of homework always helps ensure there are NO surprises);\n\nConstruction noise - without any warning - we were hit with a drilling noise... which sounded as if the neighbours were trying to drill through to our (common) living room wall!   When we complained to the landlord that this should have been in the description his answer was simply that they are allowed to work during the day between the hours of 0900-1700h!   NO consideration about what the clients had PAID for.   I arranged with the construction team to let us know what days they would be drilling or hammering so that we could plan to be OUT during those times.  This is happening all over Delta Sharm as we have observed & experienced personally.",
      "title": "1 out of 10",
      "trip_type": "NONE",
      "travel_date": "2022-08-31",
      "user": {
        "username": "W0zza",
        "user_location": {
          "id": "187337",
          "name": "Frankfurt, Hesse"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e6/ea/default-avatar-2020-54.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e6/ea/default-avatar-2020-54.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e6/ea/default-avatar-2020-54.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e6/ea/default-avatar-2020-54.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e6/ea/default-avatar-2020-54.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Rooms"
        },
        "1": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Service"
        },
        "2": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
          "value": 1,
          "localized_name": "Sleep Quality"
        }
      }
    },
    {
      "id": 842631498,
      "lang": "en",
      "location_id": 587031,
      "published_date": "2022-06-13T02:48:04Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d587031-r842631498-Reviews-Delta_Sharm_Resort-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review842631498",
      "text": "I have been staying with my family in Delta Sharm el Sheikh last week of May and i would like to recommand this place for any family looking for a cozy place to stay in !\n\nI would like to specially thank the amazing and hard working Restaurant staff Ahmed Sayed and Mohamed Mostafa ( sa3idy ) .\n\nMany thanks also to the House keeping team snd pool captains .\n\nNoor",
      "title": "If you are looking for a cozy family place, stop by Delta Sharm !",
      "trip_type": "Family",
      "travel_date": "2022-05-31",
      "user": {
        "username": "Noor-bass",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f3/e4/default-avatar-2020-30.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f3/e4/default-avatar-2020-30.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f3/e4/default-avatar-2020-30.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f3/e4/default-avatar-2020-30.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f3/e4/default-avatar-2020-30.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 840685505,
      "lang": "en",
      "location_id": 587031,
      "published_date": "2022-05-30T12:16:00Z",
      "rating": 1,
      "helpful_votes": 2,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g297555-d587031-r840685505-Reviews-Delta_Sharm_Resort-Sharm_El_Sheikh_South_Sinai_Red_Sea_and_Sinai.html?m=66827#review840685505",
      "text": "We arrived at the hotel late at night where it took 30-40 mins to find our room. We were then driven to our room on a buggie which was about 20 minute walk from any of the hotel facilities. The room was unclean, next to a local family with a crying child, overlooking a building site and had stray cats gathering at the door to try to enter. This hotel didn’t even feel like a hotel and we ended up leaving in the middle of the night and still have not received any compensation. Awful.",
      "title": "Honestly an awful experience, could not recommend any less",
      "trip_type": "Friends getaway",
      "travel_date": "2022-03-31",
      "user": {
        "username": "samkE8730OV",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ee/db/default-avatar-2020-10.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ee/db/default-avatar-2020-10.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ee/db/default-avatar-2020-10.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ee/db/default-avatar-2020-10.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ee/db/default-avatar-2020-10.jpg"
        }
      },
      "subratings": {}
    }
  ]
}