{
  "data": [
    {
      "id": 920399958,
      "lang": "en",
      "location_id": 639129,
      "published_date": "2023-10-08T17:39:34Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d639129-r920399958-Reviews-BCN_Montjuic-Barcelona_Catalonia.html?m=66827#review920399958",
      "text": "We stayed one night at BCN Montjuic with our two children (2,5 years and 11 months). We booked the room with the baby kit and got two travel beds, high chair and even a baby bath. Perfect! The cleaning staff was very friendly and made sure we had what we needed for the children. From our room we could see a playground on the terrace, but unfortunately we didn’t have the time to visit. On the downside - the staff we met in the reception was not pleasant. Upon arrival I pulled out my credit card to fast, and he got annoyed. Sure, it might be annoying, but his reaction was uncalled-for. When the kids was finally asleep we called the reception to make use of the offered room service. The same staff just responded ”opens at 7” and slammed the phone. Again - the reaction was uncalled-for. He must have had a really bad day. All in all, a comfortable stay, if it was not for the staff in the reception…",
      "title": "Comfortable stay, unfriendly staff in the reception",
      "trip_type": "Family",
      "travel_date": "2023-10-31",
      "user": {
        "username": "ChandosBaez",
        "user_location": {
          "id": "189839",
          "name": "Malmö, Skane County"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ea/b2/default-avatar-2020-69.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ea/b2/default-avatar-2020-69.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ea/b2/default-avatar-2020-69.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ea/b2/default-avatar-2020-69.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ea/b2/default-avatar-2020-69.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 923971579,
        "title": "Owner response",
        "text": "Dear guest, I am delighted to read that all of you enjoyed the stay with us. Our rooms are specially designed to make the stay of parents travelling with children as comfortable as posible. I'm sorry about your comments about the staff of the front desk regarding your impression you got of not being welcomed. We know how important it is that our clients feel comfortable and I deeply regret if we fail in doing so. We hare looking forward to welcoming you back at Aparthotel Bcn Montjuïc! Warm regards, Carme",
        "lang": "en",
        "author": "Gemma Fradera",
        "published_date": "2023-11-01T11:55:28Z"
      }
    },
    {
      "id": 920269921,
      "lang": "en",
      "location_id": 639129,
      "published_date": "2023-10-08T01:32:20Z",
      "rating": 2,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d639129-r920269921-Reviews-BCN_Montjuic-Barcelona_Catalonia.html?m=66827#review920269921",
      "text": "We stayed for one week, the room was clean at first sight. We had room at B floor, which I think means basement, because we had little to no natural light in our room. The door to the \"terrace\" was only locking on the upper side, the bottom lock was not working.\n\nThe main problem was the air quality in the room: felt a constant smell of mould. The problem was the ventilation of the room because the natural airflow from outside was restricted because the room was below the ground level. Another factor for the air quality was the AC (air conditioning) unit. The air filters were NEVER cleaned, they had 2 centimeters of collected dust. Also, because of that, mould was created on many spots inside the AC unit.\nHaving some experience on AC units, I removed the filters, cleaned them in the shower, and put them back on. I cannot imagine why the hotel cleaning service doesn't have a plan on having the AC units properly cleaned and sanitized periodically.\nThe kitchen had some leftover dishwashing liquid, new sponge. The fridge was ok, even had a freezer.\nThe bathroom was clean, but there was no toilet brush. After using the toilet, I sometimes needed to clean it with toilet paper in order to leave it clean. The shower drain cover was very loose, in one morning I even seen and terminated a very small cockroach around that shower drain.\n \nThe room did not have a washing machine, I don't even know if it needed to be there because I booked with a travel agency and don't really know if had a washing machine included.\n\nBreakfast was modest, coffee machine was with instant coffee. (I drank only espresso, and it was instant coffee).\n\nThe receptionists were very kind, good service. They allowed us to checkout at 1pm. Room service was very good. Souvenirs available at the reception, with good prices.\nParking space available for motorcycles and scooters just in front of the hotel.\n",
      "title": "Low air quality, mould on AC unit.",
      "trip_type": "Couples",
      "travel_date": "2023-10-31",
      "user": {
        "username": "SavyStefan",
        "user_location": {
          "id": "294458",
          "name": "Bucharest"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f1/42/default-avatar-2020-20.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 923971234,
        "title": "Owner response",
        "text": "Dear Stefan, thank your for leaving your comments on tripadvisor.com.I am sorry that our service didn't meet your expectations. The  filters on the Ac Units are cleaned regularly, but it seems that in this case something went wrong. We take your complaints very seriously and we deeply regret when we fail to provide an excellent service. Yours sincerely, Carme\n",
        "lang": "en",
        "author": "Gemma Fradera",
        "published_date": "2023-11-01T11:52:11Z"
      }
    },
    {
      "id": 904962574,
      "lang": "en",
      "location_id": 639129,
      "published_date": "2023-07-23T06:31:33Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d639129-r904962574-Reviews-BCN_Montjuic-Barcelona_Catalonia.html?m=66827#review904962574",
      "text": "We stayed in the loft room on mezzanine A floor for 4 nights. We arrived at the hotel at about 11am, the room wasn't ready but the reception staff was helpful in processing the registration and luggage storage.\nCheckin was available at about 3pm\nPros of the hotel -\n1) Safe residential neighbourhood, fairly close to transport. 5min to walk to bus 46 bus top to airport OR 20min to walk to aerobus bus stop - with luggage\n2) Room is spacious and well lit. Bedroom is equipped with small tv and lots of wardrobe space. Living room has lots of natural lighting - leather sofa is well used. Balcony has dryer rack for clothes and seating area. Kitchen area has island with sink and stove as well as fridge, freezer, microwave, oven and washing machine. Pots, pans, plates, cutlery are provided.\n3) Large bathroom with 2 sinks\n4) Swimming pool \n\nCons of hotel -\n1) Housekeeping - The bottles of soap, shower gel and shampoo were empty during checkin and were still not refilled the following day in spite of us putting the bottles prominently at the corridor leading to the living room,\nToilet bowl area had feaces stain.\n2 small pins were found on floor - might cause injury if there were not noticed.\n2) No dish washing detergent, sponge or tea towel were available for kitchen use\n3) Some cabinets cannot close properly\n4) No instructions for dishwasher or washing machine\n5) Coffee machine capsules were not replenished in spite of the number of nights stayed\n6) Have to bring own towels to swimming pool or pay deposit using credit card",
      "title": "Spacious loft room, great reception",
      "trip_type": "NONE",
      "travel_date": "2023-07-31",
      "user": {
        "username": "fenniechong",
        "user_location": {
          "id": "294265",
          "name": "Singapore"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/06/8f/72/cb/fenniechong.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/06/8f/72/cb/fenniechong.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/06/8f/72/cb/fenniechong.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/06/8f/72/cb/fenniechong.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/06/8f/72/cb/fenniechong.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
          "value": 3,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 905246036,
        "title": "Owner response",
        "text": "Dear fenniechong,\n\nThanks for reviewing us, do not doubt that all your comments will be taken seriously to improve or rooms and services.\n\nWe hope that these small problems have not been a nuisance to spend an unforgettable vacation in BCN!\n\nHoping to see you soon around here.\n\nDaniel López- Front Desk Manager\n",
        "lang": "en",
        "author": "Gemma Fradera",
        "published_date": "2023-07-24T10:02:53Z"
      }
    },
    {
      "id": 903523717,
      "lang": "en",
      "location_id": 639129,
      "published_date": "2023-07-16T17:31:49Z",
      "rating": 5,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d639129-r903523717-Reviews-BCN_Montjuic-Barcelona_Catalonia.html?m=66827#review903523717",
      "text": "We had an enjoyable stay with really comfy beds, spotlessly clean hotel, great swimming pool area and the super friendly/helpful staff. The hotel is a very good 3* but has a few things that could improve it - a coffee/drinks machine at reception or by the terrace, instructions on how to use the air-con and tv and more detailed information on facilities available in and near the hotel in each room. The hotel is a short walk in one direction to the buses/cafes/mini-markets and, in the other direction, a 10 minute walk to the must visit Pobles Espayna from where you can pick up the 150 bus to the Montjuic cable cars or the castle itself. We bought a carte of 8 transport tickets (T-Familia) from the metro for 10 Euros (can be used on metro or bus). Each tickets last for 1.5 hours from the moment stamped and as a family of 3 we stamped the card 3 times for each journey. On the reverse of the ticket you can see how many times used. Bus 109 takes you to the main station in around 15 minutes. We were not sucessful with booking a taxi on the FreeNow App and when/if you hail a taxi it is best to learn how to say where you are going as they drive straight off (so they can not read it if written down). Taxis are cheaper than in England. Alot of people automatically speak English to you but Google Translates was a godsend in the less touristy locations/situations. \nI would definately recommend BCN Montjuic and plan to return in the future.",
      "title": "Wonderful 3* ApartHotel",
      "trip_type": "Family",
      "travel_date": "2023-07-31",
      "user": {
        "username": "Coastal578089",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f0/9f/default-avatar-2020-16.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f0/9f/default-avatar-2020-16.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 903842744,
        "title": "Owner response",
        "text": "Dear Coastal578089,\n\nFirst of all, thank you for taking your time to review us!\n\nWe greatly appreciate your positive comments, as well as we are working to improve all those details that you have left us as possible improvements, it is worth saying that some of them are already in the final phase of implementation! ☕🤩\n\nWe hope to have you back very soon, it has been a wonderful visit.\n\nDaniel López - Front Desk Manager",
        "lang": "en",
        "author": "Gemma Fradera",
        "published_date": "2023-07-18T02:49:00Z"
      }
    },
    {
      "id": 891988855,
      "lang": "en",
      "location_id": 639129,
      "published_date": "2023-05-26T04:53:28Z",
      "rating": 3,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d639129-r891988855-Reviews-BCN_Montjuic-Barcelona_Catalonia.html?m=66827#review891988855",
      "text": "I have to start by saying that the aparthotel is in a great location , easy to get to from the airport on the local (number 46) bus and close to Plaza Espanya for connections to the rest of the city. It's next to Montjuic which has a number of interesting elements to visit. The staff are great and very friendly and helpful and the aparthotel is very clean.  There are a couple of points to highlight. The double/twin rooms are almost below ground (as the aparthotel is built into the hill) so there is very little natural light, The room colour schemes are cream and brown so they are a little dark. There is no heating (so we were told) so while we were there the rooms were on the verge of being slightly cold for us. I'm sure it will start to get warmer as summer progresses. Finally, there is no English tv and although we found the Spanish subtitles, so we could exercise our Spanish a bit, it would have been nice to sit back to something we fully understood (we couldn't be out of our room all day, it's just too tiring).",
      "title": "Nice location, very friendly, helpful staff and clean, read on....",
      "trip_type": "Couples",
      "travel_date": "2023-05-31",
      "user": {
        "username": "bhart992016",
        "user_location": {
          "id": "186398",
          "name": "Kenilworth, Warwickshire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f3/e4/default-avatar-2020-30.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f3/e4/default-avatar-2020-30.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f3/e4/default-avatar-2020-30.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f3/e4/default-avatar-2020-30.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f3/e4/default-avatar-2020-30.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 893219076,
        "title": "Owner response",
        "text": "Dear Bhart992016,thanks for reviwing us on Tripadvisor. We are glad to read that you enjoyed your stay with us, especially our location, cleaning and staff. We also take good note of the mentioned highlits, which help us improve. We hope to see you soon in the future at BCN Montjuïc. Warm regards, Carme ",
        "lang": "en",
        "author": "Gemma Fradera",
        "published_date": "2023-06-03T09:17:20Z"
      }
    }
  ]
}