{
  "data": [
    {
      "id": 929152785,
      "lang": "en",
      "location_id": 6400581,
      "published_date": "2023-12-11T07:30:01Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6400581-r929152785-Reviews-Sant_Jordi_Hostels_Rock_Palace-Barcelona_Catalonia.html?m=66827#review929152785",
      "text": "I had an amazing stay at the hostel! I went there with my friend and we stayed 2 nights, it actually exceeded our expectations. \nThe room was very clean, we chose a 6 bed female room, we had a private bathroom and a cute balcony. \nThe place had a computer room if you want to go study or work from it, a TV room for chilling, and multiple common areas. \nThe staff was really nice and friendly. \nI met some incredible people from all over the world, it was a very nice experience. \nThe hostel is very well located, near to shops, restaurants, bus stations....\nI would definitely come back again on my next trip to Barcelona, and I highly recommend it to anyone planning to visit this incredible city! ",
      "title": "Amazing experience 🤩",
      "trip_type": "Friends getaway",
      "travel_date": "2023-12-31",
      "user": {
        "username": "zinebd635",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/ef/32/default-avatar-2020-12.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/ef/32/default-avatar-2020-12.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/ef/32/default-avatar-2020-12.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/ef/32/default-avatar-2020-12.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/ef/32/default-avatar-2020-12.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 931988723,
        "title": "Owner response",
        "text": "Thank you for sharing your experience with us! We are delighted to hear that you enjoyed your stay thanks to the cleanliness and comfort. It's great to hear that you were treated well and met other travelers. We look forward to your next trip! Greetings, the SJH team",
        "lang": "en",
        "author": "Silvia Pancaldi",
        "published_date": "2024-01-02T05:24:17Z"
      }
    },
    {
      "id": 923017705,
      "lang": "en",
      "location_id": 6400581,
      "published_date": "2023-10-26T06:12:49Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6400581-r923017705-Reviews-Sant_Jordi_Hostels_Rock_Palace-Barcelona_Catalonia.html?m=66827#review923017705",
      "text": "Staffed with fun people but not all are courteous or mindful of their duties while working. \nHad two service failures and an incident where Gian Franco went out of his way to insult me. The bathrooms were not clean.\n\nFirstly they have a system where the front desk has to manually turn off the lights at 11pm. First night I was there I asked them to turn it off as it was past 11 and also asked them to manage a situation where the girl in my room was vaping. They asked for the bed number which I provided but I received no reply on messages and no follow up on this matter.\nSecond night I had to go back to front desk again and ask them to turn off the lights. At that time I said you’ve failed to turn off the fing lights twice now it’s getting a bit annoying. At that Gian Franco asked if I could next time be less rude. When I asked him what he meant he didn’t answer. In my mind I was just using the fbomb as a matter of expression and not at all to put him down.\nWell it escalates from here. \n\nHe chose not to answer and explain his view point but rather stated that this shows how my country is and how people there are uneducated. He furthermore proceeded to cut me off entirely and said he’s actually not working. So I asked him why did he offer to help me or why is he sitting at the front desk if he’s not working. No answer but he started to talk to someone else. \nI was tired and blown away by this level of aggression, I mean excuse me for being tired and using a few choice words in the process of explaining things, but the personal attacks by Gian Franco was unacceptable. \nI do appreciate that the management who I contacted at HQ saw this and refunded the rest of my stay. Needless to say based on this experience I can’t recommend nor would ever stay here again. ",
      "title": "Left early because of staff member Gian Franco combative nature and several service failures.",
      "trip_type": "Solo travel",
      "travel_date": "2023-10-31",
      "user": {
        "username": "imrar",
        "user_location": {
          "id": "29556",
          "name": "Ann Arbor, Michigan"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f2/eb/default-avatar-2020-27.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f2/eb/default-avatar-2020-27.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f2/eb/default-avatar-2020-27.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f2/eb/default-avatar-2020-27.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f2/eb/default-avatar-2020-27.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 923661239,
        "title": "Owner response",
        "text": "Dear, we are very sorry for the bad experience you had with our former employee, there is no doubt that such behavior is unheard of, however it was not polite of you to use a rude language and to record him without his consent. In spite of this, we provided prompt assistance and reimbursed you from the head office, so that you know how important your guest's stay is to us. We hope to have another opportunity to host you and surprise you! Greetings from the SJH team",
        "lang": "en",
        "author": "Silvia Pancaldi",
        "published_date": "2023-10-30T11:15:17Z"
      }
    },
    {
      "id": 913288115,
      "lang": "en",
      "location_id": 6400581,
      "published_date": "2023-08-27T14:18:12Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6400581-r913288115-Reviews-Sant_Jordi_Hostels_Rock_Palace-Barcelona_Catalonia.html?m=66827#review913288115",
      "text": "All the rooms are different, you have to keep that in mind. In our room there was no floor drain in the toilet, only in the shower compartment, so the toilet floor was always wet from shower spillage. The room was spacious, though. Room 404 is the most spacious one in the whole hostel.\n\nThe hostel closes the doors to all the terrace areas at 9pm because of the neighbours. So there's really no place to sit and relax after 9pm if you don't enjoy the chilly and overpowerful air conditioning in common areas and rooms.\n\nThe rock theme is really nice and the location is superb. The staff was friendly and helpful.\n\nThe lights go off in the rooms at 11 pm so that partying people won't bother you when they arrive late. On some nights I was alone and went to bed earlier than 11 pm and would have wanted to control the light myself, but I slept pretty well anyways. I don't mind the partying, one should not choose a hostel if partying people bother you.\n\nNow, the only thing I felt was really a huge minus was the pool. There was some kind of a problem with the water, the pool was closed almost during my whole stay of 6 nights. The pool was one of the reasons why I chose this particular hostel. Would have been a 4,5 out of 5 rating otherwise.",
      "title": "Superb location, nice staff",
      "trip_type": "Solo travel",
      "travel_date": "2023-08-31",
      "user": {
        "username": "K6723KSsonial",
        "user_location": {
          "id": "189934",
          "name": "Helsinki, Uusimaa"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/eb/6d/default-avatar-2020-19.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/eb/6d/default-avatar-2020-19.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/eb/6d/default-avatar-2020-19.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/eb/6d/default-avatar-2020-19.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/eb/6d/default-avatar-2020-19.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 914190359,
        "title": "Owner response",
        "text": "Dear Sonia, thank you for your comment. We are glad to hear that you had a good stay and liked the facilities and the friendly staff. We are sorry to hear that the pool was closed for a few days but we take its condition very seriously and we are carrying out tests and maintenance. We hope to welcome you back very soon! Regards from the SJH team ",
        "lang": "en",
        "author": "Silvia Pancaldi",
        "published_date": "2023-09-01T03:27:05Z"
      }
    },
    {
      "id": 910211437,
      "lang": "en",
      "location_id": 6400581,
      "published_date": "2023-08-14T05:57:19Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6400581-r910211437-Reviews-Sant_Jordi_Hostels_Rock_Palace-Barcelona_Catalonia.html?m=66827#review910211437",
      "text": "This is one of the best hostels I've ever stayed in all around the world, and I stay in at least 4 every year! The reason it's been given just 4 out of 5 is because of some issues I personally had that need addressing. If we start with the negatives first as there are only a few. The breakfast start time needs to be earlier as if you are venturing out in this wonderful city all day, not starting out until 09:30 because breakfast doesn't start until 08:30 is simply too late! In the dorm where I stayed we had 12 bunks but only 2 showers and 1 toilet between the lot of us, and there was no curtain for privacy to wrap around your bed. Also, the toilet light remained on all the time as there is no switch on the wall which was annoying as my bed was next to it and had no curtain to block out the light. The operation of the lights in the room is rather strange, the hostel has a low energy policy and switches the lights off in the dorms at 11pm at the reception...there's no switches in the rooms. This was also annoying as if you wished to go to bed early (as I did) the lights remained on and I couldn't get to sleep. Finally, on my final night I went to bed early as I had a very early flight the next morning but again couldn't sleep because there was a party night in operation downstairs and I was right above it all. I'm no killjoy and agree everyone should have a great time on holiday, but the music was simply deafening and didn't need to be as loud as it was. The hostel has an obligation to cater for all it's guests including the ones not attending the party or want an early night.\nIn the dorm we had a small rooftop balcony which had a washing line on it but most of the time this was locked. I don't see the point of having this facility if you can't actually access it?\nOK they're the issues I had, now for the good bits...\nThe hostel has very friendly staff always willing to help you out (big shout out to Nicola), and is only a short walk to the nearest metro station. It has many facilities to enjoy such as activities, evening meals, party nights, a rooftop which also has a plunge pool on it. There is a large dining area and kitchen where you can make your own food along with 3 large fridges to store your goods. The price per night is very reasonable given the facilities provided and this includes an all you can eat breakfast comprising of toast, ham, different croissants, different cereals, different juices, tea and coffee.\nThroughout the hostel and in the dorms there is AC, and in the dorms too you'll get a large locker, night light and socket next to your bed.   ",
      "title": "ONE OF THE BEST HOSTELS I'VE STAYED IN BUT SOME ISSUES NEED ADDRESSING",
      "trip_type": "Solo travel",
      "travel_date": "2023-08-31",
      "user": {
        "username": "jordanellie41",
        "user_location": {
          "id": "2437583",
          "name": "Longridge, Lancashire, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/b6/c1/ca/jordanellie41.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/b6/c1/ca/jordanellie41.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/b6/c1/ca/jordanellie41.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/b6/c1/ca/jordanellie41.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-m/1280/1a/b6/c1/ca/jordanellie41.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 910709086,
        "title": "Owner response",
        "text": "Thank you very much for your comment, we are delighted to hear that you had great attention from the staff and were pleased with the facilities. Regarding the lighting system, to prevent any distracted guest from turning on the main lights in the early morning and waking everyone up, the lights are turned off at night. As for the bathroom, you can find more of them on each floor. Thank you for all your suggestions, we take them very much into account. We look forward to welcoming you back soon. Best regards, the SJH team",
        "lang": "en",
        "author": "Silvia Pancaldi",
        "published_date": "2023-08-16T05:09:38Z"
      }
    },
    {
      "id": 909368290,
      "lang": "en",
      "location_id": 6400581,
      "published_date": "2023-08-10T16:06:36Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d6400581-r909368290-Reviews-Sant_Jordi_Hostels_Rock_Palace-Barcelona_Catalonia.html?m=66827#review909368290",
      "text": "This was my second visit to this hostel and I had no problems whatsoever, everything was safe, convenient, clean and well maintained. The breakfast was simple and cheap as well as the daily dinners offered. Staff were friendly, bedrooms and bathrooms were spacious. Good A/C in room too. I would definitely stay here again!!",
      "title": "Excellent stay!",
      "trip_type": "Solo travel",
      "travel_date": "2023-07-31",
      "user": {
        "username": "timeout20202",
        "user_location": {
          "id": "186337",
          "name": "Liverpool, Merseyside, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f1/42/default-avatar-2020-20.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f1/42/default-avatar-2020-20.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 909524553,
        "title": "Owner response",
        "text": "Thank you for sharing your review! We are very happy to hear that you chose us again and felt safe during your trip and enjoyed the clean facilities. May your next visit be at Sant Jordi Lisboa! Regards, the SJH team",
        "lang": "en",
        "author": "Silvia Pancaldi",
        "published_date": "2023-08-11T08:56:08Z"
      }
    }
  ]
}