{
  "data": [
    {
      "id": 945351738,
      "lang": "en",
      "location_id": 6946259,
      "published_date": "2024-04-04T12:55:55Z",
      "rating": 2,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d6946259-r945351738-Reviews-Four_Seasons_Resort_Dubai_at_Jumeirah_Beach-Dubai_Emirate_of_Dubai.html?m=66827#review945351738",
      "text": "This hotel was a huge disappointment for us. We were happy we stayed there only 3 nights… \n\nWe booked the sea view room trough the hotel website but when we arrived there at 8pm we got different room with the street and car park view (terrible) so we said we want to cancel the reservation. They said our sea view room will be ready next day but finally when we repeated we want to return to previous hotel they magical found sea view room for us on the 4th floor…\n\nUnfortunately they didn’t mentioned during booking there is construction work opposite the hotel. There are 2 new hotels Aman and Rosewood under construction :) so the sea view room is construction view…\n\nIn general it is not Four Seasons European Standard. Its more like cheap Egyptian or Turkish all inclusive 5 stars resort.\n\nThe breakfast is area is dirty. They don’t clean the tables. Breakfast is until 11:30 and it means that 11:30 there is nothing to eat. We came 11:23 and the lady at the entrance said that breakfast will finish in 7 minutes. And she didn’t lie. 11:30 the buffet was empty :) \n\nI do not recommend beach bag that you can find in the room. It is not for single use like in other hotels. I saw lady near the swimming pool was putting to this bag used diapers. I do not think they clean those bags properly because  its straw bag. Cannot imagine how after covid there are multiusage items in the hotels…\n\nService in the hotel is nice especially on the beach. It is a bit slow because of limited number of staff there. But they are doing their best. \n\nVery important - do not make booking direct with the hotel because it’s much more cheaper with booking.com\n\nWe got the rate from Booking.com  500aed cheaper per night (including taxes and all charges)  than from the reception.",
      "title": "Sea view is construction view",
      "trip_type": "Family",
      "travel_date": "2024-04-30",
      "user": {
        "username": "663anetaj",
        "user_location": {
          "id": "274723",
          "name": "Poland"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1c/91/70/90/caption.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1c/91/70/90/caption.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1c/91/70/90/caption.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-s/1c/91/70/90/caption.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 945944326,
        "title": "Owner response",
        "text": "Dear,\n\nWe are genuinely sorry that we didn't meet your expectations during your recent stay with us. \nYour feedback is valuable to us, and we will take this as an opportunity to learn and ensure that we can improve for the future. \nRest assured, we are investigating thoroughly and will take the necessary steps to ensure it is resolved promptly. \nPlease feel free to reach out to Francesco Corazzi, our Director of Rooms: Francesco.corazzi@fourseasons.com, who would like to further understand what happened.\nWe really hope to welcome you again in the future.\n\nWith Kind regards,\nCornelia Mitlmeier\nResort Manager - Four Seasons Resort Dubai at Jumeirah Beach",
        "lang": "en",
        "author": "sasha zeidan",
        "published_date": "2024-04-09T07:47:51Z"
      }
    },
    {
      "id": 943707825,
      "lang": "en",
      "location_id": 6946259,
      "published_date": "2024-03-25T01:41:30Z",
      "rating": 5,
      "helpful_votes": 1,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d6946259-r943707825-Reviews-Four_Seasons_Resort_Dubai_at_Jumeirah_Beach-Dubai_Emirate_of_Dubai.html?m=66827#review943707825",
      "text": "Four seasons is nice hotel friendly staff especially Praviz help me in the lobby with very kindly excellent service provided. also other staff in the hotel are very nice I will like to recommend other people also this hotel to come and also I will be staying here with my family.",
      "title": "Nice Service",
      "trip_type": "Family",
      "travel_date": "2024-03-31",
      "user": {
        "username": "Destination295970",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f1/06/default-avatar-2020-18.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f1/06/default-avatar-2020-18.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f1/06/default-avatar-2020-18.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f1/06/default-avatar-2020-18.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f1/06/default-avatar-2020-18.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "2": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        }
      },
      "owner_response": {
        "id": 943845069,
        "title": "Owner response",
        "text": "Dear Samji,   \n\nWe are delighted to hear you enjoyed your stay at Four Seasons Resort Dubai at Jumeirah Beach. Our staff really appreciates the recognition for their hard work! Thank you for your visit and for taking the time to share your precious feedback with us, we hope to welcome you again soon.  \n\nWith kind regards,  \nCornelia Mitlmeier \nResort Manager - Four Seasons Resort Dubai at Jumeirah Beach",
        "lang": "en",
        "author": "sasha zeidan",
        "published_date": "2024-03-26T02:18:08Z"
      }
    },
    {
      "id": 941650127,
      "lang": "en",
      "location_id": 6946259,
      "published_date": "2024-03-10T11:01:13Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d6946259-r941650127-Reviews-Four_Seasons_Resort_Dubai_at_Jumeirah_Beach-Dubai_Emirate_of_Dubai.html?m=66827#review941650127",
      "text": "From the moment I left my last solo trip in 2023, I knew I wanted to return to FSJB. There’s something about this resort that keeps tempting me back. Tempting me back to the point, that no matter which hotel I go to anywhere, I always end up talking to staff in other hotels about how great FSJB is. This is the one hotel where I honestly feel so at home. I was afraid that maybe, my stay wouldn’t be as good as my last, a year prior, and I hoped it most certainly would be better than 2022. Fast forward to 2024, and it wasn’t just my best stay at FSJB, it was my best stay in any hotel, ever. People in Dubai would comment a couple of years ago that they felt that they weren’t as welcome as in other hotels, as if they were being looked down upon. I can assure you that in 2024, they have the best staff I’ve had in any hotels. As soon as I stepped into the my home away from home, I felt at ease. Everybody was so welcoming. Staff has changed slightly from 2023, but the people they have working mow are the best. I hope they’re all there for my future stays too. A couple of years ago, I wouldn’t know many of the staff, but this stay superseded any. I left the hotel feeling so great and meeting some of the most amazing people who were working in the hotel. Check in was very quick, and once again my room was already ready. To my surprise, I was given a room which honestly, took my breath away. My worry was always getting a room which was blocked by the leaves of trees which happened on my first stay in 2022, but the room in 2023 and this one - I honestly loved the most. The room itself, was as always, clean…bright…and elegant. But the view was so central, that I honestly felt that I didn’t deserve such an amazing room. It was so beautiful, I felt so lucky. \n\nOne of the biggest changes I found in this stay was that the staff now are so approachable. A year ago, Mariana and Roxana has organised some dates for me to take home after I was struggling to find the same type to take back to London with me a day before flying. That was the sweetest gesture. However, this year, the care was even better.  The best. More about that later in the review.\n\nThe front desk staff honestly helped make my stay great. They’re the best in Dubai, and definitely treated me like we’re all friends. I didn’t get a chance to get many names but there was a very cheerful girl, I believe her name may have been Shobhna alongside another great male colleague, whose name I didn’t get. He helped check me out on the last day but both members were so friendly, if not the best I’d encountered for front desk compared to any hotels elsewhere. Both members of staff were so kind in assisting with photos, they’d always smile and were polite throughout. This isn’t a surprise as they were led by Mariana, who is mentioned earlier. Mariana herself, I found to be great, the most outstanding person I’ve crossed paths with in a long time. I was lucky enough to see her on my first day shortly after arriving. I was so privileged to have the most amazing conversation with her for quite some time. Instantly, I felt like I’m at home. As a solo traveller, my worry is always that I’d get bored or staff may be too short of time. But despite being busy, she made time to make me feel welcome and assured me that if I needed help with anything such as reservations, she’d be there to help. Her bubbly personality was the best thing as I knew I’d be in good hands for my stay. Even when I’d walk past, she’d give the biggest wave. It’s great to know that she was still working here, and I do hope that whenever I may return; she’d be there again. \n\nAgain, there are even more people who made my stay the best. Mr Lanvin, who was kind enough to check how my stay was going by calling me, was awesome. After being sunburnt, I decided I’d spend that night in the hotel room just in case things got worse for me. To my surprise, a very short while later I received one of the most amazing gestures. An employee of the hotel knocked on my door and gave me a bottle of Cooling Lotion, with such a lovely note from Mr Lanvin. I was honestly taken back by this as it saved me a trip to the pharmacy. It’s these surprise gestures, which made me realise that, FSJB is the one hotel I was lucky to be in. \n\nBreakfast every day was again, the best I’ve had in any hotel in the world at Suq. I was so glad that Mr Ahmed Abbas was still there in charge of the eatery. Although, a few of the staff weren’t there from my previous stay, the ones who I encountered were outstanding. Every single one of them made my day even better through the great customer service and conversation. One of whom who stood out was a lady from Bali. I believe her name was Ayu. She was definitely so lovely to speak to and would pop over for a chat, which reminded me that on my solo trip, I wouldn’t feel lonely. All staff were awesome, and the food was perfect. I do hope that if the hotel ever does any changes, they keep everything about Suq the same. Everything is so great about the place. Breakfast has great variety and I firmly believe that if things aren’t broken, why fix it? The same goes with Suq, it’s just perfect with the layout, outdoor seating and the staff. Even on the last day after breakfast, Mr Abbas kindly asked if I needed any snacks to take with me to the airport. Although I didn’t need any, this is why he’s so great. The smallest gestures, leaving the customer feeling cared for. \n\nI remember leaving the last day, really sad. It’s only ever happened at this hotel. But more so during this stay as I felt like everybody was so nice to me. I’d often hear comments such as “I’ll miss you” or “you’re so nice to talk to, please come back again”. It’s something you most probably wouldn’t hear in London but here at FSJB, the staff, they really were the best. As I write this, thoughts keep going through my head, I’m trying to remember if I’ve ever had so much love in one place, but…I think FSJB gave me the feeling of wanting to g to come back. Even on the last day, as I’d finished breakfast, o was chatting to Mr Abbas and a gentleman came to me with a frame which was signed by members of staff, to take home as a momento. I could not believe this. This was the most amazing thing anybody has ever done for me. I was informed that it was organised by Mariana who was not working that day, but was so thoughtful to have organised this. This was the final straw for me to say to myself “I cannot believe the kindness I’ve received” . \n\nTo me the staff are what made the stay beyond perfect. \n\nAmongst other things I loved the spa too. Again, the staff were so lovely and it was a pleasure to have had lovely conversations during my treatments. Likewise, Mercury Lounge was great too. Even though I was by myself, I didn’t ever feel that I was going to be rushed out so that the next customer could take my table. I was always made to feel welcome, and again staff did say they’d love to have me back. Most definitely, I’d return. The only shame was that I believe staff who were there last year may have moved on, I definitely did miss speaking to them but it’s still a lovely place to visit. The same goes for Shai Salon, who served me with the most amazing afternoon tea I’ve had.\n\nI can’t think of a more amazing resort than this one. The beach staff were great and the beach as always, was pristine. The one thing that I’d recommend every traveller to do is be aware that traffic can build up in the evenings so if you’re leaving the resort to go out, give it a bit of extra time. This isn’t the resort’s fault, it’s a testament to how great it is as people come here to have great meals.\n\nI also appreciated the lovely chats with the in room dining members, they were lovely too. I do not think there is one person who was rude and definitely, in 2024 the resort is outstanding. It’s a shame there is construction going on opposite as you sit on the beach. This did not distract me but over time I guess you’d lose some of the view. However, this isn’t the resort’s fault - Dubai is building things quickly and it’s just how it is. \n\nI think the saddest thing for me was that I didn’t get to meet, Ms Cornelia, this time around, who has totally got the resort perfectly ticking along. With the amazing staff, on site facilities, kindness and great vibes around the place, I can honestly say she probably is an inspirational leader. Probably the best in the business from what I can see. Whilst she’s temporarily off, the resort is in still outstanding hands with Mr Lanvin.\n\nI hope that one day I’d be able to return. Although I don’t think any stay could beat this one,  I do believe that the next stay would still be great. Well done one to everybody on making the stay perfect, easy and comfortable.",
      "title": "The best stay in any hotel, ever",
      "trip_type": "Solo travel",
      "travel_date": "2024-02-29",
      "user": {
        "username": "X5659TJkarank",
        "user_location": {
          "id": "186338",
          "name": "London, England"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e9/60/default-avatar-2020-64.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e9/60/default-avatar-2020-64.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e9/60/default-avatar-2020-64.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e9/60/default-avatar-2020-64.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e9/60/default-avatar-2020-64.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 941856353,
        "title": "Owner response",
        "text": "Dear X5659TJkarank,   \n\nWe are more than delighted to hear you enjoyed your stay at Four Seasons Resort Dubai at Jumeirah Beach. We appreciate your kind words about our dedicated staff, especially Mariana, Shobhna, and Mr. Lanvin. We will make sure to tell our colleagues how pleased you were with their services. Thank you for your visit and for taking the time to share your precious feedback with us, we hope to welcome you again soon.  \n\nWith kind regards,  \nCornelia Mitlmeier \nResort Manager - Four Seasons Resort Dubai at Jumeirah Beach",
        "lang": "en",
        "author": "sasha zeidan",
        "published_date": "2024-03-12T02:07:53Z"
      }
    },
    {
      "id": 941423472,
      "lang": "en",
      "location_id": 6946259,
      "published_date": "2024-03-08T11:47:28Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d6946259-r941423472-Reviews-Four_Seasons_Resort_Dubai_at_Jumeirah_Beach-Dubai_Emirate_of_Dubai.html?m=66827#review941423472",
      "text": "Mariana \"chief concierge\" undeniably lacks professional and hospitality and phone etiquette. \n\nShe's not for the light of hearts.\n\nShe's not shy to insinuate she can influence her general manager to have certain places removed from their list of recommendations if things don't go her way.  \n\nIf she is not being assisted by senior manager then you have/will not assist her at all - she will shove it in your face your not worth her time.\n\nIt's not easy to overlook her rude demanding, negative and aggresive energy when she's speaking leaving distasteful taste in the mouth.",
      "title": "Mariana - Sternly uncouth",
      "trip_type": "Solo travel",
      "travel_date": "2024-03-31",
      "user": {
        "username": "I9636ZXjanetm",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e7/7b/default-avatar-2020-56.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e7/7b/default-avatar-2020-56.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e7/7b/default-avatar-2020-56.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e7/7b/default-avatar-2020-56.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e7/7b/default-avatar-2020-56.jpg"
        }
      },
      "subratings": {}
    },
    {
      "id": 939614796,
      "lang": "en",
      "location_id": 6946259,
      "published_date": "2024-02-24T12:17:43Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g295424-d6946259-r939614796-Reviews-Four_Seasons_Resort_Dubai_at_Jumeirah_Beach-Dubai_Emirate_of_Dubai.html?m=66827#review939614796",
      "text": "Incredible service! The staff at this hotel always impresses with their commitment to their customers. \n\nFrom the bell staff to the reception team each person is so kind and attentive.\n\nSuper shoutout for Vitalli at the concierge! He made my day!",
      "title": "Exceptional service!",
      "trip_type": "Friends getaway",
      "travel_date": "2024-02-29",
      "user": {
        "username": "111Mad",
        "user_location": {
          "id": "295414",
          "name": "Karachi, Sindh Province"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/df/2b/default-avatar-2020-39.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/df/2b/default-avatar-2020-39.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/df/2b/default-avatar-2020-39.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/df/2b/default-avatar-2020-39.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/df/2b/default-avatar-2020-39.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 939930326,
        "title": "Owner response",
        "text": "Dear 111Mad, \n\nWe are delighted to hear you enjoyed your stay at Four Seasons Resort Dubai at Jumeirah Beach. Thank you for your visit and taking the time to share your precious feedback with us, we will for sure be sharing your kind words with Vitalii and the team, and we hope to welcome you back very soon!\n\nWith kind regards, \nCornelia Mitlmeier \nResort Manager - Four Seasons Resort Dubai at Jumeirah Beach \n",
        "lang": "en",
        "author": "sasha zeidan",
        "published_date": "2024-02-26T23:32:22Z"
      }
    }
  ]
}