{
  "data": [
    {
      "id": 945570441,
      "lang": "en",
      "location_id": 8800760,
      "published_date": "2024-04-06T10:04:49Z",
      "rating": 2,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8800760-r945570441-Reviews-Negresco_Princess_Hotel-Barcelona_Catalonia.html?m=66827#review945570441",
      "text": "My kids and I attended the hotels breakfast buffet. \nIt was a great disappointment. There were a lot of choices, but the quality of each thing was truly low. Served in a room with very bad acoustics and no ambiance. \n\nCoffee made with powdered milk\nJuice made from an automate from water mixed with something and supposed to end up fresh? \nBread that was jenuine and boring, not homemade. \nFried eggs with a crust on the yolk\nvery little homemade \nVery little taste\n\nThere is a conflict between price and quality, you cannot serve such a bad breakfast with that price. \nLocation and roof terrasse was nice. Rooms were medium.\nThey tried to charge me turist tax on my kids, not realy honest way of earning money.",
      "title": "Low quality breakfast",
      "trip_type": "Family",
      "travel_date": "2024-04-30",
      "user": {
        "username": "937ceciliec",
        "user_location": {
          "id": "189541",
          "name": "Copenhagen, Zealand"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/e7/99/default-avatar-2020-57.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/e7/99/default-avatar-2020-57.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/e7/99/default-avatar-2020-57.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/e7/99/default-avatar-2020-57.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e7/99/default-avatar-2020-57.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 945807259,
        "title": "Owner response",
        "text": "Dear Guest, \n\nThank you for taking the time to provide feedback regarding your recent experience at Hotel Negresco Princess 4*S. We sincerely apologize that your breakfast experience did not meet your expectations and for any inconvenience this may have caused you and your family.\n\nYour feedback regarding the quality of our breakfast offerings is invaluable to us, and we are disappointed to hear that the options provided did not meet your standards. Please rest assured that we take your comments seriously and will address them with our culinary team to ensure that improvements are made to enhance the overall dining experience for our guests.\n\nWe apologize for any confusion regarding the tourist tax for your children. Our intention is always to provide transparent and fair pricing, and we regret any misunderstanding in this regard.\n\nOn a positive note, we are pleased to hear that you enjoyed our hotel's location and rooftop terrace. We appreciate your acknowledgment of these aspects of your stay.\n\nOnce again, we apologize for falling short of your expectations and thank you for bringing these matters to our attention. We hope to have the opportunity to welcome you back in the future for a more satisfying experience.\n\nKind regards, \n\nAnna Pagés\nQuality Department\nHotel Negresco Princess 4*S",
        "lang": "en",
        "author": "JAIRO MAYOLAS",
        "published_date": "2024-04-08T05:40:25Z"
      }
    },
    {
      "id": 945375462,
      "lang": "en",
      "location_id": 8800760,
      "published_date": "2024-04-04T16:36:23Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8800760-r945375462-Reviews-Negresco_Princess_Hotel-Barcelona_Catalonia.html?m=66827#review945375462",
      "text": "Perfect location to explore Barcelona - we walked everywhere. Hotel was way above our expectations and all the staff went above and beyond.  They offer a concierge service and recommended and booked restaurants for us. Breakfast was of high quality, rooftop terrace and pool was a bonus. We had a lovely 3 nights and would definitely return/recommend this hotel!",
      "title": "Great hotel!",
      "trip_type": "Family",
      "travel_date": "2024-04-30",
      "user": {
        "username": "21SuzanneC",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f0/d5/default-avatar-2020-17.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f0/d5/default-avatar-2020-17.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f0/d5/default-avatar-2020-17.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f0/d5/default-avatar-2020-17.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f0/d5/default-avatar-2020-17.jpg"
        }
      },
      "subratings": {
        "0": {
          "name": "RATE_VALUE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
          "value": 4,
          "localized_name": "Value"
        },
        "1": {
          "name": "RATE_ROOM",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Rooms"
        },
        "2": {
          "name": "RATE_LOCATION",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Location"
        },
        "3": {
          "name": "RATE_CLEANLINESS",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Cleanliness"
        },
        "4": {
          "name": "RATE_SERVICE",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Service"
        },
        "5": {
          "name": "RATE_SLEEP",
          "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
          "value": 5,
          "localized_name": "Sleep Quality"
        }
      },
      "owner_response": {
        "id": 945412679,
        "title": "Owner response",
        "text": "Dear Guest, \n\nThank you very much for taking the time to share your wonderful feedback about your recent stay at Hotel Negresco Princess 4*S. We are thrilled to hear that you had such a great experience with us!\n\nIt's fantastic to know that our prime location made exploring Barcelona convenient for you, allowing you to explore the city on foot. We are delighted that our hotel exceeded your expectations and that our dedicated team went above and beyond to ensure your comfort and satisfaction. Providing excellent service is our top priority, and we are glad to hear that our concierge service was helpful in recommending and booking restaurants for you.\n\nWe are thrilled that you enjoyed our high-quality breakfast offerings and took advantage of our rooftop terrace and pool facilities. It's always rewarding to hear that our guests appreciate these amenities.\n\nThank you for choosing Hotel Negresco Princess 4*S, and we look forward to welcoming you back for another memorable stay. \n\nKind regards, \n\nAnna Pagés\nQuality Department\nHotel Negresco Princess 4*S",
        "lang": "en",
        "author": "JAIRO MAYOLAS",
        "published_date": "2024-04-05T03:18:10Z"
      }
    },
    {
      "id": 943265418,
      "lang": "en",
      "location_id": 8800760,
      "published_date": "2024-03-21T09:49:04Z",
      "rating": 5,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8800760-r943265418-Reviews-Negresco_Princess_Hotel-Barcelona_Catalonia.html?m=66827#review943265418",
      "text": "Without a doubt the best city hotel I’ve taken my group to in the past 20 years.\n41 of us had a lovely  time in this hotel.\nThere were a few who all made the same observation ; that it was advertised to us by the travel company as having tea/coffee failures in the rooms. Most of us didn’t BUT those who went to reception to talk about it were given a kettle etc. \nwhere to start?\nRooms were excellent.\nThe shower was the best I’ve ever used including home! Easy to operate with one push button , easy to turn heat up or down.\nNo leaking at all over the bathroom floor !\nLovely toiletries .\nVery comfortable bed with long and super pillows. Plenty of storage .\nOn arrival the reception staff already had our 35 keys in numbered wallets ready for me to hand out . We don’t always get that!\n\nThe reception staff bent over backwards to help us at any time.\n\nThe food was totally excellent; everything and more you could wish for at breakfast including a glass of Prosecco - not for me but a few of group enjoyed this. \nMany of us ate in the restaurant in the evening - there was a special offer of three courses, plus an entree, bread on the table, two glasses of wine or beer, tea or coffee afterwards for €30!! And it was served beautifully and tasted sublime !\nI just can’t fault this hotel . THANK YOU",
      "title": "If I come back to Barcelona, I wouldn’t look at staying anywhere else!",
      "trip_type": "Friends getaway",
      "travel_date": "2024-03-31",
      "user": {
        "username": "Chrissywolfe51",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f2/7a/default-avatar-2020-25.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f2/7a/default-avatar-2020-25.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f2/7a/default-avatar-2020-25.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f2/7a/default-avatar-2020-25.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f2/7a/default-avatar-2020-25.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 943351297,
        "title": "Owner response",
        "text": "Dear Guest,\n\nWe are absolutely thrilled to hear about your fantastic experience at Hotel Negresco Princess 4*S! Your glowing review truly means the world to us. It brings us immense joy to know that you and your group had such a memorable stay with us during your time in Barcelona.\n\nWe sincerely appreciate your kind words regarding our rooms, shower facilities, toiletries, and comfortable amenities. It's wonderful to hear that our reception staff provided attentive service and accommodated your needs promptly and efficiently. Ensuring a seamless and enjoyable stay for our guests is always our top priority.\n\nFurthermore, we're delighted that you enjoyed our delicious breakfast spread, complete with a glass of Prosecco for those who indulge, as well as the exceptional dining experience offered in our restaurant. Our team takes great pride in delivering culinary excellence and providing exceptional value to our guests.\n\nThank you once again for choosing to stay with us and for taking the time to share your feedback. It would be our pleasure to welcome you back to Hotel Negresco Princess 4*S should your travels bring you to Barcelona in the future. Until then, we extend our warmest regards and best wishes for your continued adventures!\n\nKind regards, \n\nAnna Pagés\nQuality Department\nHotel Negresco Princess 4*S",
        "lang": "en",
        "author": "JAIRO MAYOLAS",
        "published_date": "2024-03-22T04:53:51Z"
      }
    },
    {
      "id": 941318272,
      "lang": "en",
      "location_id": 8800760,
      "published_date": "2024-03-07T12:04:19Z",
      "rating": 1,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8800760-r941318272-Reviews-Negresco_Princess_Hotel-Barcelona_Catalonia.html?m=66827#review941318272",
      "text": "Never again. \nPictures look great and invitable in web. \nThey sell the room for an incredible amount of money and there is no place to really open up suitcase and leave it open. \nCannot pass it on the way to the bathroom. \nI am forced to unpack and store it in the wardrobe. \nDirty carpet in front of rooms/ hallway. \nThats not a superior room at all. \nAfter complaining they were not able to change the room for us. \nDefinately dont come back.",
      "title": "Never again",
      "trip_type": "Couples",
      "travel_date": "2024-03-31",
      "user": {
        "username": "Roam06822935165",
        "user_location": {
          "id": "null"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/1a/f6/f3/e4/default-avatar-2020-30.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/1a/f6/f3/e4/default-avatar-2020-30.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/1a/f6/f3/e4/default-avatar-2020-30.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/1a/f6/f3/e4/default-avatar-2020-30.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f3/e4/default-avatar-2020-30.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 941395292,
        "title": "Owner response",
        "text": "Dear Guest,\n\nWe are deeply sorry to hear about your disappointing experience during your recent stay at the Hotel Negresco Princess 4*S.\n\nIt is truly disheartening to learn that your expectations were not met, and we apologize for any inconveniences you encountered regarding the size of the room and the condition of the carpet. Please accept our sincerest apologies for falling short of your expectations.\n\nWe understand the importance of providing comfortable accommodations where guests can feel at ease, and we regret that we were unable to resolve the issues to your satisfaction during your stay.\n\nWe would greatly appreciate it if you could provide us with more details about your experience by contacting us at calidad.negresco@princess-hotels.com. Your feedback is invaluable to us as it helps us identify areas for improvement and ensures that we provide a superior experience for all our guests in the future.\n\nOnce again, we apologize for any inconvenience caused, and we hope to have the opportunity to regain your trust and welcome you back for a more enjoyable stay.\n\nKind regards, \n\nAnna Pagés\nQuality Department\nHotel Negresco Princess 4*S",
        "lang": "en",
        "author": "JAIRO MAYOLAS",
        "published_date": "2024-03-08T06:56:16Z"
      }
    },
    {
      "id": 940634975,
      "lang": "en",
      "location_id": 8800760,
      "published_date": "2024-03-03T04:35:33Z",
      "rating": 4,
      "helpful_votes": 0,
      "rating_image_url": "https://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-66827-5.svg",
      "url": "https://www.tripadvisor.com/ShowUserReviews-g187497-d8800760-r940634975-Reviews-Negresco_Princess_Hotel-Barcelona_Catalonia.html?m=66827#review940634975",
      "text": "Taxi was €35 from airport. Greeted by doorman and reception staff very friendly and helpful. They have parking but spaces and height is restricted, suggest use public transport. Many bakeries around so didn’t bother with buffet. Room was a little small, clean and beds comfy. Bathroom door noisy so tried to keep it open. Beer and water replenished in fridge everyday. \nWalking distance to hop on hop off bus starting point and could walk to most attractions",
      "title": "Best location, steps from city centre",
      "trip_type": "Couples",
      "travel_date": "2024-02-29",
      "user": {
        "username": "alsupremo",
        "user_location": {
          "id": "153339",
          "name": "Canada"
        },
        "avatar": {
          "thumbnail": "https://media-cdn.tripadvisor.com/media/photo-t/24/1c/8e/70/alsupremo.jpg",
          "small": "https://media-cdn.tripadvisor.com/media/photo-l/24/1c/8e/70/alsupremo.jpg",
          "medium": "https://media-cdn.tripadvisor.com/media/photo-f/24/1c/8e/70/alsupremo.jpg",
          "large": "https://media-cdn.tripadvisor.com/media/photo-p/24/1c/8e/70/alsupremo.jpg",
          "original": "https://media-cdn.tripadvisor.com/media/photo-m/1280/24/1c/8e/70/alsupremo.jpg"
        }
      },
      "subratings": {},
      "owner_response": {
        "id": 940754396,
        "title": "Owner response",
        "text": "Dear Guest, \n\nThank you for your detailed feedback on your stay at Hotel Negresco Princess 4*S. We're thrilled to hear that you found our location to be the best, just steps away from the city center. It's fantastic that you received a warm welcome from our doorman and reception staff, and we're pleased to know that they were friendly and helpful throughout your stay.\n\nWe appreciate your tip regarding parking; indeed, public transport can often be a more convenient option in city centers with restricted parking spaces. It's great to hear that you enjoyed exploring the nearby bakeries instead of opting for the buffet.\n\nWe apologize if the room size didn't fully meet your expectations, but we're glad you found it clean and the beds comfortable. Your feedback about the bathroom door noise is duly noted, and we'll look into ways to address this issue for future guests.\n\nWe're delighted that you enjoyed the complimentary replenishment of beer and water in your fridge every day. It sounds like you made good use of our convenient location, with easy access to the hop-on-hop-off bus starting point and walking distance to most attractions.\n\nWe sincerely appreciate your stay with us and hope to welcome you back for another enjoyable experience in the future. If there's anything else we can assist you with, please don't hesitate to let us know.\n\nKind regards,\n\nAnna Pagés\nQuality Department\nHotel Negresco Princess 4*S\n",
        "lang": "en",
        "author": "JAIRO MAYOLAS",
        "published_date": "2024-03-04T03:07:36Z"
      }
    }
  ]
}